Repository: amotoki/edge-computing-whitepaper
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, eo, id, ja, ko_kr, pt_br, zh_cn

source: Index to all documentation, for every role and step in planning and operating an OpenStack cloud.
de: Index für die gesamte Dokumentation, für jede Rolle und jeden Schritt bei der Planung und dem Betrieb einer OpenStack-Cloud.
eo: Indekso al ĉiu dokumentado, por ĉiu rolo kaj paŝo en planado kaj funkciado de OpenStack-nubo.
id: Indeks ke semua dokumentasi, untuk setiap peran dan langkah dalam merencanakan dan mengoperasikan awan OpenStack.
ja: OpenStack クラウドを計画し、運用するすべての役割と段階のための全ドキュメントのインデックスです。
ko_kr: OpenStack 클라우드를 계획하고 운용하는 모든 역할과 단계에 대한 모든 문서에 대한 찾아보기를 볼 수 있습니다.
pt_br: Índice para toda a documentação, para todas as regras e passos para planejamento e operação de uma nuvem OpenStack.
zh_cn: 关于计划和运营OpenStack云过程中每个角色与步骤的所有文档索引

source: Welcome to the community! (https://www.openstack.org/community/)
de: Willkommen in der Gemeinschaft! (https://www.openstack.org/community/)
eo: Bonvenon al la komunumo! (https://www.openstack.org/community/)
id: Selamat datang di komunitas! (https://www.openstack.org/community/)
ko_kr: 커뮤니티에 합류하신 것을 환영합니다! (https://www.openstack.org/community/)
pt_br: Bem-vindo à comunidade! (https://www.openstack.org/community/)

source: Join mailing lists and IRC channels, find jobs and events, access the source code and more.
de: Registrieren Sie sich bei Mailing-Listen und IRC-Kanälen, finden SIe Jobs und Events, greifen Sie auf den Quellcode zu und mehr.
eo: Aliĝi al dissendolistoj kaj IRC-kanaloj, trovi laborojn kaj eventojn, aliri la fontkodon kaj pli.
id: Bergabunglah dengan milis dan saluran IRC, cari pekerjaan dan acara, akses kode sumber dan banyak lagi.
ja: メーリングリストやIRCチャンネルに参加し、仕事やイベントを探し、ソースコードやその他にアクセスしましょう。
ko_kr: 메일링리스트 및 IRC 채널에 가입하여, 직업 및 이벤트를 찾고, 소스 코드에 액세스 등을 합니다.
pt_br: Entre em listas de discussões e canais IRC, encontre empregos e eventos, acesse o código fonte e mais.
zh_cn: 欢迎加入邮件列表和IRC频道，寻找工作机会和活动信息，访问源代码等。

source: User groups (https://groups.openstack.org/)
de: Benutzer-Gruppen (https://groups.openstack.org/)
eo: Uzanto grupoj (https://groups.openstack.org/)
id: Grup Pengguna (https://groups.openstack.org/)
ko_kr: 사용자 그룹 (https://groups.openstack.org/)
pt_br: Grupos de usuários (https://groups.openstack.org/)

source: Find a user group near you, attend meetups and hackathons—or organize one!
de: Finden Sie eine Benutzergruppe in Ihrer Nähe, besuchen Sie Meetups und Hackathons - oder organisieren Sie eine!
eo: Trovu grupon de uzantoj proksime al vi, atentu renkontiĝojn kaj hackatons-aŭ organizu unu!
id: Temukan kelompok pengguna di dekat Anda, menghadiri pertemuan dan hackathons-atau aturlah!
ja: あなたの近くにあるユーザーグループを探し、meetup やハッカソンに参加、もしくは開催しましょう！
ko_kr: 여러분 근처에 있는 사용자 그룹을 찾은 후, 밋업 및 해커톤에 참석합니다—아니면 직접 만들어보세요!
pt_br: Encontre um grupo de usuários perto de você, participe de meetups e hackathons—ou organize um!
zh_cn: 找到您附近的用户组，参加Meetup和黑客松活动，或自己组织一个！
