Repository: amotoki/edge-computing-whitepaper
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, eo, id, ja, ko_kr, pt_br, zh_cn

source: Four major categories of workload requirements that benefit from a distributed architecture are analytics, compliance, security, and NFV.
de: Vier Hauptkategorien von Workload-Anforderungen, die von einer verteilten Architektur profitieren, sind Analyse, Compliance, Sicherheit und NFV.
eo: Kvar gravaj kategorioj de laborŝarĝo postuloj kiuj profitas de distribuita arkitekturon estas analitiko, observo, sekureco kaj NFV.
id: Empat kategori utama persyaratan beban kerja (workload) yang mendapatkan keuntungan dari arsitektur terdistribusi adalah analisis, kepatuhan, keamanan, dan NFV.
ja: 分散アーキテクチャーから利益を受ける主要な 4 つのワークロードは、分析、法令遵守要件、セキュリティーと NFV です。
ko_kr: 분산 아키텍처의 좋은 점을 누리는 네가지 주요 워크로드 요구 사항은 분석, 컴플라이언스, 보안, NFV입니다.
pt_br: Quatro categorias principais de requisitos de carga de trabalho que se beneficiam da arquitetura distribuída são: Análise, conformidade, segurança e NFV.
zh_cn: 分析，合规，安全和网络功能虚拟化是受益于分布式架构的四类主要工作需求。

source: Data Collection and Analytics
de: Datensammlung und Analyse
eo: Datuma Kolekto kaj Analitiko
id: Pengumpulan Data dan Analytics
ja: データ収集と分析
ko_kr: 데이터 수집과 분석
pt_br: Coleta e Análise de Dados
zh_cn: 数据采集及分析

source: IoT, where data is often collected from a large network of microsites, is an example of an application that benefits from the edge computing model. Sending masses of data over often limited network connections to an analytics engine located in a centralized data center is counterproductive; it may not be responsive enough, could contribute to excessive latency, and wastes precious bandwidth. Since edge devices can also produce terabytes of data, taking the analytics closer to the source of the data on the edge can be more cost-effective by analyzing data near the source and only sending small batches of condensed information back to the centralized systems. There is a tradeoff here—balancing the cost of transporting data to the core against losing some information.
de: Das IoT, bei dem häufig Daten aus einem großen Netzwerk von Microsites erfasst werden, ist ein Beispiel für eine Anwendung, die vom Edge-Computing-Modell profitiert. Das Senden von Massen von Daten über häufig begrenzte Netzwerkverbindungen zu einer Analyse-Engine, die sich in einem zentralisierten Datenzentrum befindet, ist kontraproduktiv; Es reagiert möglicherweise nicht ausreichend, kann zu übermäßiger Latenz beitragen und verschwendet wertvolle Bandbreite. Da Edge-Geräte auch Terabytes an Daten produzieren können, kann die Analyse näher an die Quelle der Daten am Rand herangebracht werden, da Daten in der Nähe der Quelle analysiert werden und nur kleine Mengen kondensierter Informationen an die zentralisierten Systeme gesendet werden. Es gibt hier einen Kompromiss - die Kosten für den Datentransport zum Kern auszugleichen, um einige Informationen zu verlieren.
eo: IoT, kie datumoj estas ofte kolektita de granda reto de mikroejoj, estas ekzemplo de apliko kiu profitas de la rando komputanta modelo. Sendanta amasojn de datumo super ofte limigita retajn konektojn al analitika funkciigilo troviĝita en centralizita datumo centro estas malutila; ĝi ne povas esti respondema sufiĉa, povus kontribui al troa atendotempo kaj malŝparas valoran kapaciton. Pro tio ke randaj aparatoj ankaŭ povas produkti terabajtoj da datumo, prenanta la analizilo pli proksima al la fonto de la datumo sur la rando povas esti pli kostefika per analizanta datumon proksime al la fonto kaj nur sendanta malgrandajn arojn de densigita informon reen al la centralizitaj sistemoj. Estas kompromiso ĉi tie—ekvilibriganta la koston transporti datumon al la kerno kontraŭ perdanta kelkan informon.
id: IoT, dimana data sering dikumpulkan dari jaringan besar microsites, merupakan contoh aplikasi yang mendapat keuntungan dari model komputasi tepi. Mengirimkan banyak data melalui koneksi jaringan yang seringkali terbatas ke mesin analisis yang berada di pusat data terpusat bersifat kontraproduktif; Mungkin tidak cukup responsif, bisa berkontribusi pada latensi yang berlebihan, dan menghabiskan bandwidth yang berharga. Karena perangkat tepi juga dapat menghasilkan terabyte data, analisis lebih dekat ke sumber data di tepinya dapat lebih hemat biaya dengan menganalisis data di dekat sumber dan hanya mengirim sejumlah kecil informasi terkondensasi kembali ke sistem terpusat. Ada tradeoff di sini-menyeimbangkan biaya pengangkutan data ke inti dari kehilangan beberapa informasi.
ja: IoT は、ここではごく小さなサイトの大きなネットワークから常にデータ収集を行うものを言いますが、エッジコンピューティングから利益を受けるアプリケーションの一例です。大量のデータを、しばしば制約が発生するネットワーク越しに集約型データセンターの分析エンジンに転送することは非効率的でしょう。この方式は恐らくレスポンスが悪いでしょうし、過度な遅延要件が求められるでしょう。さらに貴重な帯域の無駄遣いになります。エッジ装置はテラバイト級のデータを生成することも出来るため、分析機能をエッジ上にあるデータ源に近づけ、データ源近くで分析し、要約された小さな情報だけを集約型システムに送り返すことで、よりコスト効率を上げることが出来ます。この方式は、トレードオフが発生します。すなわちコアにデータを転送するためのコストと、いくつかの情報が失われることのバランスをとることになります。
ko_kr: 데이터가 마이크로 사이트의 대규모 네트워크에서 종종 수집되는 IoT는 edge computing 모델로 혜택을 받는 애플리케이션의 좋은 예입니다. 중앙 집중된 데이터 센터에 있는 분석 엔진에 대한 제한된 네트워크 연결을 통해 대량의 데이터를 전송하는 것은 비생산적입니다. 충분히 반응하지 않을 수 있으며, 과도한 레이턴시를 발생할 수 있으며, 귀중한 대역폭을 낭비합니다. Edge 장치는 테라 바이트급의 데이터를 생성할 수 있기에 소스 근처에 존재하는 데이터를 분석하고 압축된 정보에 대한 일괄 처리를 중앙 집중식 시스템으로 보내는 것보다는 분석을 edge 데이터 소스에 가깝게 만드는 것이 비용적인 면에서 효과적일 수 있습니다. 여기에는 일부 정보 손실을 대비하여 데이터를 코어로 전송하는 비용 균형을 맞추는 거래가 있을 수 있습니다.
pt_br: IoT, onde dados frequentemente são coletados de uma grande rede de micro sites, é um exemplo de uma aplicação que se beneficia do modelo de computação de borda. Enviando massas de dados por conexões de rede geralmente limitadas para um mecanismo de análise localizado em um centro de dados é contraproducente; isso pode não ser responsivo o suficiente, poderia contribuir para uma latência excessiva e gastaria grande largura de banda. Como os dispositivos de borda também podem produzir terabytes de dados, aproximando-se a análise da fonte dos dados do dispositivo pode ter um melhor custo efetivo ao se enviar apenas pequenos lotes de informação condensada de volta para o sistema centralizador. Existe uma compensação aqui—balanceamento do custo de se transportar dados para o núcleo contra a perda de alguma informação.
zh_cn: 物联网的数据通常采集于大规模的微型站点，是受益于边缘计算模型的典型应用。如果大量的数据是通过有限的网络连接传输至位于集中式数据中心的分析引擎进行数据分析，这将会适得其反；分析引擎可能出现响应不足，也可能导致额外的延时并浪费宝贵的带宽。鉴于边缘计算设备同样能够产生兆兆级数据，将数据接近于源头进行分析，只向中枢系统发送小批量的汇总信息，如此靠近边缘侧数据源的分析方式显得更具有成本效益。当然，这其中也需要在向中枢传递数据所产生的成本和缺失部分信息之间进行权衡。

source: Security
de: Sicherheit
eo: Sekureco
id: Keamanan
ja: セキュリティー
ko_kr: 보안
pt_br: Segurança
zh_cn: 安全

source: Unfortunately, as edge devices proliferate––including mobile handsets and IoT sensors––new attack vectors are emerging that take advantage of the proliferation of endpoints. Edge computing offers the ability to move security elements closer to the originating source of attack, enables higher performance security applications, and increases the number of layers that help defend the core against breaches and risk.
de: Mit der Verbreitung von Edge-Geräten - einschließlich Mobiltelefonen und IoT-Sensoren - entstehen neue Angriffsvektoren, die von der Verbreitung von Endpunkten profitieren. Edge Computing bietet die Möglichkeit, Sicherheitselemente näher an die Ursprungsquelle des Angriffs zu verschieben, ermöglicht leistungsfähigere Sicherheitsanwendungen und erhöht die Anzahl der Schichten, die den Kern gegen Angriffe und Risiken schützen.
eo: Bedaŭrinde, kiel randaj aparatoj multiĝas––inkluzivanta moveblajn manaĵojn kaj IoT sentilojn––nova atako vektoroj estas aperanta kiuj utiligas la dismultiĝon de finpunktoj. Randa komputiko proponas la kapablecon movi sekurecajn elementojn pli proksima al la devenanta fonto de atako, ebligas pli altan elfaron de sekurecaj aplikoj kaj pliigas la nombron de tavoloj kiuj helpas defendi la kernon kontraŭ breĉoj kaj risko.
id: Sayangnya, karena perangkat tepi berkembang biak - termasuk handset mobile dan sensor IoT - vektor serangan baru muncul yang memanfaatkan proliferasi titik akhir. Komputasi tepi menawarkan kemampuan untuk memindahkan elemen keamanan lebih dekat ke sumber serangan yang berasal, memungkinkan aplikasi keamanan kinerja yang lebih tinggi, dan meningkatkan jumlah lapisan yang membantu mempertahankan inti dari pelanggaran dan risiko.
ja: 不幸なことに、携帯ハンドセットや IoT センサを含むエッジ装置の急増により、エンドポイントの急増を利点とする新しい攻撃手法が現れてきています。エッジコンピューティングはセキュリティー要素を攻撃者に近づける能力を提供します。この能力は、セキュリティーアプリケーションのより高い性能を実現し、抜け穴やリスクに対するコアの防御を助ける何層もの防御層の数を増やします。
ko_kr: 안타깝게도 모바일 핸드셋과 IoT 센서를 비롯한 첨당 장치가 늘어남에따라 endpoint 의 확산을 이용하는 새로운 공격 경로가 등장하고 있습니다. Edge computing은 보안 요소를 원래의 공격 소스에 더 가깝게 이동시킬 수 있는 기능을 제공하고, 고성능 보안 애플리케이션을 가능하게하며, 침입과 위험으로부터 코어를 방어하는데 도움이 되는 계층의 수를 증가시킵니다.
pt_br: Infelizmente, à medida que os dispositivos de borda proliferam––incluindo aparelhos celulares e sensores de IoT––surgem novos vetores de ataques que aproveitam essa proliferação dos pontos de acesso. A computação de borda oferece a capacidade de mover elementos de segurança para próximo da origem do ataque, possibilitando maior desempenho das aplicações de segurança e aumentando o número de camadas que ajudam a defender o núcleo contra brechas e riscos.
zh_cn: 遗憾的是，随着边缘设备（包括手机及物联网传感器）的普及，终端设备的激增也使得新兴的攻击矢量不断涌现。边缘计算能够使得安全部件更接近于攻击源，启动更高效的安全应用并增加分层数量以抵御针对核心的侵犯和风险。

source: Compliance Requirements
de: Konformitätsanforderungen
eo: Konformiĝo Postuloj
id: Persyaratan Kepatuhan
ja: 法令遵守要件
ko_kr: 규정 준수 요구 사항
pt_br: Requisitos de conformidade
zh_cn: 合规要求

source: Compliance covers a broad range of requirements, ranging from geofencing, data sovereignty, and copyright enforcement. Restricting access to data based on geography and political boundaries, limiting data streams depending on copyright limitations, and storing data in places with specific regulations are all achievable and enforceable with edge computing infrastructure.
de: Compliance deckt eine breite Palette von Anforderungen ab, die von Geofencing, Datenhoheit und Urheberrechtsdurchsetzung reichen. Die Beschränkung des Zugriffs auf Daten basierend auf geografischen und politischen Grenzen, die Begrenzung von Datenströmen in Abhängigkeit von Urheberrechtsbeschränkungen und die Speicherung von Daten an Orten mit spezifischen Vorschriften sind alle mit einer Edge-Computing-Infrastruktur erreichbar und durchsetzbar.
eo: Konformiĝo kovras larĝan gamon de postuloj, varianta de geobarikadi, datuma suvereneco kaj kopirajta efikigado. Restrikti aliron al datumo bazita sur geografio kaj politikaj limoj, limiganta datumajn riveretojn dependanta sur kopirajtaj limoj kaj entenanta datumon en lokoj kun specifaj reguligoj estas ĉiuj havebla kaj efektivigebla kun rando komputanta infrastrukturon.
id: Kepatuhan mencakup berbagai persyaratan, mulai dari geofencing, kedaulatan data, dan penegakan hak cipta. Membatasi akses data berdasarkan geografi dan batas politik, membatasi arus data tergantung pada keterbatasan hak cipta, dan menyimpan data di tempat dengan peraturan tertentu dapat dicapai dan dapat diterapkan dengan infrastruktur komputasi tepi.
ja: 法令遵守は、広い要件をカバーします。ジオフェンシングから、データ主権、著作権の施行までが含まれます。地理的、あるいは政治的な境界に基づいたデータへのアクセス制限、すなわち著作権の制限に従ってデータストリームを制限したり、特定の規制に従った場所にデータを格納したりすることは、全てエッジコンピューティングインフラを使えば達成可能かつ実施可能です。
ko_kr: 컴플라이언스는 geofencing, 데이터 주권, 저작권 시행에 이르기까지 광범위한 요구사항을 충족합니다. 지리 및 정치적 경계를 기반으로 데이터에 대한 접근을 제한하고, 저작권 제한에 따라 데이터 스트림을 제안하며, 특정 규정이 있는 장소에 데이터를 저장하는 것은 모두 edge computing 인프라로 달성 가능하고 시행이 가능합니다.
pt_br: Compliance cobre uma ampla gama de requisitos, variando de geofencing, soberania de dados, e aplicação de direitos autorais. Restrição de acesso aos dados com base na geografia e nos limites políticos, limitação do fluxo de dados de acordo com as limitações de direitos autorais, e armazenando de dados em locais com regulações específicas são todos realizáveis e passíveis de imposição com uma infraestrutura de edge computing.
zh_cn: 合规涵盖了广泛的需求，包括地理围栏，数据主权及版权执法。基于地理及政治边界约束数据使用，基于版权限制进行数据限流，将数据存储于包含特定规章的区域，这些操作在边缘计算基础环境中都是可实现和可执行的。

source: Network Function Virtualization (NFV)
de: Netzwerkfunktionsvirtualisierung (NFV)
eo: Reto Funkcio Virtualigo (NFV)
ja: ネットーワーク仮想化 (NFV)
ko_kr: 네트워크 기능 가상화 (NFV)
pt_br: Virtualização de Funções de Rede (NFV)
zh_cn: 网络功能虚拟化

source: Network Function Virtualization (NFV) is at its heart the quintessential edge computing application because it provides infrastructure functionality. Telecom operators are looking to transform their service delivery models by running virtual network functions as part of, or layered on top of, an edge computing infrastructure. To maximize efficiency and minimize cost/complexity, running NFV on edge computing infrastructure makes sense.
de: Die Netzwerkfunktionsvirtualisierung (NFV) ist das Kernstück der Edge-Computing-Anwendung, da sie Infrastrukturfunktionen bereitstellt. Telekom-Betreiber versuchen, ihre Service-Delivery-Modelle zu transformieren, indem sie virtuelle Netzwerkfunktionen als Teil oder als Ergänzung zu einer Edge-Computing-Infrastruktur ausführen. Um die Effizienz zu maximieren und Kosten/Komplexität zu minimieren, ist es sinnvoll, NFV auf einer Edge-Computing-Infrastruktur zu betreiben.
eo: Reto Funkcio Virtualigo (NFV) estas ĉe ties koro la kvintesenca rando komputanta aplikon ĉar ĝi provizas infrastrukturan funkcion. Telekom operaciantoj estas rigardanta transformi iliajn servajn liverajn modelojn per operacii virtualaj reto funkcioj kiel parto de, aŭ tavolita supre de, rando komputanta infrastrukturon. Maksimumigi efikecon kaj minimumigi kostojn/kompleksecon, kuranta NFV sur rando komputanta infrastrukturajn faras senton.
id: Network Function Virtualization (NFV), intinya adalah aplikasi komputasi tepi klasik karena menyediakan fungsionalitas infrastruktur. Operator telekomunikasi mencari untuk mengubah model pengiriman layanan mereka dengan menjalankan fungsi jaringan virtual sebagai bagian dari, atau berlapis-lapis di atas, infrastruktur komputasi yang canggih. Untuk memaksimalkan efisiensi dan meminimalkan biaya/kompleksitas, menjalankan NFV pada infrastruktur komputasi yang rumit masuk akal.
ja: ネットーワーク仮想化 (NFV) は、本質なエッジコンピューティングアプリケーションの中心的なものです。なぜなら、エッジコンピューティングはインフラ機能を提供するからです。通信事業者は彼らのサービス提供モデルをエッジコンピューティングインフラの一部、あるいは最上位レイヤとして仮想ネットワーク機能を動作させることで変革しようとしています。効率の最大化や、コストや複雑さの解消のため、NFV をエッジコンピューティングインフラで稼働させることは意味を持ちます。
ko_kr: NFV (Network Functional Virtualization)는 인프라 기능을 제공하므로 전형적인 edge computing 애플리케이션의 핵심입니다. 통신 사업자는 edge computing 인프라의 일부로 가상 네트워크 기능을 실행하여 서비스 제공 모델을 변형하여 사용합니다. 효율성을 극대화하고 비용/복잡성을 최소화하기 위해 edge computing 인프라에서 NFV를 실행하는 것이 합리적입니다.
pt_br: Virtualização de Funções de Rede (NFV) é em sua essência o aplicativo de computação de borda por excelência porque fornece funcionalidade de infraestrutura. Operadoras de telecomunicações estão buscando transformar seus modelos de entrega de serviço através da execução de funções de rede virtual como parte de, ou em camadas em cima de, uma infraestrutura de computação de borda. Para maximizar a eficiência e minimizar custo/complexidade, a execução de NFV na infraestrutura de computação de borda faz sentido.
zh_cn: 网络功能虚拟化的核心是一个典型的边缘计算应用，因为边缘计算为其提供了基础功能。电信运营商正尝试将虚拟网络功能运行于边缘计算基础架构的一部分或上层架构，并以此来转换运营商的服务交付模式。在边缘计算基础环境中运行虚拟网络功能确实能够发挥出其最高的效能以及最低的支出/复杂度。

source: Real-time
de: Echtzeit
eo: Real-tempo
ja: リアルタイム
ko_kr: 실시간
pt_br: Tempo Real
zh_cn: 实时性

source: Real-time applications, such as AR/VR, connected cars, telemedicine, tactile internet Industry 4.0 and smart cities, are unable to tolerate more than a few milliseconds of latency and can be extremely sensitive to jitter, or latency variation. As an example, connected cars will require low latency and high bandwidth, and depend on computation and content caching near the user, making edge capacity a necessity. In many scenarios, particularly where closed-loop automation is used to maintain high availability, response times in tens of milliseconds are needed, and cannot be met without edge computing infrastructure.
de: Echtzeitanwendungen, wie AR/VR, vernetzte Autos, Telemedizin, taktiles Internet, Industrie 4.0 und Smart Cities, können nicht länger als einige Millisekunden Latenz tolerieren und können extrem empfindlich auf Jitter oder Latenzschwankungen reagieren. Zum Beispiel benötigen vernetzte Autos eine niedrige Latenz und eine hohe Bandbreite und sind abhängig von der Berechnung und dem Zwischenspeichern von Inhalten in der Nähe des Benutzers, was Edge-Kapazität zu einer Notwendigkeit macht. In vielen Szenarien, insbesondere wenn die Closed-Loop-Automatisierung zur Aufrechterhaltung einer hohen Verfügbarkeit verwendet wird, sind Antwortzeiten in einigen zehn Millisekunden erforderlich und können ohne Edge-Computing-Infrastruktur nicht erfüllt werden.
eo: Real-tempaj aplikoj, kiel AR/VR, konektitaj aŭtoj, telemedicino, palpebla interreto, Industrio 4.0 kaj lertaj urboj, estas nekapabla toleri pli ol kelkaj milisekundoj da atentotempo kaj povas esti ekstreme sentema al jitter aŭ atentotempo vario. Kiel ekzemplo, konektitaj aŭtoj postulos malaltan atentotempon kaj altan kapaciton kaj dependas sur komputado kaj kontenta kaŝmemori proksime al la uzanto, faranta randan kapaciton neceso. En multaj scenaroj, precipe kie ferma-maŝa aŭtomacio estas uzita por daŭrigi altan haveblecon, respondaj tempoj en dekoj da milisekundoj estas devita kaj ne povas esti renkontita sen rando komputanta infrastrukturo.
id: Aplikasi real-time, seperti AR/VR, mobil yang terhubung, telemedicine, internet industri sentuhan 4,0 dan kota cerdas, tidak dapat mentolerir lebih dari beberapa milidetik latency dan dapat sangat sensitif terhadap variasi jitter, atau latency. Sebagai contoh, mobil yang terhubung memerlukan latency rendah dan bandwidth tinggi, dan bergantung pada komputasi dan caching konten di dekat pengguna, menjadikan kapasitas tepi sebagai kebutuhan. Dalam banyak skenario, terutama di mana otomasi loop tertutup digunakan untuk menjaga ketersediaan tinggi, waktu respon dalam puluhan milidetik dibutuhkan, dan tidak dapat dipenuhi tanpa infrastruktur komputasi tepi.
ja: リアルタイムアプリケーション、すなわちAR/VR、コネクテッドカー、遠隔医療、ネットワーク経由の触覚通信を使ったインダストリ4.0、そしてスマートシティーは、数ミリ秒以上の許容できない遅延があると実現できません。そしてこれらは極めてジッターや遅延の変化に敏感です。例えばコネクテッドカーは、低遅延や広帯域を必要とし、ユーザーに近い場所での計算やコンテンツキャッシュに依存するでしょうが、これらの要件を達成するにはエッジ機能が不可欠になります。多くのシナリオ、とりわけ閉じられたループの自動化は、高可用性と数十ミリ秒単位のレスポンスが求められてきましたが、エッジコンピューティングインフラがなくては要件を満たせないものです。
ko_kr: AR/VR, 커넥티드카, 원격 의료, tactile internet 산업 4.0 및 스마트 도시와 같은 실시간 응용 프로갦은 수 밀리 초 이상의 대기 시간을 허용할 수 없으며 jitter나 레이턴시 변동에 매우 민감합니다. 예를 들어 커넥티드카는 레이턴시가 짧고 대역폭이 높아야하며 사용자 인근에서 계산과 콘덴츠 캐싱에 의존하므로 edge 용량이 필요합니다. 특히 폐 루프 시스템 자동화에서 고가용성을 유지하는데 사용되는 많은 시나리오에서 수십 밀리초 단위의 응답 시간이 필요하며 edge computing 인프라 없이 충족될 수 없습니다.
pt_br: Aplicações em tempo real, tal como RA/RV, carros conectados, telemedicina, Indústria de internet tátil 4.0 e cidades inteligentes, são incapazes de tolerar mais que uns poucos milissegundos de latência e podem ser extremamente sensíveis a variações. Com um exemplo, carros conectados requerem baixa latência e alta largura de banda, e dependem da computação e armazenamento de cache próximo ao usuário, fazendo da capacidade de borda uma necessidade. Em vários cenários, particularmente onde a automação de circuitos fechados é utilizada para manter alta disponibilidade, tempos de resposta em dezenas de milissegundos são necessários, e não podem ser atingidos sem uma infraestrutura de computação de borda.
zh_cn: 实时应用，例如增强现实/虚拟现实，互联汽车，远程医疗，感知网络工业4.0以及智慧城市，无法容忍超过数毫秒的时延并对于抖动或时延变化极其敏感。 举例来说，互联汽车要求低时延、高带宽，并依靠接近于用户的计算和内容缓存，这些条件使边缘核心成为了必备项。在很多场景下，尤其是使用封闭式自动化操作来维护高可用性的场景，响应时间必须保证在几十毫秒内，这种条件除了边缘计算基础设施之外是无法达成的。

source: Immersive
de: Immersiv
eo: Ampleksa
ja: 没入型アプリケーション
pt_br: Imersivo
zh_cn: 拟真

source: Edge computing expands bandwidth capabilities, unlocking the potential of new immersive applications. Some of these include AR/VR, 4K video, and 360° imaging for verticals like healthcare. Caching and optimizing content at the edge is already becoming a necessity since protocols like TCP don’t respond well to sudden changes in radio network traffic. Edge computing infrastructure, tied into real-time access to radio/network information can reduce stalls and delays in video by up to 20% during peak viewing hours, and can also vary the video feed bitrate based on radio conditions.
de: Edge Computing erweitert die Bandbreitenfähigkeiten und erschließt das Potenzial neuer immersiver Anwendungen. Einige davon umfassen AR/VR, 4K-Video und 360 ° -Bildgebung für Branchen wie das Gesundheitswesen. Das Cachen und Optimieren von Inhalten am Rand wird bereits zur Notwendigkeit, da Protokolle wie TCP nicht gut auf plötzliche Änderungen im Funknetzwerkverkehr reagieren. Edge-Computing-Infrastruktur, die in Echtzeitzugriff auf Radio- / Netzwerkinformationen eingebunden ist, kann Staus und Verzögerungen bei Videoaufnahmen in Spitzenzeiten um bis zu 20% reduzieren und die Bitrate des Video-Feeds basierend auf Funkbedingungen variieren.
eo: Randa komputiko vastigas kapacitaj kapabloj, liberiganta la potencialon de novaj ampleksaj aplikoj. Kelkaj de ĉi tiuj inkluzivas AR/VR, 4K video kaj 360° figurado por vertikaloj kiel kuracado. Kaŝmemori kaj optimumi enhavon ĉe la rando estas jam fariĝanta neceso ekde protokoloj kiel TCP ne respondas bone al subitaj ŝanĝoj en radia reto trafiko. Rando komputanta infrastrukturon, ligita en real-tempa aliro al radia/reta informo povas redukti interruptojn kaj prokrastojn en video de ĝis 20% dum pintaj spektado horoj kaj ankaŭ povas varii la video fluan bitrapidon bazita sur radiaj kondiĉoj.
id: Komputasi tepi memperluas kemampuan bandwidth, membuka potensi aplikasi immersive baru. Beberapa di antaranya adalah video AR/VR, 4K, dan pencitraan 360 ° untuk vertikal seperti perawatan kesehatan. Caching dan mengoptimalkan konten di tepi sudah menjadi kebutuhan karena protokol seperti TCP tidak merespons dengan baik perubahan mendadak dalam lalu lintas radio. Infrastruktur komputasi tepi, yang dikaitkan dengan akses real-time ke informasi radio/jaringan dapat mengurangi kios dan penundaan video hingga 20% selama jam menonton puncak, dan juga dapat memvariasikan bitrate umpan video berdasarkan kondisi radio.
ja: エッジコンピューティングは帯域を拡張し、新しい没入型アプリケーションの潜在的な能力を引き出します。このアプリケーションには、AR/VR、4K ビデオ、そして医療分野における垂直型360° 映像といったものが含まれます。エッジでコンテンツのキャッシングや最適化をすることは、TCP のようなプロトコルにとって不可欠です。これは無線ネットワークのトラフィック上で、突然起きる変化のために反応しなくなることがあるからです。エッジコンピューティングインフラは、リアルタイムアクセスと無線やネットワークの情報を結びつけ、繁忙時間帯における動画の欠損と遅延を 20% まで減少させることができます。そして、無線の状況にもとづいて動画のビットレートを変化させることも出来ます。
ko_kr: Edge computing은 대역폭 기능을 확장하여 새로운 immersive 애플리케이션의 잠재력을 열어줍니다. 이중 일부는 AR/VR, 4K 비디오 및 건강 관리와 같은 업종의 360° 영상을 포함합니다. TCP와 같은 프로토콜이 무선 네트워크 트래픽의 급격한 변화에 잘 응답하지 않기 때문에 edge 에서 컨텐츠를 캐싱하고 최적화하는 것이 필수 사항이 되었습니다. 라디오/네트워크 정보에 대한 실시간 접근에 연결된 edge computing 인프라는 피크 시간대에 최대 20%까지 비디오 지연과 지연을 줄이고 무선 상태에따라 비디오 피드 비트율을 변경할 수 있습니다.
pt_br: Computação de borda expande a capacidade de largura de banda, desbloqueando o potencial das novas aplicações imersivas. Algumas delas incluem RA/RV, vídeo 4K, e imagens 360º para verticais como as empresas de cuidado com a saúde. Cache e otimização de conteúdo na borda já estão se tornando necessidades, uma vez que protocolos como o TCP não respondem bem às mudanças repentinas no tráfego de rede via rádio. A infraestrutura de computação de borda, aliada ao acesso em tempo real à informação de rádio/rede podem reduzir os atrasos em vídeo em até 20% durante o pico de horas de visualização, e pode também variar a taxa de alimentação de bits de vídeo com base nas condições de rádio.
zh_cn: 边缘计算扩展了带宽性能，激发了新兴拟真应用的潜能。其中包括增强现实/虚拟现实、4K 视频和应用于各领域例如医疗中360°图像技术。鉴于TCP等协议对于无线电网络通信的骤变无法良好响应，边缘缓存以及内容优化已经成为了必不可少的技术。若将边缘计算基础环境应用于无线电/网络信息的实时交互，则能在视频浏览高峰期将卡顿、延迟等情况减少20%，并可以根据无线电情况实时更变视频影像的比特率。

source: Network Efficiency
de: Netzwerkeffizienz
eo: Reta Efiko
id: Network Efficiency (Efisiensi Jaringan)
ja: ネットワークの効率性
ko_kr: 네트워크 효율성
pt_br: Eficiência da rede
zh_cn: 网络效率
