Repository: amotoki/edge-computing-whitepaper
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, eo, id, ja, ko_kr, pt_br, zh_cn

source: Many applications are not sensitive to latency and do not require large amounts of nearby compute or storage capacity, so they could theoretically run in a centralized cloud, but the bandwidth requirements and/or compute requirements may still make edge computing a more efficient approach. Some of these workloads are common today, including video surveillance and IoT gateways, while others, including facial recognition and vehicle number plate recognition, are emerging capabilities. With many of these, the edge computing infrastructure not only reduces bandwidth requirements, but can also provide a platform for functions that enable the value of the application—for example, video surveillance motion detection and threat recognition. In many of these applications, 90% of the data is routine and irrelevant, so sending it to a centralized cloud is prohibitively expensive and wasteful of often scarce network bandwidth. It makes more sense to sort the data at the edge for anomalies and changes, and only report on the actionable data.
de: Viele Anwendungen sind nicht anfällig für Latenzzeiten und benötigen keine großen Mengen an Rechen- oder Speicherkapazität in der Nähe. Daher könnten sie theoretisch in einer zentralisierten Cloud ausgeführt werden, aber die Bandbreitenanforderungen und / oder Rechenanforderungen können Edge Computing zu einem effizienteren Ansatz machen. Einige dieser Arbeitslasten sind heute üblich, einschließlich Videoüberwachung und IoT-Gateways, während andere, einschließlich der Gesichtserkennung und der Kennzeichenerkennung, neue Fähigkeiten entwickeln. Bei vielen von diesen reduziert die Edge-Computing-Infrastruktur nicht nur die Bandbreitenanforderungen, sondern kann auch eine Plattform für Funktionen bereitstellen, die den Wert der Anwendung ermöglichen, z. B. Videoüberwachung, Bewegungserkennung und Bedrohungserkennung. In vielen dieser Anwendungen sind 90% der Daten routinemäßig und irrelevant. Daher ist das Senden in eine zentrale Cloud unerschwinglich teuer und verschwendet häufig knappe Netzwerkbandbreite. Es ist sinnvoller, die Daten an der Kante nach Anomalien und Änderungen zu sortieren und nur über die umsetzbaren Daten zu berichten.
eo: Multaj aplikoj ne estas sentemaj al la respondotempo kaj ne postulas grandajn kvantojn de proksima kalkulado aŭ stokado, do ili povus teorie kuri en centra nubo, sed la larĝaj kapacitaj bezonoj kaj / aŭ komputilaj postuloj ankoraŭ povas randan komputadon pli efika. Iuj de ĉi tiuj laborŝarĝoj estas komunaj hodiaŭ, inkluzive de videoludado kaj IoT pordegoj, dum aliaj, inkluzive de rekono de vizaĝo kaj rekono de vehicla numerplato, estas emerĝaj kapabloj. Kun multaj el ĉi tiuj, la rando-komputila infrastrukturo ne nur reduktas la larĝajn kapacitajn bandojn, sed ankaŭ povas provizi platformon por funkcioj, kiuj ebligas la valoron de la apliko—ekzemple, video observado per movo ekkono kaj minaco-rekono. En multaj el ĉi tiuj aplikoj, 90% de la datumoj estas rutinaj kaj malgravaj, do sendante ĝin al centra nubo estas malpermese multekosta kaj disipiĝo de ofte malabunda reta kapacito. Estas pli sencoriĉa ordigi la datumojn ĉe la rando por anomalioj kaj ŝanĝoj, kaj nur raporti pri la agrablaj datumoj.
id: Banyak aplikasi tidak sensitif terhadap latensi dan tidak memerlukan sejumlah besar kapasitas komputasi atau penyimpanan terdekat, sehingga secara teoritis dapat berjalan dalam awan terpusat, namun persyaratan bandwidth dan/atau persyaratan komputasi mungkin masih membuat komputasi tepi menjadi pendekatan yang lebih efisien. Beberapa dari beban kerja ini umum terjadi saat ini, termasuk pengawasan video dan gerbang IoT, sementara yang lain, termasuk pengenalan wajah dan pengenalan plat nomor kendaraan, adalah kemampuan yang muncul. Dengan banyak di antaranya, infrastruktur komputasi tepi tidak hanya mengurangi kebutuhan bandwidth, namun juga dapat menyediakan platform untuk fungsi yang memungkinkan nilai aplikasi - misalnya, deteksi gerakan surveilans video dan pengenalan ancaman. Dalam banyak aplikasi ini, 90% data rutin dan tidak relevan, sehingga mengirimkannya ke awan terpusat sangat mahal dan boros dengan bandwidth jaringan yang sering langka. Lebih masuk akal untuk menyortir data di tepi anomali dan perubahan, dan hanya melaporkan data yang dapat ditindaklanjuti.
ja: 多くのアプリケーションは、遅延に敏感ではありませんし、大容量で近接したコンピュートやストレージ容量を必要としません。そのため理論的には集約型クラウド上で実行することが可能ですが、帯域とコンピュートあるいはそのうちどれか一つの要件は、依然としてエッジコンピューティングがより効率的なアプローチである余地を残しています。ビデオ監視や IoT ゲートウェイのような、いくつかのワークロードが今日普及していますが、一方で顔認識や自動車のナンバープレート認識のようなアプリケーションが新しく生まれています。これらのワークロードのために、エッジコンピューティングインフラは帯域要件の削減だけでなく、アプリケーションに付加価値をもたらすプラットフォームを提供します。例としてビデオ監視における動作検知や脅威認識が挙げられます。これらのアプリケーションの多く、90% のデータはルーチンであり無関係です。このため、このようなデータを集中型クラウドに送ることは大変に高価ですし、ネットワークの帯域不足を頻繁に起こす無用なものとなります。エッジ上で異常や変化を検出するためにデータを整理し、そして対応が必要なデータだけを報告することは、より意味を持つようになります。
ko_kr: 많은 애플리케이션은 레이턴시에 민감하지 않으며 많은 양의 주변 compute나 저장소 용량을 필요로 하지 않으므로 이론적으론 중앙 집중식 클라우드에서 실행될 수 있습니다. 그러나 대역폭 요구 사항이나 compute 요구 사항은 여전히 edge computing를 이용하여 보다 효율적인 방법으로 만들 수 있습니다. 비디오 감시 및 IoT 게이트웨이를 포함하여 이러한 작업 부하 중 일부는 오늘날 일반적으로 사용되는 반면 안면 인식 및 차량 번호판 인식을 비롯한 기타 기능은 새로운 기능입니다. 이러한 많은 기능을 갖춘 edge computing 인프라는 대역폭 요구 사항을 줄여 줄뿐만아니라 애플리케이션의 가치있게 해주는 기능 (예: 비디오 감시 동작 감지 및 위협 인식)을 위한 플랫폼으로 제공할 수 도 있습니다. 이러한 애플리케이션의 대부분 데이터의 90%는 일상적이고 관련성이 없으므로 중앙 집중식 클라우드로 전송하는 것은 비용이 많이 들고 많은 경우, 네트워크 대역폭이 부족하기 때문에 낭비입니다. 에외 및 변경 사항이 있는 edge에서 데이터를 정렬하고 실행 가능한 데이터에 대해서만 보고하는 것이 더 좋은 방법입니다.
pt_br: Muitas aplicações não são sensíveis à latência e não requerem grandes quantidades de computação ou capacidade de armazenamento nas proximidades, então elas poderiam teoricamente rodar em uma nuvem centralizada, mas os requisitos de largura de banda e/ou computação ainda podem fazer com que a computação de borda seja uma abordagem mais eficiente. Algumas dessas cargas de trabalho são comuns hoje, incluindo vigilâncias de vídeo e gateways de IoT, enquanto outras, incluindo reconhecimento facial e reconhecimento de placas de veículos, são capacidades emergentes. Com muitos desses, a infraestrutura de computação de borda não somente reduz requisitos de largura de banda, mas pode também fornecer uma plataforma para funções que habilitam o valor de uma aplicação—por exemplo, detecção de movimento por vigilância de vídeo e reconhecimento de ameaças. Em várias dessas aplicações, 90% dos dados é rotineiro e irrelevante, então enviar isso para uma nuvem centralizada é proibitivamente caro e um desperdício de largura de banda de rede, muitas vezes escassa. Faz mais sentido classificar os dados na borda, buscando por anomalias e alterações, e somente enviar os dados que interessam.
zh_cn: 许多应用对于延迟的不敏感，也不需要大量的就近计算或存储资源。所以理论上它们可以在集中式云端运行，但是对于带宽和/或计算的需要仍然使得边缘计算成为了一种更加高效的选择。当前部分应用已较为常见，其中包括视频监控和物联网网关，而另外一些则正在起步，包括面部识别和汽车登记号码牌识别。对于这些产业来说，边缘计算不仅仅为它们降低了带宽需求还为实现应用价值的功能提供了一个平台。视频监控动作感知和威胁识别就是一个很好的例子。在许多的这类应用中，90%的数据都是常规且不相关，因此将这些数据传输至集中式云端不仅价格高昂还浪费了往往本就匮乏的网络带宽。这使得这种在边缘侧分拣异常和有变化的数据，并只上报实用数据的处理方法显得更具意义。

source: Self-contained and autonomous site operations
de: Eigenständig und autonome Standortvorgänge
eo: Aŭtomataj kaj aŭtonomaj datumejaj operacioj
id: Operasi situs mandiri (self-contained) dan otonom
ja: 自給自足かつ自立したサイト運用
ko_kr: 독립적이고 자율적인 사이트 운영
pt_br: Operações de sites autônomos e independentes
zh_cn: 自成一体和自动化操作

source: Many environments, even today, have limited, unreliable or unpredictable connectivity. These could include transportation (planes, buses, ships), mining operations (oil rigs, pipelines, mines), power infrastructure (wind farms, solar power plants), and even environments that should typically have good connectivity, like stores. Edge computing neatly supports such environments by allowing sites to remain semi-autonomous and functional when needed or when the network connectivity is not available. The best example of this approach is the need for retail locations to maintain their point of sales (POS) systems, even when there is temporarily no network connectivity.
de: Viele Umgebungen haben auch heute noch eine begrenzte, unzuverlässige oder unvorhersehbare Konnektivität. Diese können Transport (Flugzeuge, Busse, Schiffe), Bergbau (Ölbohrinseln, Pipelines, Minen), Energieinfrastruktur (Windparks, Solarkraftwerke) und sogar Umgebungen umfassen, die typischerweise gute Konnektivität haben sollten, wie Geschäfte. Edge Computing unterstützt solche Umgebungen auf elegante Weise, indem Sites bei Bedarf teilautonom und funktionsfähig bleiben oder wenn die Netzwerkkonnektivität nicht verfügbar ist. Das beste Beispiel für diesen Ansatz ist die Notwendigkeit, dass Einzelhandelsstandorte ihre Point of Sales (POS) -Systeme beibehalten, auch wenn vorübergehend keine Netzwerkverbindung besteht.
eo: Multaj medioj, eĉ hodiaŭ, havas limigitan nekredeblan aŭ neantaŭvideblan konekteblecon. Ĉi tiuj povus inkluzivi transportadon (aviadilojn, busojn, ŝipojn), minindustriajn operaciojn (oleo-platformojn, tuberojn, minojn), elektropotencan infrastrukturon (ventojn, sunajn potencojn), kaj eĉ mediojn, kiuj kutime havus bonan konektecon, kiel vendejoj. Edge-komputado nete subtenas tiajn mediojn per permesado de ejoj resti duon-aŭtonomaj kaj funkciaj kiam necesas aŭ kiam la reto-konektebleco ne estas disponebla. La plej bona ekzemplo de ĉi tiu aliro estas la neceso de komercaj lokoj por subteni siajn ssistemojn de punkto de vendado (POS), eĉ kiam dumptempe ne ekzistas reta konektebleco.
id: Banyak lingkungan, bahkan saat ini, memiliki konektivitas yang terbatas, tidak dapat diandalkan atau tidak dapat diprediksi. Ini bisa termasuk transportasi (pesawat terbang, bus, kapal), operasi penambangan (rig minyak, jaringan pipa, tambang), infrastruktur listrik (peternakan angin, pembangkit tenaga surya), dan bahkan lingkungan yang biasanya memiliki konektivitas yang baik, seperti toko. Komputasi tepi mendukung lingkungan seperti itu dengan membiarkan situs tetap semi otonom dan fungsional bila diperlukan atau bila konektivitas jaringan tidak tersedia. Contoh terbaik dari pendekatan ini adalah perlunya lokasi ritel mempertahankan sistem sales point (POS) mereka, bahkan saat sementara tidak ada konektivitas jaringan.
ja: 今日においても、多くの環境は、制限付きで、信頼性に乏しいか予測不可能なネットワーク接続を持っています。これらの中には輸送業 (飛行機、バス、船舶) や鉱山業 (石油掘削装置、パイプライン、鉱業) 、電力インフラ (風力発電所、太陽光発電所)、そして典型的には良いネットワーク接続を持つべき店舗のような環境も含まれます。エッジコンピューティングは、半自律性と機能性を維持することで、必要とされた時やネットワークが使えなくなった時も、このような環境をきちんとサポートします。このアプローチの一番良い例は、一時的なネットワーク不良が起きるケースも想定した、小売店の POS システムを保守するためのニーズでしょう。
ko_kr: 오늘날까지도 많은 환경에서 제한적이고 신뢰할 수 없으며 예측할 수 없는 연결이 있습니다. 여기에는 운송 (비행기, 버스, 선박), 채광 작업 (석유 굴착 장치, 파이프 라인, 광산), 전력 인프라 (풍력 발전소, 태양광 발전소), 일반적으로 매장과 같이 연결성이 좋은 환경까지 포함될 수 있습니다. Edge computing은 필요할때나 네트워크 연결을 사용할 수 없는 경우 사이트가 반자동으로 작동하거나 기능을 유지하도록하여 이러한 환경을 깔끔하게 지원합니다. 이 접근법의 가장 좋은 예는 네트워크에 연결되지 않은 경우에도 판매점 (POS) 시스템을 유지 관리해야하는 소매점에서 필요할 수 있습니다.
pt_br: Muitos ambientes, ainda hoje, possuem conexão limitada, não confiável ou imprevisíveis. Esses poderiam incluir transporte (avião, ônibus, navios), operações de mineração (plataformas de petróleo, tubulações, minas), infraestrutura de energia (fazendas de vento, usinas de energia solar), e até ambientes que deveriam tipicamente possuir boa conectividade, como lojas. A computação de borda suporta perfeitamente cada um desses ambientes permitindo que os sites permaneçam semi autônomos e funcionais quando precisam ou quando a conexão de internet não está estável. O melhor exemplo para essa abordagem é a necessidade dos locais de varejo de manter seus sistemas de pontos de vendas (PDV), mesmo quando há uma falta temporária de conexão com a internet .
zh_cn: 直至今日，仍有许多场所的互联网连接受限，不可靠或不稳定。这些场所包括交通工具（飞机，汽车，轮船），采矿作业区（石油钻塔，输油管道，矿井），电力基础设施（风电场，太阳能电站）, 或是一些一般应具有良好网络连接的场所，例如仓库。边缘计算能够灵活的帮助这些场所，在当它们需要或网络连接不可用时保证半自动化操作并运作如常。即使在暂时无网络连接的情况下，仍为零售区域维护他们的POS系统就是这一实现的最佳案例。

source: Privacy
de: Privatsphäre
eo: Privateco
id: Pribadi
ja: プライバシー
ko_kr: 프라이버시
pt_br: Privacidade
zh_cn: 机密性

source: Enterprises may have needs for edge computing capacity depending on workloads, connectivity limits and privacy. For example, medical applications that need to anonymize personal health information (PHI) before sending it to the cloud could do this utilizing edge computing infrastructure.
de: Je nach Workloads, Konnektivitätslimits und Datenschutz benötigen Unternehmen möglicherweise Edge-Computing-Kapazitäten. Zum Beispiel könnten medizinische Anwendungen, die persönliche Gesundheitsinformationen (PHI) anonymisieren müssen, bevor sie in die Cloud gesendet werden, dies unter Verwendung von Edge-Computing-Infrastruktur tun.
eo: Entreprenoj povas havi bezonojn por randa komputika kapablo dependa de laborŝarĝo, konektecaj limitoj kaj privateco. Ekzemple, kuracaj aplikoj, kiuj bezonas anonimigi personajn sanajn informojn (PHI) antaŭ ol sendi ĝin al la nubo, povus fari ĉi tion uzante randkomputikan infrastrukturon.
id: Perusahaan mungkin memiliki kebutuhan untuk kapasitas komputasi tepi tergantung pada beban kerja, batasan konektivitas dan privasi. Misalnya, aplikasi medis yang perlu menganonimkan informasi kesehatan pribadi personal health information (PHI) sebelum mengirimnya ke awan bisa melakukan ini dengan memanfaatkan infrastruktur komputasi yang canggih.
ja: 企業はワークロードや接続性の制限のほか、プライバシーについてもエッジコンピューティング機能のニーズを持つかもしれません。例として、個人的な医療情報の匿名化を行う必要のある医療アプリケーションが挙げられます。これらの情報をクラウドに送信する前に、このアプリケーションはエッジコンピューティングインフラを使い、この作業を行います。
ko_kr: 기업은 워크로드, 연결제한, 개인정보에 따라 edge computing 용량이 많이 필요할 수 있습니다. 예를 들어 클라우드로 보내기전에 개인 건강 정보 (PHI)를 익명화해야하는 의료 애플리케이션은 edge computing 인프라를 활용하여 수행할 수 있습니다.
pt_br: As empresas podem ter necessidades de capacidade de computação de borda dependendo das cargas de trabalho, limites de conectividade e privacidade. Por exemplo, aplicações médicas que precisam tornar anônimas as informações de saúde pessoal (ISP) antes de enviar para a nuvem deveriam fazer isso utilizando uma infraestrutura de computação de borda.
zh_cn: 企业可能会因工作，网络连接局限性和机密性的需要选择边缘计算。举例来说，医疗应用程序在将个人健康信息传输至云端前必须将其匿名化，而这就需要应用到边缘计算。

source: Another way to look at requirements that would benefit from cloud edge computing is by the type of company that would deploy them. Operator applications are workloads put on edge computing infrastructure that is built and managed by operators—telecommunications companies, for example. Third-party applications are built by organizations to run on existing edge infrastructure, in order to leverage others’ edge computing infrastructure. It is worth noting that any applications could leverage any or all of the capabilities provided by a cloud—compute, block storage, object storage, virtual networking, bare metal, or containers.
de: Eine andere Möglichkeit, Anforderungen zu betrachten, die von Cloud Edge Computing profitieren würden, ist die Art des Unternehmens, das sie bereitstellen würde. Betreiberanwendungen sind Workloads, die auf eine Edge-Computing-Infrastruktur gesetzt werden, die beispielsweise von Betreibern - Telekommunikationsunternehmen - aufgebaut und verwaltet wird. Anwendungen von Drittanbietern werden von Organisationen erstellt, die auf bestehender Edge-Infrastruktur laufen, um die Edge-Computing-Infrastruktur anderer zu nutzen. Es ist erwähnenswert, dass alle Anwendungen die Funktionen eines Cloud-Computing, Blockspeichers, Objektspeichers, virtuellen Netzwerks, Bare-Metals oder Containers nutzen können.
eo: Alia maniero por rigardi postulojn, kiuj profitigus el nubranda komputado, estas laŭ la tipo de kompanio, kiu disponigos ilin. Operaciaj aplikoj estas laborŝarĝoj metitaj en la randkomputika infrastrukturo kiu estas konstruita kaj administrita de kompanioj de operaculoj-- telekomunikadaj entreprenoj, ekzemple. Tria-partiaj aplikoj estas konstruitaj de organizoj por kuri sur ekzistanta randa infrastrukturo, por plibonigi randajn komputilajn infrastrukturojn de aliaj. Ĝi valoras rimarki, ke ajnaj aplikoj povus plibonigi iujn aŭ ĉiujn kapablojn provizitajn per nubo-komputilo, blok stokado, objekto-stokado, virtualaj retoj, aparataro, aŭ konteneroj.
id: Cara lain untuk melihat persyaratan yang akan mendapat keuntungan dari cloud edge computing adalah dengan jenis perusahaan yang akan menyebarkannya. Aplikasi operator adalah beban kerja yang diletakkan pada infrastruktur komputasi yang dibangun dan dikelola oleh operator-perusahaan telekomunikasi, misalnya. Aplikasi pihak ketiga dibangun oleh organisasi untuk berjalan di infrastruktur tepi yang ada, untuk memanfaatkan infrastruktur komputasi terdepan lainnya. Perlu dicatat bahwa aplikasi apapun dapat memanfaatkan salah satu atau semua kemampuan yang disediakan oleh cloud-compute, block storage, object storage, virtual networking, bare metal, atau containers.
ja: クラウドエッジコンピューティングから恩恵を受けられるような要件を確認するための他の方法は、エッジコンピューティングをデプロイを行う会社のタイプで区別するというものです。事業者ー例えば通信事業者のアプリケーションは、エッジコンピューティングインフラ上で実行されるワークロードですが、事業者によって構築され、運用されます。サードパーティのアプリケーションは、他社のエッジコンピューティングインフラを活用するために、既存のエッジインフラ上で動作します。コンピュート、ブロックストレージ、オブジェクトストレージ、仮想ネットワーキング、ベアメタル、コンテナーといったクラウドによって提供される機能のすべてや一部を、どのアプリケーションでも活用できることに注意してください。
ko_kr: Cloud edge computing의 이점을 누릴수 있는 요구 사항을 확인하는 또 다른 방법은 이를 배포할 회사 타입입니다. 운영자 애플리케이션은 운영자가 작성하고 관리하는 edge computing 인프라에 적용되는 워크로드입니다 (예를 들어, 통신회사). 타사 애플리케이션은 다른 edge computing 인프라를 활용하기 위해 기존 edge 인프라에서 실행되도록 조직에의해 구축됩니다. 어떤 애플리케이션이라도 클라우드에서 제공하는 기능(compute, 블록 저장소, 오브젝트 저장소, 가상 네트워킹, 베어메탈, 컨테이너)의 일부 또는 전부를 활용할 수 있다는 점은 주목할 가치가 있습니다.
pt_br: Outra forma de examinar os requisitos que se beneficiariam com a computação de borda é pelo tipo de empresa que os implantariam. Aplicações de operador são cargas de trabalho inseridas na infraestrutura de computação de borda que são construídas e gerenciadas por operadores—companhias de telecomunicações, por exemplo. Aplicações de terceiros são construídas por organizações para rodar em uma infraestrutura de borda existente, afim de alavancar a infraestrutura de computação de borda de outros. Vale ressaltar que quaisquer aplicações deveriam alavancar quaisquer ou todas as capacidades providas por uma nuvem—computação, armazenamento de bloco, armazenamento de objeto, rede virtual, máquina física, ou contêineres.
zh_cn: 另外，我们也可以根据不同公司的部署类型来了解哪些需求会受益于边缘计算。操作员应用程序是由操作员来建立和管理安排至边缘计算处的工作，例如，电信运营商。第三方应用则是由其组织建立并运行在已有的边缘计算环境中，并以此来影响其它的边缘计算环境。值得一提的是，任何应用都能够影响部分或是所有云端所提供的特性，包括计算，块存储，对象存储，虚拟网络，裸机或容器。

source: SCENARIOS
de: SZENARIEN
eo: SCENAROJ
id: SKENARIO
ja: シナリオ
ko_kr: 시나리오
pt_br: CENÁRIOS
zh_cn: 场景

source: The basic characteristic of the edge computing paradigm is that the infrastructure is located closer to the end user, that the scale of site distribution is high and that the edge nodes are connected by WAN network connections. Examining a few scenarios in additional depth helps us evaluate current capabilities that map to the use case, as well as highlighting weaknesses and opportunities for improvement.
de: Das Grundmerkmal des Edge-Computing-Paradigmas ist, dass die Infrastruktur näher am Endbenutzer liegt, dass der Umfang der Standortverteilung hoch ist und dass die Edge-Knoten über WAN-Netzwerkverbindungen verbunden sind. Die Analyse einiger Szenarien in zusätzlicher Tiefe hilft uns dabei, die aktuellen Fähigkeiten, die sich auf den Anwendungsfall beziehen, zu bewerten und Schwachstellen und Verbesserungspotenziale aufzuzeigen.
eo: La baza trajto de la randa komputika paradigmo estas, ke la infrastrukturo situas pli proksima al la finuzanto, ke la skalo de ejoj distribitaj estas alta kaj ke la randaj nodoj estas konektitaj per WAN retoj. Ekzamenante kelkajn scenarojn en plua profundo helpas nin taksi aktualajn kapablojn, kiuj mapas al la uzkazon, kaj ankaŭ reliefigas malfortojn kaj ŝancojn por plibonigo.
id: Karakteristik dasar dari paradigma komputasi tepi adalah bahwa infrastruktur berada dekat dengan pengguna akhir, bahwa skala distribusi situs tinggi dan simpul tepi terhubung oleh koneksi jaringan WAN. Memeriksa beberapa skenario dalam kedalaman tambahan membantu kami mengevaluasi kemampuan saat ini yang memetakan ke kasus penggunaan, serta menyoroti kelemahan dan peluang untuk perbaikan.
ja: エッジコンピューティングのパラダイムにおける基本的な特徴は、インフラがエンドユーザーに近いところに位置しているということであり、サイト分散の規模が大きく、エッジノードは WAN 接続されているということです。いくつかのシナリオを更に深く調査することは、ユースケースに紐付けられる現在の機能を我々が検討するのに役立ちます。それはまた、弱点を強調したり、改善の機会を得るのにも役立ちます。
ko_kr: Edge computing 패러다임의 기본 특성은 인프라가 최종 사용자에 더 가깝고 사이트 배포 규모가 크며 edge 노드가 WAN 네트워크로 연결된다는 것입니다. 몇가지 시나리오를 자세히 검토하면 사용 사례에 연결되는 현재 기능을 평가할 수 있을 뿐만아니라 취약점과 개선 의 기회를 강조할 수 있습니다.
pt_br: A característica básica do paradigma da computação de borda é que a infraestrutura é localizada próxima ao usuário final, que a escala de distribuição do site é alta e que os nós de borda são conectados pelas conexões de rede WAN. Examinando alguns cenários em uma profundidade maior nos ajuda a avaliar as capacidades atuais que mapeiam para o caso de uso, bem como destaca as fraquezas e oportunidades para melhoramento.
zh_cn: 边缘计算模式的基础特性就是将基础设施更接近于底层用户，即站点分布范围广且边缘节点由WAN网络连接。场景中进一步的验证能够帮助我们评估已应用至案例中的现有功能，同时发现其劣势和可改进的方向。
