Repository: amotoki/edge-computing-whitepaper
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, eo, id, ja, ko_kr, pt_br, zh_cn

source: 5. Satellite enabled communication (SATCOM): This scenario is characterized by numerous capable terminal devices, often distributed to the most remote and harsh conditions. At the same time, it makes sense to utilize these distributed platforms for hosting services, especially considering the extremely high latency, limited bandwidth and the cost of over-the-satellite communications. Specific examples of such use cases might include vessels (from fishing boats to tanker ships), aircrafts, oil rigs, mining operations or military grade infrastructure.
de: 5. Satellite-fähige Kommunikation (SATCOM): Dieses Szenario zeichnet sich durch zahlreiche fähige Endgeräte aus, die oft an die entferntesten und rauen Bedingungen verteilt sind. Gleichzeitig ist es sinnvoll, diese verteilten Plattformen für Hosting-Dienste zu nutzen, insbesondere unter Berücksichtigung der extrem hohen Latenzzeiten, der begrenzten Bandbreite und der Kosten für die Kommunikation über Satellit. Konkrete Beispiele für solche Anwendungsfälle könnten Schiffe sein (von Fischerbooten zu Tankern), Flugzeuge, Bohrinseln, Bergbaubetriebe oder militärische Infrastruktur.
eo: 5. Satelito ebligita komunikado (SATCOM): Ĉi tiu scenaro estas karakterizita de multaj kapablaj terminalojn, ofte distribuitajn al la plej malproksimaj kaj severaj kondiĉoj. Samtempe, havas sencon uzi ĉi tiujn distribuitajn platformojn por gastigi servojn, precipe konsiderante la ekstreme altan atentotempon, limigita bandkapacito kaj la kosto de satelita komunikado. Specifaj ekzemploj de tiaj uzkazoj povus inkludi ŝipojn (de fiŝkaptistoj al petrolŝipoj), aviadiloj, oleo-platformoj, minindustriaj operacioj aŭ militagrada infrastrukturo.
id: 5. Satellite enabled communication (SATCOM): Skenario ini ditandai oleh banyak perangkat terminal yang mampu, sering didistribusikan ke kondisi yang paling jauh dan sulit. Pada saat yang sama, masuk akal untuk memanfaatkan platform terdistribusi ini untuk layanan hosting, terutama mengingat latency yang sangat tinggi, bandwidth yang terbatas dan biaya komunikasi over-the-satellite. Contoh spesifik dari kasus penggunaan semacam itu mungkin mencakup kapal-kapal (dari kapal penangkap ikan sampai kapal tanker), pesawat terbang, rig minyak, operasi penambangan atau infrastruktur kelas militer.
ja: 5. Satellite enabled communication (SATCOM): このシナリオは、しばしばもっとも遠く厳しい条件に配布された多数の終端装置によって性格づけられます。そして同時に、とりわけ非常に高い遅延や、限られた帯域、そして衛星通信のコストを考慮する場合、ホスティングサービスのための分散プラットフォームを最適化する際に意味をなします。具体的なユースケースの例としては、船舶 (漁船からタンカーまで) や航空機、石油掘削装置、鉱山の運営や軍用基準のインフラが挙げられます。
ko_kr: 5. Satellite enabled communication (SATCOM): 이 시나리오는 수많은 원격 터미널 장치를 특징으로 하며, 종종 가장 까다로운 조건으로 배포됩니다. 동시에 매우 높은 레이턴시, 제한된 대역폭, 위성 통신 비용을 고려할때 호스팅 서비스에 이러한 분산 플랫폼을 활용하는 것이 좋습니다. 이러한 사용 사례의 특징을 가진 사례로는 선박 (어선에서 유조선까지), 항공기, 석유 굴칙장치, 채굴 작업, 군사 등급 인프라가 포함될 수 있습니다.
pt_br: 5. Comunicação via Satélite (SATCOM): Esse cenário é caracterizado pelos numerosos dispositivos terminais capazes, frequentemente distribuídos para condições mais remotas e severas. Ao mesmo tempo, faz sentido utilizar essas plataformas distribuídas para serviços de hospedagem, especialmente considerando a latência extremamente alta, largura de banda limitada e custo de comunicação por satélite. Exemplos específicos de tais casos de uso devem incluir embarcações (de barcos de pesca a navios tanques), aviões de guerra, plataformas de petróleo, operações de mineração ou infraestrutura de grau militar.
zh_cn: 5. 卫星通信（SATCOM）：该场景以大量可用的终端设备分布于最偏远和恶劣的环境为特征。同时，将这些分散的平台用于提供托管服务也是极为合理的，尤其是当考虑到极高的延时，有限的带宽以及跨卫星通讯的费用。具体事例可能包括船舶（从渔船到油轮），飞机，石油钻井，采矿作业或军事基础设施。

source: CHALLENGES
de: HERAUSFORDERUNGEN
eo: PROVOKOJ
id: TANTANGAN
ja: チャレンジ
ko_kr: 도전
pt_br: DESAFIOS
zh_cn: 挑战

source: Though there are plenty of examples of edge deployments already in progress around the world, widespread adoption will require new ways of thinking to solve emerging and already existing challenges and limitations.
de: Obwohl es weltweit bereits zahlreiche Beispiele für den Einsatz von Edge-Systemen gibt, wird eine umfassende Einführung neue Denkweisen erfordern, um neue und bereits bestehende Herausforderungen und Einschränkungen zu lösen.
eo: Kvankam ekzistas multaj ekzemploj de randaj disponigoj jam progresantaj ĉirkaŭ la mondo, ampleksa adopto postulos novajn modojn de pensado por solvi emerĝajn kaj jam ekzistantajn defiojn kaj limojn.
id: Meskipun ada banyak contoh penyebaran tepi yang telah berlangsung di seluruh dunia, adopsi yang luas akan memerlukan cara berpikir baru untuk memecahkan tantangan dan keterbatasan yang muncul dan sudah ada.
ja: たくさんのエッジ適用例が世界中で進められている一方で、新興や既存を問わずチャレンジや制限を解決する広範な適用のために、新しい考え方が必要とされています。
ko_kr: 전 세계적으로 이미 진행중인 edge 배포에 대한 사례가 많이 있지만, 확산되고 널리 사용되고 있는 문제와 한계를 해결하기 위해서는 새로운 방식의 사고를 필요로합니다.
pt_br: Embora haja abundância de exemplos de implementações de borda já em progresso ao redor do mundo, a adoção generalizada requer novas formas de pensamento para resolver desafios e limitações emergentes e já existentes.
zh_cn: 虽然当前有非常多边缘计算的实例正在部署，但若要推广的话，还是需要解决新涌现出和早就存在的各种挑战与局限。

source: We have established that the edge computing platform has to be, by design, much more fault tolerant and robust than a traditional data center centric cloud, both in terms of the hardware as well as the platform services that support the application lifecycle. We cannot assume that such edge use cases will have the maintenance and support facilities that standard data center infrastructure does. Zero touch provisioning, automation, and autonomous orchestration in all infrastructure and platform stacks are crucial requirements in these scenarios.
de: Wir haben festgestellt, dass die Edge-Computing-Plattform von vornherein viel fehlertoleranter und robuster sein muss als eine herkömmliche cloudbasierte Cloud, sowohl in Bezug auf die Hardware als auch auf die Plattformdienste, die den Anwendungslebenszyklus unterstützen. Wir können nicht davon ausgehen, dass solche Edge Use Cases über die Wartungs- und Supportmöglichkeiten verfügen, die die Standard-Rechenzentrumsinfrastruktur bietet. Zero Touch Provisioning, Automatisierung und autonome Orchestrierung in allen Infrastruktur- und Plattformstacks sind in diesen Szenarien entscheidende Anforderungen.
eo: Ni establis ke la randkomputila platformo devas esti, per dezajno, multe pli panetolera kaj robusta ol tradicia datumocentra centra nubo, kaj en la terminoj de la aparataro same kiel de la platformaj servoj, kiuj subtenas la aplikaĵan vivociklo. Ni ne povas supozi, ke tiaj uzkazoj havos la funkcitenado kaj subtenajn instalaĵojn, kiujn la norma datumbaza infrastrukturo havas. Zero-tuŝo provizado, aŭtomatigo kaj aŭtonoma orkestado en ĉiuj infrastrukturoj kaj platformoj estas fundamentaj postuloj en ĉi tiuj scenaroj.
id: Kami telah menetapkan bahwa platform komputasi tepi harus dirancang secara lebih toleran dan lebih kuat daripada awan sentris data center tradisional, baik dari sisi perangkat keras maupun layanan platform yang mendukung siklus hidup aplikasi. Kita tidak dapat mengasumsikan bahwa kasus penggunaan tepi seperti itu akan memiliki fasilitas pemeliharaan dan dukungan yang infrastruktur data center standar tidak. Suplai zero touch, otomasi, dan orkestrasi otonom di semua tumpukan infrastruktur dan platform merupakan persyaratan penting dalam skenario ini.
ja: 私たちは、ハードウェアとアプリケーションライフサイクルをサポートするプラットフォームサービスの両面から、伝統的なデータセンター集中型クラウドと比較し、より障害許容性を持ち強固である設計をすることにより、エッジコンピューティングプラットフォームのあるべき姿を確立しました。このため私たちは、エッジのユースケースが、標準的なデータセンターインフラが行ってきたのと同様な保守サポートを持つことは当然でない様に思います。ゼロタッチプロビジョニングや自動化、全インフラとプラットフォームスタックの自律オーケストレーションは、これらのシナリオにおいて極めて重要なものです。
ko_kr: 우리는 edge computing 플랫폼이 기존 데이터 센터 중심의 클라우드보다 훨씬 내 결합성이 뛰어나고 견고하다는 것을 입증했습니다. 하드웨어와 애플리케이션 라이프 사이클을 지원하는 플랫폼 서비스 측명에서 더욱 엄격하게 적용되었습니다. 이러한 최첨단 사용 사례에 표준 데이터 센터 인프라에서 수행하는 유지관리와 지원 기능이 있다록 가정 할 수 없습니다. 이러한 시나리오에서는 모든 인프라와 플랫폼 스택의 제로 터치 프로비저닝, 자동화, 자율적인 조정이 매우 중요합니다.
pt_br: Nós estabelecemos que a plataforma de computação de borda tem que ser, por design, muito mais tolerante a falhas e robusta que uma nuvem tradicional de centro de dados centralizado, em ambos os termos de hardware assim bem como nos serviços de plataforma que suportam o ciclo de vida da aplicação. Nós não podemos assumir que tais casos de uso de borda terão a manutenção e apoio a instalação que infraestrutura de centro de dados padrões possuem. Provisionamento zero-toque, automação, e orquestração autônoma em toda infraestrutura e pilhas de plataforma são cruciais nesses cenários.
zh_cn: 我们已搭建起的边缘计算平台，比起传统的集中化数据中心云平台，从设计之初，不管是硬件的配置还是支持应用程序生命周期管理的系统服务，就加强了容错性和鲁棒性。我们还是不能假定这样的边缘计算实例能够满足标准数据中心基础设施在可维护性和支持设施上的要求。在这种场景下，所有的基础设施与平台系统栈需满足以下几项至关重要的需求：零干预系统预置，自动化，和自治的编排。

source: But there are other challenges that need to be taken under consideration.
de: Aber es gibt noch andere Herausforderungen, die in Betracht gezogen werden müssen.
eo: Sed ekzistas aliaj defioj kiujn oni devas konsideri.
id: Tapi ada tantangan lain yang perlu dipertimbangkan.
ja: しかし熟慮が必要なチャレンジが更にあります。
ko_kr: 그러나 고려해야 할 다른 문제가 있습니다.
pt_br: Mas existem outros desafios que precisam ser levados em consideração.
zh_cn: 但是还要考虑其他几个挑战。

source: For one, edge resource management systems should deliver a set of high-level mechanisms whose assembly results in a system capable of operating and using a geo-distributed IaaS infrastructure relying on WAN interconnects. In other words, the challenge is to revise (and extend when needed) IaaS core services in order to deal with aforementioned edge specifics—network disconnections/bandwidth, limited capacities in terms of compute and storage, unmanned deployments, and so forth.
de: Zum einen sollten Edge-Resource-Management-Systeme eine Reihe von High-Level-Mechanismen bereitstellen, deren Assemblierung zu einem System führt, das in der Lage ist, eine geo-verteilte IaaS-Infrastruktur basierend auf WAN-Interconnects zu betreiben und zu nutzen. Mit anderen Worten besteht die Herausforderung darin, die IaaS-Kerndienste zu überarbeiten (und bei Bedarf zu erweitern), um mit den oben genannten Randspezifikationen - Netzwerkunterbrechungen/Bandbreite, begrenzte Kapazitäten in Bezug auf Compute und Speicher, unbemannte Implementierungen usw. - fertig zu werden.
eo: Por unu, rando-rimedaj administrantaj sistemoj devus provizi aron de altnivelaj mekanismoj, kies asembleo rezultigas en sistemon kapabla funkcii kaj uzi geo-distribuitan IaaS-infrastrukturon dependanta de WAN-interkonektoj. Alivorte, la defio estas revizii (kaj plilongigi kiam bezonas) IaaS-koraj servoj por trakti antaŭmenciitajn rando specifojn -- reto-rekonektoj/bandkapacitoj, limigitaj kapabloj laŭ kompudado kaj stokado, senhomaj disponigoj, kaj tiel plu.
id: Untuk satu, sistem pengelolaan sumber daya tepi harus memberikan serangkaian mekanisme tingkat tinggi yang hasil rakitannya dalam sistem yang mampu beroperasi dan menggunakan infrastruktur IaaS yang didistribusikan secara geo dengan mengandalkan interkoneksi WAN. Dengan kata lain, tantangannya adalah merevisi (dan memperluas bila diperlukan) layanan inti IaaS untuk menangani hal-hal yang spesifik di atas - pemutusan jaringan / bandwidth, kapasitas terbatas dalam hal perhitungan dan penyimpanan, penyebaran tanpa awak, dan sebagainya.
ja: その一つとしてエッジのリソース管理システムは、ハイレベルなメカニズムセットを提供すべきであり、その結果 WAN により相互接続される地理的に分散された IaaS インフラの運用や利用を可能にするシステムになるでしょう。言い換えればこのチャレンジは、IaaS コアサービスを前述したエッジの特徴ーネットワーク切断や帯域、コンピュートとストレージの容量制約、無人デプロイメントなどなどを実現するために変化 (そして必要があれば拡張) させます。
ko_kr: 첫째, edge 리소스 관리 시스템은 어셈블리가 WAN 인터커넥트를 기반으로하는 지리적으로 분산된 IaaS 인프랄르 운영하고 사용할 수 있는 시스템을 제공하는 일련의 고급 메커니즘을 제공해야합니다. 바꾸어 말하면, 앞서 말한 특징을 다루기 위해서 IaaS 핵심 서비스를 수정 (필요할 경우 확장) 해아합니다. 네트워크 단절/대역폭, compute와 스토리지 관점에서의 제한된 용량, 무인 배포 등이 포함됩니다.
pt_br: Para um, sistemas de gerenciamento de recurso de borda devem entregar um conjunto de mecanismos de alto nível cuja montagem resulta em um sistema capaz de operar e usando uma infraestrutura IaaS geodistribuída confiando em interconexões WAN. Em outras palavras, o desafio é revisar (e estender quando necessário) serviços de núcleo IaaS a fim de lidar com especificações de borda acima especificadas—desconexões de rede/largura de banda, capacidades limitadas em termos de computação e armazenamento, implantações não tripuladas e assim por diante.
zh_cn: 其一，针对一个可运维并依靠WAN互联达成的跨地域IaaS设施系统，边缘计算资源管理系统应当提供一组高层机制可以组合输出。换言之，这里的挑战是如何修订（而且如需要时进行扩展）IaaS层的核心服务，以处理如上所述边缘计算的特定需求 - 如网络断联/带宽，计算和存储设备有限的功能，缺乏管理的部署，等等。

source: Some foreseeable needs include:
de: Einige vorhersehbare Bedürfnisse umfassen:
eo: Iuj antaŭvideblaj bezonoj inkluzivas:
id: Beberapa kebutuhan yang dapat diperkirakan meliputi:
ja: いくつかの予測可能なニーズは次のようなものです。
ko_kr: 예측 가능한 요구 사항은 다음과 같습니다:
pt_br: Algumas necessidades previsíveis incluem:
zh_cn: 可预期的需求包括：

source: * A virtual-machine/container/bare-metal manager in charge of managing machine/container lifecycle (configuration, scheduling, deployment, suspend/resume, and shutdown).
de: * Ein Manager für virtuelle Maschinen/Container/Bare-Metal, der für die Verwaltung des Lebenszyklus von Maschinen/Containern zuständig ist (Konfiguration, Planung, Bereitstellung, Suspend/Resume und Shutdown).
eo: * Virtuala maŝino/kontenero/aparata mastrumilo komisiita pri administrado de maŝino/kontenero-vivciklo (agordo, programado, disponigo, prokrasti/rekomenci, kaj haltigo).
id: Manajer virtual-machine/container/bare-metal yang bertugas mengelola siklus hidup machine/container (konfigurasi, penjadwalan, penyebaran, penundaan / resume, dan shutdown).
ja: * マシン/コンテナの ライフサイクル (設定、スケジューリング、デプロイメント、停止/レジューム、シャットダウン) を担当する仮想マシン/コンテナ/ベアメタルマネージャー
ko_kr: * 머신/컨테이너 라이프 사이클 (구성, 스케줄링, 배포, 일시 중지/다시 시작, 종료)을 관리하는 가상 머신/컨테이너/베어메탈 관리자.
pt_br: * Um gerenciador em máquina virtual/contêiner/máquina física responsável por gerenciar o ciclo de vida da máquina/contêiner (configuração, agendamento, implantação, suspender/reassumir, e desligar).
zh_cn: * 一个统一管理虚拟机/容器/裸机生命周期的管理器（包括配置，调度，部署，休眠/唤醒，和关机）

source: * An image manager in charge of template files (a.k.a. virtual-machine/container images).
de: * Ein Abbild-Manager, der für Vorlagendateien zuständig ist (u.a. virtuelle Maschinen- /Container-Abbilder).
eo: * Mastrumilo de bildoj komisiita pri ŝablonaj dosieroj (ankau konata kiel virtualaj maŝinoj/konteneraj bildoj)
id: * Seorang manajer image yang bertanggung jawab atas file template (a.k.a. virtual-machine / container images).
ja: * テンプレートファイル (仮想マシンやコンテナイメージとも呼ばれる) を担当するイメージマネージャー
ko_kr: * 템플릿 파일을 담당하는 이미지 관리자 (가상머신/컨테이너 이미지).
pt_br: * Um gerenciador de imagem responsável por arquivos de modelos (conhecidos como imagens de máquina virtual/contêiner).
zh_cn: * 一个管理模版文件（即虚拟机和容器的镜像）的镜像管理器

source: * A network manager in charge of providing connectivity to the infrastructure: virtual networks and external access for users.
de: * Ein Netzwerkmanager, der für die Bereitstellung der Konnektivität zur Infrastruktur verantwortlich ist: virtuelle Netzwerke und externer Zugriff für Benutzer.
eo: * Mastrumilo de reto komisiita pri provizi konektecon al la infrastrukturo: virtualaj retoj kaj ekstera aliro por uzantoj.
id: * Seorang manajer jaringan yang bertugas menyediakan konektivitas ke infrastruktur: jaringan virtual dan akses eksternal untuk pengguna.
ja: * ユーザーに仮想ネットワークと外部アクセスとの接続のようにインフラ接続を担当するネットワークマネージャー
ko_kr: * 인프라에 연결성을 제공하는 네트워크 관리자: 가상 네트워크와 사용자를 위한 외부 접근.
pt_br: * Um gerenciador de rede responsável por fornecer conectividade para a infraestrutura: redes virtuais e acesso externo para usuários.
zh_cn: * 一个负责基础设施联通的网络管理器，包括虚拟网络和用户外部访问的管理

source: * A storage manager, providing storage services to edge applications.
de: * Ein Speichermanager, der Speicherdienste für Edge-Anwendungen bereitstellt.
eo: * Mastrumilo de stokado, provizanta stokadajn servojn al randaj aplikoj.
id: * Manajer penyimpanan, menyediakan layanan penyimpanan ke aplikasi tepi.
ja: * エッジアプリケーションにストレージサービスを提供するストレージマネージャー
ko_kr: * Edge 애플리케이션에 스토리지 서비스를 제공하는 스토리지 관리자.
pt_br: * Um gerenciador de armazenamento, fornecendo serviços de armazenamento para aplicações de borda.
zh_cn: * 一个存储管理器，可以给边缘应用提供存储服务

source: * Administrative tools, providing user interfaces to operate and use the dispersed infrastructure.
de: * Administrative Tools, die Benutzerschnittstellen für den Betrieb und die Nutzung der verteilten Infrastruktur bereitstellen.
eo: * Administraj iloj, proviziante uzanto interfacojn por funkcii kaj uzi la dissemitan infrastrukturon.
id: * Alat administrasi, menyediakan antarmuka pengguna untuk mengoperasikan dan menggunakan infrastruktur yang tersebar.
ja: * 分散インフラを運用し利用するためのユーザーインターフェイスを提供する管理ツール
ko_kr: * 분산된 인프라를 운영하고 사용하기 위한 사용자 인터페이스를 제공하는 도구.
pt_br: * Ferramentas administrativas, fornecendo interfaces de usuário para operar e usar a infraestrutura dispersa.
zh_cn: * 可以运维和使用这些分散资源的管理员工具

source: These needs are relatively obvious and could likely be met by leveraging and adapting existing projects. But other needs for edge computing are more challenging. These include, but are not limited to:
de: Diese Bedürfnisse sind relativ offensichtlich und könnten wahrscheinlich durch Nutzung und Anpassung bestehender Projekte erreicht werden. Andere Anforderungen an Edge Computing sind jedoch schwieriger. Diese umfassen, sind aber nicht beschränkt auf:
eo: Ĉi tiuj bezonoj estas relative evidentaj kaj verŝajne estus atingebla per plibonigo kaj adaptado de ekzistantaj projektoj. Sed aliaj bezonoj por randa komputiko estas pli malfacilaj. Ĉi tiuj inkluzivas, sed ne estas limigitaj al:
id: Kebutuhan ini relatif jelas dan kemungkinan bisa dipenuhi dengan memanfaatkan dan menyesuaikan proyek yang ada. Tapi kebutuhan komputasi tepi lainnya lebih menantang. Ini termasuk, namun tidak terbatas pada:
ja: これらのニーズは比較的明らかであり、既存のプロジェクトを活用し適応させることで満たされる可能性があります。しかしエッジコンピューティングの他のニーズは、よりチャレンジングです。これだけに限ったものではありませんが、次のようなものが含まれます。
ko_kr: 이러한 요구는 비교적 분명하게 기존 프로젝트를 활용하고 적응함으로써 충족될 수 있습니다. 그러나 edge computing에 대한 다른 요구 사항은 더욱 까다로울 수 있습니다. 여기서는 다음이 포함되지만, 이에 국한되지 않습니다:
pt_br: Essas necessidades são relativamente óbvias e podem provavelmente ser atendidas alavancando e adaptando projetos existentes. Mas outras necessidades da computação de borda são mais desafiadoras. Estas incluem, mas não estão limitadas a:
zh_cn: 上述这些需求明显相关，而且很可能利用和适配现有的项目就可以了。但其他一些边缘计算的需求就更加有难度，包括并不限于以下所列：

source: * Addressing storage latency over WAN connections.
de: * Adressierung der Speicherwartezeit über WAN-Verbindungen.
eo: * Pritrakti stokadan atendotempon super WAN-konektoj.
id: * Mengatasi latensi penyimpanan melalui koneksi WAN.
ja: * WAN 接続越しのストレージ遅延への対処
ko_kr: * WAN 연결을 통한 스토리지 레이턴시 처리.
pt_br: * Abordagem da latência de armazenamento em cima de conexões WAN.
zh_cn: * 解决WAN网络中存储延迟问题

source: * Reinforced security at the edge—monitoring the physical and application integrity of each site, with the ability to autonomously enable corrective actions when necessary.
de: * Verstärkte Sicherheit am Rand - überwacht die physische Integrität und Anwendungsintegrität jedes Standorts und bietet die Möglichkeit, bei Bedarf selbst Korrekturmaßnahmen zu ergreifen.
eo: * Plifortigita sekureco ĉe la rando-viglado de la fizika kaj aplikaĵa integreco de ĉiu ejo, kun la kapablo aŭtonome ebligi korektajn agojn kiam necese.
id: * Keamanan yang diperkuat di edge—monitoring integritas fisik dan aplikasi masing-masing lokasi, dengan kemampuan untuk secara mandiri mengaktifkan tindakan perbaikan bila diperlukan.
ja: * エッジでの強化セキュリティー — 各サイトにおける物理とアプリケーションの一体的な監視、そして必要なときに自律的に有効化される修正動作
ko_kr: * Edge에 강화된 보안. 필요한 경우 시정 조치를 자율적으로 수행할 수 있는 기능을 통해 각 사이트의 물리시스템과 애플리케이션 무결성을 모니터링합니다.
pt_br: * Segurança reforçada na borda—monitoração da integridade física e de aplicação de cada site, com a capacidade de ativar correções anônimas quando necessário.
zh_cn: * 加强边缘计算的安全 - 监控每个节点中硬件和应用的完整性，并能够必要时自主采取修正的操作

source: * Monitoring resource utilization across all nodes simultaneously.
de: * Überwachung der Ressourcennutzung über alle Knoten gleichzeitig.
eo: * Monitorado de rimedo-uzado trans ĉiuj nodoj samtempe.
id: * Pemantauan pemanfaatan sumber daya di semua node secara bersamaan.
ja: * 全ノードのリソース使用率の一斉監視
ko_kr: * 모든 노드에서 동시에 리소스 사용률을 모니터링 합니다.
pt_br: * Monitoração da utilização dos recursos de todos os nós simultaneamente.
zh_cn: * 同时检测所有节点中资源的使用情况

source: * Orchestration tools that manage and coordinate many edge sites and workloads, potentially leading toward a peering control plane or “self-organizing edge.”
de: * Orchestrierungs-Tools, die viele Edge-Sites und Workloads verwalten und koordinieren, was möglicherweise zu einer Peering-Kontrollebene oder "selbstorganisierenden Edge" führt.
eo: * Orkestraj iloj, kiuj administras kaj kunordigas multajn randajn lokojn kaj laborŝarĝojn, eble direktanta al monitoranta stirpanelo aŭ "mem-organiza rando".
id: * Alat orkestrasi yang mengelola dan mengkoordinasikan banyak situs tepi dan beban kerja, berpotensi menuju ke arah peering control plane atau “self-organizing edge.”
ja: * 多くのエッジサイトとワークロードの運営と調整を行い、潜在的にコントロールプレーンのピアリングや「自己組織化するエッジ」に導くオーケストレーションツール
ko_kr: * 다수의 edge 사이트와 워크로드를 관리하고 조정하는 조정 도구로, 잠재적으로 peering control plane 또는 "self-organizing edge"로 연결됩니다.
pt_br: * Ferramentas de orquestração que gerenciam e coordenam muitos sites e cargas de trabalho de borda, potencialmente conduzindo para um plano de controle emparelhado ou “self-organizing edge.”
zh_cn: * 能够管理和协调多边缘节点和负载的编排工具，有潜力发展为一个对等控制平面或"自组织边缘计算"

source: * Orchestration of a federation of edge platforms (or cloud-of-clouds) has to be explored and introduced to the IaaS core services.
de: * Die Orchestrierung einer Föderation von Edge-Plattformen (oder Cloud-of-Clouds) muss erforscht und in die IaaS-Kerndienste eingeführt werden.
eo: * Orkestrado de federacio de rando-platformoj (aŭ nubo-de-nuboj) devas esti esplorita kaj enmetita al la IaaS-koraj servoj.
id: * Orkestrasi federasi platform tepi (atau cloud-of-clouds) harus dieksplorasi dan diperkenalkan pada layanan inti IaaS.
ja: * エッジプラットフォームの連携 (またはクラウドの中のクラウド) のためのオーケストレーションを調査し、IaaS コアサービスに導入する必要があります。
ko_kr: * IaaS 코어 서비스에 연게된 edge 플랫폼 (또는 클라우드에대한 클라우드) 연합체에 대한 조율을 탐구하고 소개.
pt_br: * Orquestração de uma federação de plataformas de borda (ou nuvem de nuvens) tem que ser explorada e introduzida nos serviços centrais de IaaS.
zh_cn: * 必须探索多边缘计算平台（或多云之云）的联合编排技术，并引入到IaaS软件核心组件中

source: * Automated edge commission/decommission operations, including initial software deployment and upgrades of the resource management system’s components.
de: * Automatische Edge-Commission / De-Commissioning-Operationen, einschließlich der anfänglichen Software-Bereitstellung und Upgrades der Komponenten des Ressourcenverwaltungssystems.
eo: * Aŭtomataj randaj komisionaj/malkomisionaj operacioj, inkluzive de komenca disponigo de programoj kaj ĝisdatigoj de la rimedo mastruma sistemaj elementoj.
id: * Automated edge commission/decommission operations, termasuk penyebaran perangkat lunak awal dan peningkatan komponen sistem manajemen sumber daya.
ja: * 自律的なエッジへの組み込みと切り離し操作。これは初期のソフトウェアデプロイメントと資源管理がシステムコンポーネントをアップグレードするのも含みます。
ko_kr: * 초기 소프트웨어 배포와 자원 관리 시스템 구성 요소의 업그레이드를 포함하여 자동화된 edge 위임/해임 작업
pt_br: * Operações automatizadas de ativação/desativação, incluindo implantação inicial de software e atualizações dos componentes de sistema de gerenciamento de recursos.
zh_cn: * 自动进行边缘计算调试/停用操作，包括初始软件部署和资源管理系统组件的升级。
