Repository: amotoki/edge-computing-whitepaper
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, eo, id, ja, ko_kr, pt_br, zh_cn

source: Cloud Edge Computing: Beyond the Data Center
de: Cloud Edge Computing: Hinter dem Rechenzentrum
eo: Nubranda Komputado: Trans la datumejo
id: Cloud Edge Computing: Melampaui Pusat Data
ja: クラウドエッジコンピューティング: データセンターを越えて
ko_kr: Cloud Edge Computing: 데이터 센터를 넘어서
pt_br: Edge Computing: Além do Data Center
zh_cn: 边缘计算：跨越传统数据中心

source: INTRODUCTION
de: VORSTELLUNG
eo: ENKONDUKO
id: PENGANTAR
ja: はじめに
ko_kr: 소개
pt_br: INTRODUÇÃO
zh_cn: 介绍

source: For over a decade, centralized cloud computing has been considered a standard IT delivery platform. Though cloud computing is ubiquitous, emerging requirements and workloads are beginning to expose its limitations. With its strong data center centric view, where compute and storage resources are relatively plentiful and centralized, little or no thought was ever given to the optimization of the supporting hypervisor and management platform footprint. Few cloud developers seriously considered the requirements needed to support resource-constrained nodes reachable only over unreliable or bandwidth-limited network connections, or thought about the needs of applications that demand very high bandwidth, low latency, or widespread compute capacity across many sites.
de: Seit mehr als einem Jahrzehnt gilt zentralisiertes Cloud Computing als Standard-IT-Bereitstellungsplattform. Obwohl Cloud Computing allgegenwärtig ist, beginnen neue Anforderungen und Arbeitslasten ihre Grenzen aufzudecken. Mit seiner starken zentralsorientierten Sicht auf Rechenzentren, wo Rechen- und Speicherressourcen relativ zahlreich und zentralisiert sind, wurde der Optimierung des unterstützenden Hypervisor- und Managementplattform-Footprints nie oder nur wenig Beachtung geschenkt. Nur wenige Cloud-Entwickler haben die Anforderungen zur Unterstützung von ressourcenbeschränkten Knoten, die nur über unzuverlässige oder bandbreitenbeschränkte Netzwerkverbindungen erreichbar sind, ernsthaft in Betracht gezogen oder über die Anforderungen von Anwendungen nachgedacht, die an vielen Standorten eine sehr hohe Bandbreite, geringe Latenz oder eine weit verbreitete Rechenkapazität erfordern.
eo: Dum pli ol jardeko, centralizita nubkomputiko estis konsiderita norma IT livera platformo. Kvankam nuba komputiko estas ĉiea, aperanta postuloj kaj laborŝarĝoj estas komencanta malkovri ties limoj. Kun ties forta datumcentro centra vido, kie komputaj kaj memorilaj rimedoj estas relative ofta kaj centralizita, malgranda aŭ neniu penso estis iam ajn donita al la plibonigo de la subtenanta virtuala maŝinmonitoro kaj administrada platforma piedsigno. Nur kelkaj nubo programistoj grave konsideris la postulojn bezonita subteni rimedo-limigitajn nodojn atingebla nur super nefidinda aŭ kapacito-limhava retaj konektoj, aŭ pensis pri la bezonoj de aplikoj kiu postulas tre alta reta kapacito, malalte atendotempo aŭ vastan komputan kapaciton trans multaj ejoj.
id: Selama lebih dari satu dekade, komputasi awan terpusat telah dianggap sebagai platform pengiriman TI standar. Meskipun komputasi awan ada di mana-mana, persyaratan dan beban kerja yang muncul mulai memperlihatkan keterbatasannya. Dengan tampilan sentris data center yang kuat, di mana sumber daya komputasi dan penyimpanannya relatif banyak dan terpusat, sedikit atau tidak ada pemikiran yang diberikan untuk mengoptimalkan hypervisor pendukung dan management platform footprint. Beberapa pengembang awan secara serius mempertimbangkan persyaratan yang dibutuhkan untuk mendukung node yang dibatasi sumber daya (resource-constrained) yang dapat dijangkau hanya dengan koneksi jaringan yang tidak dapat diandalkan atau bandwidth-terbatas (bandwidth-limited), atau memikirkan kebutuhan aplikasi yang membutuhkan bandwidth yang sangat tinggi, latensi rendah, atau kapasitas komputasi yang meluas di banyak tempat.
ja: この 10 年間、集中型クラウドコンピューティングは標準的な IT サービスプラットフォームとなっています。クラウドコンピューティングは至る所にありますが、新たな要件や作業負荷に対しては限界が見えてきています。強力なデータセンターの中心的な見解では、コンピューティングとストレージのリソースが比較的豊富で集中化されている場合、サポートするハイパーバイザーと管理プラットフォームのフットプリントの最適化についてはほとんど考えられてきませんでした。信頼性の低いネットワーク接続や帯域幅が制限されたネットワーク接続でしかアクセスできない制約付きノードをサポートするために必要な要件を真剣に検討しているクラウド開発者は少なく、非常に高い帯域幅、低いレイテンシ、または多くのサイトにわたって広範囲の計算能力を必要とするアプリケーションのニーズを考えていました。
ko_kr: 지난 10여년 동안, 중앙 집중화된 클라우드 컴퓨팅은 표준 IT 제공 플랫폼으로 간주되어져 왔습니다. 비록 어디에서나 클라우드 컴퓨팅을 볼 수 있지만, 점점 커지는 요구사항과 워크로드가 그 한계를 드러내기 시작하였습니다. 컴퓨팅과 스토리지 자원이 상대적으로 풍부하고 중앙화된 강력한 데이터 센터를 바라보는 중앙 집중적인 관점과는 반대로, 하이퍼바이저와 관리 플랫폼을 차지하는 공간을 지원하기 위해 최적화를 가져다 주기 위한 고려 사항은 거의 없는 상황입니다. 안정적이지 않거나 대역폭이 제한된 네트워크 연결만 도달하는 자원이 제한된 노드, 또는 여러 사이트에 걸쳐 널리 퍼져있는 컴퓨팅 용량을 필요로 하는 응용 프로그램에 대한 수요에 관한 여러 아이디어를 지원하고자 필요로 하는 요구사항들을 고려하는 클라우드 개발자가 많지 않습니다.
pt_br: Por mais de uma década, a computação em nuvem centralizada foi considerada uma plataforma padrão de entrega de TI. Embora a computação em nuvem seja onipresente, necessidades emergentes e novas cargas de trabalho estão começando a expor suas limitações. Com sua visão fortemente centrada no data center, onde os recursos de computação e armazenamento são relativamente abundantes e centralizados, pouca ou nenhuma atenção jamais foi dada à otimização do hipervisor de suporte e à pegada da plataforma de gerenciamento. Poucos desenvolvedores de nuvem consideraram seriamente os requisitos necessários para suportar nós com recursos restritos, alcançáveis apenas em conexões de rede não confiáveis ou com largura de banda limitada, ou pensaram nas necessidades de aplicações que exigem largura de banda muito alta, baixa latência, ou capacidade computacional distribuída por vários sites.
zh_cn: 近十几年来，中心化的云计算模型已经成为了一种标准的IT服务平台。虽然云计算现在已是普遍应用，但是随着新兴的计算模式和需求，现有的云计算模型也开始暴露出它的不足。一直以来，大家都习惯于将资源集中存放于中心化的数据中心，每个数据中心里面的计算和存储资源也相对的集中和富足，因此，大家也没有考虑过是否需要针对虚拟机管理软件和平台硬件的具体情况进行优化。普遍上，云平台的开发者也没有针对在资源受限的情况下去满足应用需求，例如节点硬件资源有限、节点间的网络不可靠和带宽受限；他们也没有考虑过如何满足那些对高带宽、低延时或者多站点大规模分布式应用程序的需求。

source: New applications, services, and workloads increasingly demand a different kind of architecture, one that’s built to directly support a distributed infrastructure. New requirements for availability and cloud capability at remote sites are needed to support both today’s requirements (retail data analytics, network services) and tomorrow’s innovations (smart cities, AR/VR). The maturity, robustness, flexibility, and simplicity of cloud now needs to be extended across multiple sites and networks in order to cope with evolving demands.
de: Neue Anwendungen, Dienste und Workloads erfordern zunehmend eine andere Art von Architektur, die direkt eine verteilte Infrastruktur unterstützt. Neue Anforderungen an Verfügbarkeit und Cloud-Fähigkeit an entfernten Standorten sind erforderlich, um sowohl die heutigen Anforderungen (Datenanalyse im Einzelhandel, Netzwerkdienste) als auch die Innovationen von morgen (Smart Cities, AR / VR) zu unterstützen. Die Reife, Robustheit, Flexibilität und Einfachheit der Cloud muss jetzt auf mehrere Standorte und Netzwerke ausgedehnt werden, um den sich entwickelnden Anforderungen gerecht zu werden.
eo: Novaj aplikoj, servoj kaj laborŝarĝoj ĉiufoje pli postulas malsaman specon de arkitekturo, unu tio kiu estas konstruita por rekte subteni distribuitan infrastrukturon. Novaj postuloj por havebleco kaj nuba kapablo ĉe izolitaj ejoj estas bezonita por subteni ambaŭ hodiaŭajn postulojn (retbutika datumanalitiko, retaj servoj) kaj morgaŭ-a novaĵoj (lertaj urboj, AR/VR). La matureco, fidindeco, fleksebleco kaj simpleco de nubo nun devas esti etendita trans multoblaj ejoj kaj retoj por subteni evoluantajn postulojn.
id: Aplikasi, layanan, dan beban kerja yang baru semakin menuntut jenis arsitektur yang berbeda, yang dibangun untuk secara langsung mendukung infrastruktur terdistribusi. Persyaratan baru untuk ketersediaan dan kemampuan cloud di lokasi terpencil diperlukan untuk mendukung kedua persyaratan hari ini (analisis data ritel, layanan jaringan) dan inovasi masa depan (kota cerdas (smart city), AR/VR). Kematangan, ketahanan, fleksibilitas, dan kesederhanaan awan sekarang perlu diperluas ke beberapa situs dan jaringan untuk mengatasi tuntutan yang terus berkembang.
ja: 新しいアプリケーション、サービス、コンピューティングタスクは、分散インフラストラクチャーを直接サポートするために構築された新しいアーキテクチャーをますます要求します。リモートサイトにおける可用性とクラウド機能の新しい要件は、 今日の要件 (小売データ分析、ネットワークサービス) と明日のイノベーション (スマートシティ、AR/VR) の両方をサポートする必要があります。進化する要求に対応するためには、クラウドの成熟度や堅牢性、柔軟性、およびシンプルさを複数のサイトやネットワークに拡張する必要があります。
ko_kr: 새로운 응용 프로그램, 서비스, 작업 부하들은 분산 인프라를 직접 지원하기 위해 구축된 아키텍처가 아닌, 다른 유형의 아키텍처를 필요로 합니다. 원격 사이트에서 오늘날 요구 사항 (리테일 데이터 분석, 네트워크 서비스)과 미래의 혁신 (스마트시티, AR / VR)을 모두 지원하기 위해서는 가용성과 클라우드 기능에 대한 새로운 요구 사항을 필요로 합니다. 진화하는 요구에 대처하기 위해서는 클라우드에 대한 성숙도, 견고성, 유연성, 단순함이 여러 사이트와 네트워크로 확장되어야 합니다.
pt_br: Novas aplicações, serviços e cargas de trabalho demandam cada vez mais diferentes tipos de arquitetura, uma que é construída para suportar diretamente uma infraestrutura distribuída. Novos requerimentos para disponibilidade e capacidade de nuvem em sites remotos são necessários para suportar ambos os requisitos de hoje (análise de dados de varejo e serviços de rede) e inovações do amanhã (cidades inteligentes e RA - Realidade Aumentada/RV - Realidade Virtual). A maturidade, robustez, flexibilidade e simplicidade da nuvem agora precisam ser estendidas em vários sites e redes afim de lidar com demandas crescentes.
zh_cn: 新型应用、服务和计算任务的兴起需要一套全新的架构进行支撑，这种新的架构应该是能够直接支持分布式的基础设施。新的应用需求对远端站点在可用性和云平台能力上带来新的挑战，不但需要能够满足现有需求，如零售数据分析、网络服务；还需要很好地支持未来的创新，如智慧城市、增强现实和虚拟现实等。现有已经成熟、稳定、灵活和简易的云计算模型，必须能在多站点间和多网络的模式下继续扩展以应付不断演变的需求。

source: Recently companies have begun to apply the simplified administration and flexibility of cloud computing architectures to distributed infrastructures that span across multiple sites and networks. Organizations have an emerging need to take cloud capabilities across WAN networks and into increasingly smaller deployments out at the network edge. Though this approach is in its early days, it is becoming clear that many emerging use cases and scenarios would benefit from distributed architectures.
de: In letzter Zeit haben Unternehmen begonnen, die vereinfachte Verwaltung und Flexibilität von Cloud-Computing-Architekturen auf verteilte Infrastrukturen anzuwenden, die sich über mehrere Standorte und Netzwerke erstrecken. Unternehmen haben zunehmend die Notwendigkeit, Cloud-Funktionen über WAN-Netzwerke und zunehmend kleinere Implementierungen am Netzwerkrand zu nutzen. Obwohl dieser Ansatz noch in seinen Anfängen ist, wird deutlich, dass viele neue Anwendungsfälle und Szenarien von verteilten Architekturen profitieren würden.
eo: Ĵus firmaoj komencis apliki la simpligitan administron kaj flekseblecon de nubkomputanta arkitekturoj al distribuita infrastrukturoj kiu etendas trans multoblaj ejoj kaj retoj. Organizoj havas aperanta bezonon preni nubajn kapablojn trans WAN-aj retoj kaj en ĉiufoje pli malgrandaj deplojoj ekstere ĉe la reta rando. Kvankam ĉi tiu alproksimiĝo estas ankorau je ties fruaj tagoj, ĝi estas fariĝanta klara ke multaj aperanta uzajn kazojn kaj scenarojn profitigus de distribuita arkitekturoj.
id: Baru-baru ini perusahaan mulai menerapkan administrasi dan fleksibilitas arsitektur cloud computing yang disederhanakan untuk mendistribusikan infrastruktur yang menjangkau beberapa situs dan jaringan. Organisasi memiliki kebutuhan yang muncul untuk memanfaatkan kemampuan awan di jaringan WAN dan penyebarannya semakin kecil ke tepi jaringan. Meskipun pendekatan ini pada awalnya, semakin jelas bahwa banyak kasus dan skenario penggunaan yang muncul akan menguntungkan dari arsitektur terdistribusi.
ja: 企業は最近、複数のサイトとネットワークにまたがった分散インフラに対して、シンプル化された管理とクラウドコンピューティングアーキテクチャーの柔軟性を適用してきました。組織は、 WAN ネットワーク全体にまたがってクラウド機能を活用し、ネットワークエッジにおける適用をますます小規模にしたいという新しいニーズを持っています。このアプローチは初期段階にありますが、多くの新しいユースケースとシナリオが分散アーキテクチャーから恩恵をうけるようになるのは明らかでしょう。
ko_kr: 최근 기업들은 클라우드 컴퓨팅 아키텍처를 단순화하여 관리하고 유연성있게 여러 사이트와 네트워크에 걸쳐있는 분산 인프라에 적용하기 시작했습니다. 여러 조직들은 WAN 네트워크에 걸쳐있고, 네트워크 edge 밖으로 점차 보다 작은 배포를 지원하는 클라우드 기능에 대한 필요성이 커지고 있습니다. 비록 이 접근 방식은 아직 초기 단계에 있지만, 많은 새로운 사용 사례와 시나리오들이 분산 아키텍처에서 이점을 누리게 될 것입니다.
pt_br: Recentemente empresas começaram a aplicar a administração simplificada e a flexibilidade das arquiteturas de computação em nuvem para infraestruturas distribuídas que abrangem vários sites e redes. As organizações tem uma necessidade emergente de ter recursos em nuvem entre redes WAN e de implementações cada vez menores na borda de rede. Ainda que essa abordagem seja recente, está ficando claro que muitos casos de uso e cenários emergentes se beneficiariam de arquiteturas distribuídas.
zh_cn: 近年来，不少公司已经开始将云计算的简易管理和灵活等特性应用于多站点、多网络的分布式架构。不少组织也开始希望云计算的能力能够跨越广域网，去覆盖那些不断增长的、在边缘网络、小集群的部署。尽管这种想法还是比较早期，但是它一定会随着那些受益于分布式架构的用户场景的出现而逐步变得清晰。

source: In this paper, we explore this emerging need. It has been called many names: distributed cloud, fog computing, 4th generation data centers, but for the purposes of this document, we will stick with a common, easily understood term—cloud edge computing.
de: In diesem Papier untersuchen wir dieses aufkommende Bedürfnis. Es wurde viele Namen genannt: verteilte Cloud, Fog-Computing, Rechenzentren der 4. Generation, aber für die Zwecke dieses Dokuments bleiben wir bei einem gemeinsamen, leicht verständlichen Begriff - Cloud Edge Computing.
eo: En ĉi tiu papero, ni esploras ĉi tiu aperantan bezonon. Ĝi estis vokita multajn nomojn: distribuita nubon, nebula komputiko, 4a generacia datumaj centroj, sed por la celoj de ĉi tiu dokumento, ni restas kun ofta, facile komprenita termina—nubranda komputiko.
id: Dalam tulisan ini, kita mengeksplorasi kebutuhan yang muncul ini. Telah disebut banyak nama: awan terdistribusi (distributed cloud), komputasi kabut (fog computing), pusat data generasi ke-4 (4th generation data centers), namun untuk tujuan dokumen ini, kita akan tetap menggunakan cloud edge computing (komputasi tepi awan) yang umum dan mudah dipahami.
ja: このペーパーでは、私たちはこの新しいニーズを調査します。このニーズは分散クラウドや fog computing,、第 4 世代データセンターといった多くの名前を持ちますが、このドキュメントの目的にかなうため、私たちは共通で簡単に理解できる用語であるクラウドエッジコンピューティングという言葉を使います。
ko_kr: 이 백서에서는 이와 같이 점차 증가하는 요구에 대해 살펴봅니다. 분산 클라우드, 포그 컴퓨팅, 4차 산업혁명 데이터센터와 같이 여러 이름으로 통칭되어져 왔지만, 이 문서 목적에서는 보편적이고 쉽게 이해 가능한 용어인 cloud edge computing을 계속 사용하고자 합니다.
pt_br: Nesse documento, exploramos essa necessidade emergente. Isso vem sendo chamado por alguns nomes: nuvem distribuída, computação em nuvem, 4ª geração de data centers, mas para os propósitos desse documento, vamos ficar com um termo facilmente entendido - cloud edge computing.
zh_cn: 本篇白皮书，我们将会深入探索这种新理念。这种新技术也被惯称为分布式云、雾计算或者第四代数据中心等；但是在本篇白皮书中，我们将使用更为通用和易于理解的术语——边缘计算。

source: The Edge Computing Group sees this evolution of cloud computing as very exciting, though we recognize that OpenStack’s ability to support cloud edge computing is in its early days. Based on initial community interest expressed at the OpenStack Summit Boston, a two-day workshop was held in September 2017 that brought together over 200 users and developers to start the hard work of defining relevant use cases and considering the tools and architectures needed to support them. Proof of concepts have been done and the community has a few early deployments in place. The Edge Computing Group has now taken up the challenge to describe fundamental requirements of a fully functional edge computing cloud infrastructure.
de: Die Edge Computing Group sieht diese Entwicklung des Cloud-Computing als sehr aufregend, obwohl wir uns bewusst sind, dass OpenStack in der Lage ist, Cloud Edge Computing zu unterstützen. Basierend auf dem anfänglichen Interesse der Community am OpenStack Summit Boston fand im September 2017 ein zweitägiger Workshop statt, bei dem über 200 Benutzer und Entwickler die Arbeit zur Definition relevanter Anwendungsfälle und der Werkzeuge und Architekturen für ihre Unterstützung begannen . Ein Proof of Concept wurde durchgeführt und die Gemeinde hat einige frühe Implementierungen durchgeführt. Die Edge Computing Group hat sich nun der Herausforderung gestellt, grundlegende Anforderungen an eine voll funktionsfähige Edge-Computing-Cloud-Infrastruktur zu beschreiben.
eo: La Edge Computing Group vidas ĉi tiun evoluon de nuba komputiko kiel tre ekscita, kvankam ni rekonas ke kapableco de OpenStack subteni nubrandan komputikon estas je ties fruaj tagoj. Bazita sur komenca komunuma intereso esprimita ĉe la OpenStack Pintokunveno Boston, du-taga laborejo estis tenita en septembro 2017 kiu kunvenigis super 200 uzantoj kaj programistoj komenci la malfacilan laboron difini esencajn uzkazojn kaj konsideranta la ilojn kaj arkitekturojn bezonita subteni ilin. Pruvo de konceptoj estis farita kaj la komunumo havas kelkajn fruajn deplojojn realisita. La Edge Computing Group nun transprenis la defio priskribi fundamentajn postulojn de plene praktika nubranda komputanta infrastrukturon.
id: The Edge Computing Group melihat evolusi komputasi awan ini sangat menarik, walaupun kami menyadari bahwa kemampuan OpenStack untuk mendukung cloud edge computing adalah pada masa awalnya. Berdasarkan minat masyarakat awal yang diungkapkan di OpenStack Summit Boston, sebuah lokakarya dua hari diadakan pada bulan September 2017 yang mengumpulkan lebih dari 200 pengguna dan pengembang untuk memulai kerja keras untuk menentukan kasus penggunaan yang relevan dan mempertimbangkan alat dan arsitektur yang dibutuhkan untuk mendukung mereka. . Bukti konsep (proof of concept) telah dilakukan dan masyarakat memiliki beberapa penyebaran (deployment) awal di tempat. The Edge Computing Group kini telah mengambil tantangan untuk menggambarkan kebutuhan mendasar dari infrastruktur komputasi awan komputasi yang berfungsi penuh.
ja: Edge Computing Group はこのクラウドコンピューティングの変革を、大変刺激的だと見ていますが、一方で OpenStack の機能はクラウドエッジコンピューティングをサポートするには初期段階であるということも認識しています。OpenStack Summit Boston で確認された初期のコミュニティーの関心に基づいて、2017 年 9 月に 2 日間のワークショップが開催され、200 人以上のユーザーと開発者が関連するユースケースを定義し、それらをサポートするために必要なツールやアーキテクチャーを検討するというハードワークを開始しました。概念実証が実行され、コミュニティーは早期のデプロイメントをいくつか行いました。Edge Computing Group は、完全な機能を持ったエッジコンピューティングクラウドインフラについて、基礎要件を記述するという挑戦を現在行おうとしています。
ko_kr: Edge Computing Group은 이러한 클라우드 컴퓨팅에서의 진화를 매우 흥미롭게 보고 있습니다. 그러나, 클라우드 edge 컴퓨팅을 지원하는 OpenStack 능력이 아직은 초창기 수준임을 알고 있습니다. OpenStack Summit Boston에서 발표된 초기 커뮤니티 관심을 기반으로, 2017년 9월에 이틀간 워크샵이 개최되었고 200명이 넘는 사용자와 개발자가 관련 사용 사례를 정의하고, 이를 지원하는데 필요한 도구와 아키텍처를 고려하기 위한 노력을 시작했습니다. 개념 증명 (PoC)이 완료되었고, 커뮤니티에서는 몇 가지 초기 배포를 하였습니다. Edge Computing Group은 완벽히 동작하는 edge 컴퓨팅 클라우드 인프라에 대한 필수적인 요구 사항을 기술하고자 하는 과제를 해결하고 있습니다.
pt_br: O grupo de computação de borda enxerga essa evolução da computação na nuvem como muito animadora, embora reconheçamos que a capacidade do OpenStack para suportar a nuvem de computação de borda está recente. Baseado no interesse inicial expressado pela comunidade no OpenStack Summit em Boston, realizou-se uma oficina de dois dias em Setembro de 2017 que reuniu mais de 200 usuários e desenvolvedores para iniciar o trabalho duro de definição de casos de uso relevantes e a consideração de ferramentas e arquiteturas necessárias para suportá-los. Provas dos conceito foram realizadas e a comunidade teve algumas implantações no local. O Grupo de computação de borda agora assumiu o desafio para descrever os requisitos fundamentais de um sistema totalmente funcional da infraestrutura de nuvem de computação de borda.
zh_cn: 尽管我们意识到当前OpenStack对于边缘计算的支持还是属于早期阶段，但是边缘计算工作组还是非常关注云计算的演化趋势。基于社区在OpenStack波士顿峰会上的最早提议，我们在2017年9月举行了一个2天的研讨会，有超过200名用户和开发者参与这次研讨会中，并开始了初期的艰辛工作，如定义相关用户场景、讨论相关工具和架构等。我们已经完成了初步的概念性验证，同时社区也已经存在了一些早期的部署案例。边缘计算工作组现已开始考虑如何定义一个功能完整的边缘计算云基础设施，这是非常具有挑战性的。

source: In this document, we aim to accomplish several important tasks:
de: In diesem Dokument verfolgen wir mehrere wichtige Aufgaben:
eo: En ĉi tiu dokumento, ni celas plenumi plurajn gravajn taskojn:
id: Dalam dokumen ini, kami bertujuan untuk menyelesaikan beberapa tugas penting:
ja: このドキュメントでは、私たちはいくつかの重要なタスクを達成することを狙っています。
ko_kr: 이 문서에서는, 다음과 같은 몇 가지 중요한 작업을 수행하는 것을 목표로 합니다:
pt_br: Nesse documento, pretendemos realizar algumas tarefas importantes:
zh_cn: 本文，我们的目标是完成以下几项重要任务：

source: 1. Cultivate a conversation around cloud edge computing, including some basic definitions, stimulating interest and engagement from the open source community.
de: 1. Kultivieren einer Konversation rund um Cloud Edge Computing, einschließlich einiger grundlegender Definitionen, um das Interesse und Engagement der Open-Source-Community zu wecken.
eo: 1. Kultivi konversacion ĉirkaŭ nubranda komputiko, inkluzivanta kelkajn bazajn difinojn, stimulanta intereson kaj engaĝiĝon de la malferma fonto komunumo.
id: 1. Kembangkan percakapan seputar cloud edge computing, termasuk beberapa definisi dasar, merangsang minat dan keterlibatan dari komunitas open source.
ja: 1. いくつかの基本的な定義を含む、クラウドエッジコンピューティングの周りの会話を掘り起こし、オープンソースコミュニティーの関心と関わりを刺激します。
ko_kr: 1. 오픈 소스 커뮤니티의 관심과 참여를 장려하는 몇 가지 기본 정의를 포함하여 클라우드 edge 컴퓨팅과 관련된 대화를 형성합니다.
pt_br: 1. Cultivar a conversação sobre cloud edge computing, incluindo algumas definições básicas, estimulando o interesse e o engajamento da comunidade de código aberto.
zh_cn: 1. 围绕边缘计算展开一系列话题，包括基本概念的定义、激发开源社区的兴趣和参与。

source: 2. Guide both the broader open source and OpenStack communities in developing tools and standards needed for broad adoption.
de: 2. Unterstützen sowohl der Open Source- als auch der OpenStack-Communities bei der Entwicklung von Tools und Standards, die für eine breite Akzeptanz erforderlich sind.
eo: 2. Gvidi ambaŭ la pli larĝa malferma fonto kaj OpenStack komunumoj en evoluiganta ilojn kaj normojn bezonita por larĝa adopto.
id: 2. Pandu komunitas open source dan OpenStack yang lebih luas dalam mengembangkan alat dan standar yang dibutuhkan untuk adopsi yang luas.
ja: 2. 幅広い活用のため必要とされるツールと標準の開発について、より広いオープンソースとOpenStack 双方のコミュニティーを導きます。
ko_kr: 2. 광범위한 적용을 위해 필요한 개발 도구와 표준에 대한 보다 일반적인 오픈 소스, 그리고 OpenStack 커뮤니티를 안내합니다.
pt_br: 2. Guiar tanto a comunidade mais ampla de código aberto quanto a comunidade OpenStack no desenvolvimento de ferramentas e padrões necessários para ampla adoção.
zh_cn: 2. 引导OpenStack社区以及其他开源社区参与相关的工具开发和标准制定，为后续更广泛的应用提供支持。

source: 3. Explore how current tools, standards and architectures may need to change to accommodate this distributed cloud model.
de: 3. Erkunden, wie sich aktuelle Tools, Standards und Architekturen ändern müssen, um dieses verteilte Cloud-Modell unterzubringen.
eo: 3. Esplori kiom nunaj iloj, normoj kaj arkitekturoj devus ŝanĝi por akomodi tion ĉi distribuitan nuban modelon.
id: 3. Jelajahi bagaimana alat, standar dan arsitektur terkini mungkin perlu diubah untuk mengakomodasi model awan terdistribusi ini.
ja: 3. この分散型クラウドモデルに対応するために、現在のツールや標準、アーキテクチャーをどのように変更する必要があるかを調べます。
ko_kr: 3. 분산형 클라우드 모델을 적용하기 위해 현재 도구, 표준, 아키텍처를 어떻게 변경해야 하는지를 알아봅니다.
pt_br: 3. Explorar como as ferramentas atuais, padrões e arquiteturas podem precisar mudar para acomodar esse modelo de nuvem distribuída.
zh_cn: 3. 探索当前的工具、标准和架构，如何改进并应用于分布式的云模型。
