Repository: amotoki/edge-computing-whitepaper
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, eo, id, ja, ko_kr, pt_br, zh_cn

source: * Automated data and workload relocations—load balancing across geographically distributed hardware.
de: * Automatisierte Daten- und Workload-Relationen - Lastenausgleich über geografisch verteilte Hardware.
eo: * Aŭtomatigitaj datumo kaj laborŝarĝaj lokado -- ŝarĝodistribuado trans geografie distribuitaj aparatoj.
id: * Data otomatis dan relokasi beban kerja - load balancing di perangkat keras yang terdistribusi secara geografis.
ja: * データとワークロードの自動再配置—地理的に分散したハードウェア向けにロードバランスを行います
ko_kr: * 자동화된 데이터와 워크로드 재배치 - 지리적으로 분산된 하드웨어에서 로드 밸런싱.
pt_br: * Realocação automatizada de dados e cargas de trabalho—balanceamento de carga entre hardware geograficamente distribuído.
zh_cn: * 自动化数据和工作负载重定位 - 跨地域分布式硬件的负载平衡。

source: * Some form of synchronization of abstract state propagation should be needed at the "core" of the infrastructure to cope with discontinuous network links.
de: * Im "Kern" der Infrastruktur sollte eine gewisse Form der Synchronisation des Abstraktionszustands erforderlich sein, um diskontinuierliche Netzwerkverbindungen zu bewältigen.
eo: * Kelkaj formoj de sinkronigo de abstrakta ŝtata disvastigo devus esti bezonataj ĉe la "kerno" de la infrastrukturo por trakti intermitajn retajn ligojn.
id: * Beberapa bentuk sinkronisasi propagasi negara abstrak harus dibutuhkan di "core" infrastruktur untuk mengatasi hubungan jaringan yang tidak terputus-putus.
ja: * 抽象的な状態伝達の同期の幾つかの形は、断続的なネットワーク接続と共に連動する「コア」のインフラにおいて必要とされます。
ko_kr: * 불연속적인 네트워크 링크에 대처하기 위해 인프라의 "core"에서 추상화된 상태 전달의 동기화의 일부 폼이 필요합니다.
pt_br: * Alguma forma de sincronização de propagação do estado abstrato deve ser necessária no "núcleo" da infraestrutura para lidar com links de rede descontínuos.
zh_cn: * 基础设施的"核心"应该需要抽象状态传播的某种形式的同步，以应对不连续的网络链路。

source: * New ways to deal with network partitioning issues due to limited connectivity—coping with short disconnections and long disconnections alike.
de: * Neue Möglichkeiten zum Umgang mit Netzwerkpartitionierungsproblemen aufgrund eingeschränkter Konnektivität - Bewältigung von kurzen Verbindungsabbrüchen und langen Verbindungsabbrüchen gleichermaßen.
eo: * Novaj manieroj por trakti problemojn pri reta dispartigo pro limigita konektebleco--pritrakti etajn malkonektojn kaj longajn malkonektojn same.
id: * Cara baru untuk mengatasi masalah pembagian jaringan karena keterbatasan konektivitas - mengatasi pemutusan hubungan pendek dan pemutusan yang panjang.
ja: * 限定された接続性に起因するネットワークのパーティショニング課題を処理する新しい方法—長短どちらのネットワーク障害にも対応します。
ko_kr: * 제한된 연결성으로 인해 네트워크 파티셔닝 문제를 처리하는 새로운 방법. 짧은 연결 해제와 긴 연결 해제를 모두 지원.
pt_br: * Novas formas de lidar com problemas de particionamento de rede devido à limitação de conectividade—lidando com desconexões curtas e longas.
zh_cn: * 需要新方法以解决由于连接受限导致的处理网络分区问题 - 应对短暂断开和长时间断开连接。

source: * Tools to manage edge application life cycles, including:
de: * Werkzeuge zur Verwaltung der Edge-Anwendungszyklen, einschließlich:
eo: * Iloj por administri randaj aplikaĵaj vivo-cikloj, inkluzive de:
id: * Alat untuk mengelola siklus hidup aplikasi tepi, termasuk:
ja: * エッジアプリケーションのライフサイクルを管理するツール、次のようなものを含みます。
ko_kr: * 다음을 포함한 edge 애플리케이션 라이프 사이클을 관리하는 도구:
pt_br: * Ferramentas para gerenciar ciclos de vida de aplicação de borda, incluindo:
zh_cn: * 边缘应用生命周期的管理工具，包括：

source: * The definition of advanced placement constraints in order to cope with latency requirements of application components.
de: * Die Definition von erweiterten Platzierungsbedingungen, um den Latenzanforderungen von Anwendungskomponenten gerecht zu werden.
eo: * La difino de progresintaj lokadaj limigoj por pritrakti respondotempaj bezonoj de aplikaĵaj elementoj.
id: * Definisi kendala penempatan lanjutan untuk mengatasi persyaratan latensi komponen aplikasi.
ja: * アプリケーションコンポーネントの遅延要件に対処するための先進的な配置制約の定義
ko_kr: * 애플리케이션 구성요소의 대기 시간 요구사항을 처리하기위한 고급 배치 제약 조건을 정의합니다.
pt_br: * A definição de restrições avançadas de atribuição para lidar com os requisitos de latência dos componentes do aplicativo.
zh_cn: * 高级安置定位约束的定义，以便处理应用程序组件的延迟需求

source: * The provisioning/scheduling of applications in order to satisfy placement requirements (initial placement).
de: * Die Bereitstellung/Planung von Anwendungen, um Platzierungsanforderungen zu erfüllen (Erstplatzierung).
eo: * La provizado/envicigo de aplikoj por kontentigi lokadajn postulojn (iniciala lokado).
id: * provisioning/scheduling aplikasi untuk memenuhi persyaratan penempatan (penempatan awal).
ja: * 配置要件 (初期配置) を満たすためのアプリケーションのプロビジョニングとスケジューリング
ko_kr: * 안정적인 배치 요구사항 (초기 배치)을 충족시키기위한 애플리케이션의 프로비저닝/스케줄링.
pt_br: * O provisionamento/agendamento de aplicativos para satisfazer os requisitos de atribuição (atribuição inicial).
zh_cn: * 应用程序预置和调度应当满足安置的需求（初始安置）

source: * Data and workload relocations according to internal/external events (mobility use-cases, failures, performance considerations, and so forth).
de: * Daten und Workload-Relokationen nach internen/externen Ereignissen (Mobilitäts-Anwendungsfälle, Fehler, Leistungsaspekte usw.).
eo: * Lokado de datumo kaj de laborŝarĝo laŭ internaj/eksteraj okazaĵoj (mobilaj uzado-kazoj, misfunkciadoj, rendimentaj konsideroj, ktp).
id: * Data dan relokasi beban kerja menurut kejadian internal/external (kasus penggunaan mobilitas, kegagalan, pertimbangan kinerja, dan lain-lain).
ja: * 内部/外部のイベントに従ったデータとワークロードの再配置 (移動性のユースケースや障害、性能その他の考慮)
ko_kr: * 내부/외부 이벤트(모빌리티 사용 사례, 실패, 성능 고려 사항 등)에 따라 데이터와 워크로드 재배치.
pt_br: * Realocações de dados e cargas de trabalho de acordo com eventos internos/externos (casos de uso de mobilidade, falhas, considerações de desempenho, etc.).
zh_cn: * 根据内部/外部事件（移动用例，故障，性能考虑等）迁移数据和工作负载

source: * Integration location awareness: Not all edge deployments will require the same application at the same moment. Location and demand awareness are a likely need.
de: * Integrationsstandort-Awareness: Nicht alle Edge-Implementierungen benötigen dieselbe Anwendung im selben Moment. Standort- und Nachfragebewusstsein sind wahrscheinlich.
eo: * Konscio pri la lokada integriĝo: Ne ĉiuj randaj disponigoj postulos la saman aplikaĵon samtempe. Lokada kaj postula konscio estas verŝajna bezono.
id: * Integrasi kesadaran lokasi: Tidak semua penerapan tepi akan memerlukan aplikasi yang sama pada saat bersamaan. Kesadaran lokasi dan permintaan merupakan kebutuhan yang mungkin.
ja: * 配置を意識したインテグレーション: 同じアプリケーションはすべてのエッジデプロイに同時に必要とはならないでしょう。配置と需要を意識することは必要とされるようです。
ko_kr: * 통합 위치 인식: 모든 edge 배포가 동일한 애플리케이션을 통시에 요구하지는 않습니다. 위치와 수요에 대한 인식이 필요합니다.
pt_br: * Consciência de localização de integração: nem todas as implantações de borda exigirão o mesmo aplicativo no mesmo momento. A localização e a conscientização da demanda são uma necessidade provável.
zh_cn: * 集成位置感知：并非所有的边缘计算部署都需要同一时间使用同一个程序。 可能需要支持位置和需求感知。

source: * Discrete hardware with limited resources and limited ability to expand at the remote site needs to be taken into consideration when designing both the overall architecture at the macro level and the administrative tools. The concept of being able to grab remote resources on demand from other sites, either neighbors over a mesh network or from core elements in a hierarchical network, means that fluctuations in local demand can be met without inefficiency in hardware deployments.
de: * Diskrete Hardware mit begrenzten Ressourcen und begrenzter Erweiterbarkeit am Remote-Standort muss berücksichtigt werden, wenn sowohl die Gesamtarchitektur auf Makroebene als auch die Verwaltungstools entworfen werden. Das Konzept, Remote-Ressourcen auf Abruf von anderen Standorten zu beziehen, entweder von Nachbarn über ein Mesh-Netzwerk oder von Kernelementen in einem hierarchischen Netzwerk, bedeutet, dass Fluktuationen in der lokalen Nachfrage ohne Ineffizienz bei Hardwarebereitstellungen erreicht werden können.
eo: * Diskreta aparataro kun limigitaj rimedoj kaj limigita kapablo por ekspansiiĝi en la defora ejo devas esti konsiderataj, kiam desegnanta kaj la ĝeneralan arkitekturon ĉe la macro-nivelo kaj la administraj iloj. La koncepto esti kapabla kapti remotajn rimedojn laŭ peto de aliaj ejoj, aŭ najbaroj super maŝa reto aŭ de kernaj elementoj en hierarkia reto, signifas, ke fluctuoj en loka postulo povas esti renkontitaj sen ineficieco en aparataj disponigoj.
id: * Perangkat keras diskrit dengan sumber daya terbatas dan kemampuan terbatas untuk memperluas lokasi terpencil perlu dipertimbangkan saat merancang keseluruhan arsitektur pada tingkat makro dan alat administratif. Konsep untuk dapat mengambil sumber daya jarak jauh berdasarkan permintaan dari situs lain, baik tetangga melalui jaringan mesh atau dari elemen inti dalam jaringan hierarkis, berarti bahwa fluktuasi permintaan lokal dapat dipenuhi tanpa inefisiensi penerapan perangkat keras.
ja: * 資源が制限され、遠隔サイトへの拡張のために機能が制限された分散ハードウェアは、マクロレベルの全体アーキテクチャー設計と運用ツールの設計の双方で熟慮が必要になります。メッシュネットワーク上の他のサイトや階層型ネットワークのコア要素からリモート資源を要求に応じて取得できるという概念は、ハードウェア導入の効率性を損なうことなく、ローカル需要の変動を満たすことができることを意味します。
ko_kr: * 매크로 수준에서 전체 아키텍처와 관리 도구를 설계할 때 제한된 리소스와 원격 사이트에서의 확장 능력이 제한된 개별 하드웨어를 고려해야합니다.Mesh 네트워크를 통해 이웃이거나 계층적 네트워크의 핵심요소에서 다른 사이트의 요청에 따라 원격 리소스를 확보할 수 있다는 개념은 하드웨어 배포의 비효율없이 로컬 요구의 변동을 충족시킬 수 있음을 의미합니다.
pt_br: * Hardware discreto com recursos limitados e a capacidade limitada de expansão no site remoto precisam ser levados em consideração ao projetar a arquitetura geral no nível macro e das ferramentas administrativas. O conceito de ser capaz de capturar recursos remotos sob demanda de outros sites, ou vizinhanças em uma rede de malha ou de elementos centrais em uma rede hierárquica, significa que as flutuações na demanda local podem ser atendidas sem ineficiência em implementações de hardware.
zh_cn: * 在设计宏观层面的整体架构和管理工具时，需要考虑资源有限、远程扩展能力有限的离散硬件。 能够根据需要从其他站点（无论是Mesh网络上的邻居还是分层网络中的核心元素）获取远程资源的概念，指的是本地需求的波动不会导致硬件部署的低效。

source: CONCLUSION AND CALL TO ACTION
de: SCHLUSSFOLGERUNG UND CALL TO ACTION
eo: KONKLUDO KAJ ALVOKO AL AGO
id: KESIMPULAN DAN PANGGILAN AKSI
ja: 結論と行動の呼びかけ
ko_kr: 결론과 행동 요청
pt_br: CONCLUSÃO E CONVITE À AÇÃO
zh_cn: 总结与行动计划

source: Edge computing is not and should not be limited to just the components and architectures of OpenStack, but there are some reasons that OpenStack is particularly attractive as a platform for cloud edge computing. The Edge Computing Group is asking the open source community to begin exploring these challenges and possibilities. We recognize that there is work to be done to achieve our goals of creating the tools to meet these new requirements. We welcome and encourage the entire open source community to join in the opportunity to define and develop cloud edge computing. You can find more information about the group activities on the OpenStack Edge Computing web page.
de: Edge Computing ist nicht und sollte nicht nur auf die Komponenten und Architekturen von OpenStack beschränkt sein, aber es gibt einige Gründe, warum OpenStack als Plattform für Cloud Edge Computing besonders attraktiv ist. Die Edge Computing Group bittet die Open-Source-Community, diese Herausforderungen und Möglichkeiten zu erkunden. Wir sind uns bewusst, dass es einiges zu tun gibt, um unsere Ziele zu erreichen, die Werkzeuge zu schaffen, um diese neuen Anforderungen zu erfüllen. Wir begrüßen und ermutigen die gesamte Open-Source-Community, an der Möglichkeit teilzunehmen, Cloud Edge Computing zu definieren und zu entwickeln. Weitere Informationen zu den Gruppenaktivitäten finden Sie auf der OpenStack Edge Computing-Webseite.
eo: Edge-komputado ne estas limigita nur al la komponantoj kaj arkitekturoj de OpenStack, sed ekzistas kelkaj kialoj por tio ke OpenStack estas aparte alloga kiel platformo por nubo-komputado. The Edge Computing Group petas la malferma fonta komunumo komenci esplori tiujn defiojn kaj eblecojn. Ni rekonas ke ankoraŭ estas laboro faronta por atingi niajn celojn krei la ilojn por veni al ĉi tiujn novajn postulojn. Ni bonvenigas kaj kuraĝigas la tutan liberan fontan komunumon por kunigi en la ŝanco difini kaj disvolvi nuban komputadon. Vi povas trovi pli da informoj pri la grupaj agadoj en la retejo de OpenStack Edge Computing.
id: Komputasi tepi (edge computing) tidak dan tidak boleh hanya terbatas pada komponen dan arsitektur OpenStack, namun ada beberapa alasan mengapa OpenStack sangat menarik sebagai platform komputasi awan. Edge Computing Group meminta komunitas open source untuk mulai mengeksplorasi tantangan dan kemungkinan ini. Kami menyadari bahwa ada pekerjaan yang harus dilakukan untuk mencapai tujuan kami menciptakan alat untuk memenuhi persyaratan baru ini. Kami menyambut dan mendorong seluruh komunitas open source untuk bergabung dalam kesempatan untuk menentukan dan mengembangkan cloud edge computing. Anda dapat menemukan lebih banyak informasi tentang aktivitas kelompok di halaman web OpenStack Edge Computing.
ja: エッジコンピューティングは、OpenStack の単なるコンポーネントやアーキテクチャーではなく、そうであるべきではありません。しかし OpenStack がクラウドエッジコンピューティングのプラットフォームとして特に魅力的である理由があります。Edge Computing Group は、オープンソースコミュニティーに対してこれらのチャレンジと挑戦を探求しようと呼びかけています。私たちは、新しい要求に見合うツールを作るというゴールを達成するためになすべき仕事があると認識しています。私たちは全てのオープンソースコミュニティーがクラウドエッジコンピューティングの定義と開発を行う機会に参加することを歓迎し、奨励します。OpenStack Edge Computing の ウェブページから、グループ活動の情報をさらに見つけることが出来ます。
ko_kr: Edge computing은 OpenStack의 구성 요소와 아키텍처에만 국한되지 않으며, OpenStack은 cloud edge computing을 위한 플랫폼으로 매력적인 이유가 있습니다. Edge Computing Group 은 오픈 소스 컴뮤니티에 이러한 과제와 가능성을 탐구할 수 있도록 요청합니다. 우리는 이러한 새로운 요구사항을 만족시키기 위한 도구를 만드는 목표를 달성하고자 해야하는 일이있다는 것을 인식하고 있습니다. 우리는 전체 오픈 소스 커뮤니티가 cloud edge computing을 정의하고 개발할 수 있는 기회에 참여할 것을 환영하며, 권유합니다. 그룹 활동에 대한 자세한 내용은 OpenStack Edge Computing 웹페이지를 참조하십시오.
pt_br: Computação de borda não é e não deve ser limitada somente a componentes e arquiteturas do OpenStack, mas há algumas razões pelas quais o Openstack é particularmente atraente como uma plataforma para computação de borda. O Grupo de computação de borda está pedindo que a comunidade de código aberto inicie a exploração desses desafios e possibilidades. Reconhecemos que existe trabalho a ser feito para atingir nossos objetivos de criar as ferramentas para atender a esses requisitos. Damos boas-vindas e encorajamos toda a comunidade de código aberto a entrar nessa oportunidade para definir e desenvolver a edge computing. Você pode encontrar mais informações sobre as atividades do grupo na página web do OpenStack de computação de borda.
zh_cn: 边缘计算不是也不应该仅限于OpenStack的组件和体系结构，但有很多理由证明，OpenStack作为边缘计算云端平台特别具有吸引力。Edge Computing Group工作组正在要求开源社区开始探索这些挑战和可能性。我们认识到，要实现我们创建这些工具以满足这些新需求的目标，还有很多工作要做。我们欢迎并鼓励整个开源社区参与这次定义与开发边缘计算的良机。您可以在OpenStack Edge Computing网站上找到有关该组活动的更多信息。

source: Visit openstack.org to get started with OpenStack or click on these resources for more information:
de: Besuchen Sie openstack.org, um mit OpenStack zu beginnen, oder klicken Sie auf diese Ressourcen, um weitere Informationen zu erhalten:
eo: Vizitu openstack.org por komenci kun OpenStack aŭ alklaku ĉi tiujn rimedojn por pliaj informoj:
id: Kunjungi openstack.org untuk memulai OpenStack atau klik sumber daya ini untuk informasi lebih lanjut:
ja: OpenStack と始めるために openstack.org を訪れ、より多くの情報を得るために以下のリソースをクリックしてみましょう。
ko_kr: OpenStack 을 시작하거나 다음 리소스를 클릭하여 자세한 정보를 얻으려면, openstack.org 를 방문하십시오.
pt_br: Visite openstack.org para iniciar com o OpenStack ou clique nesses recursos para mais informações:
zh_cn: 请访问openstack.org网站了解OpenStack，或打开下面这些资源链接获取更多信息：

source: Resource
de: Ressource
eo: Rimedo
id: Sumber
ja: リソース
ko_kr: 리소스
pt_br: Recursos

source: Overview
de: Übersicht
eo: Superrigado
id: Ikhtisar
ja: 概要
ko_kr: 개요
pt_br: Visão geral

source: OpenStack Edge Computing web page
de: OpenStack Edge Computing Webseite
eo: OpenStack Nuba Komputada retejo
id: Halaman web OpenStack Edge Computing
ko_kr: OpenStack Edge Computing 웹 페이지
pt_br: Página web do OpenStack Edge Computing

source: A central place to find pointers to videos of previous events, articles and further content on edge computing.
de: Ein zentraler Ort, um Hinweise zu Videos von früheren Veranstaltungen, Artikeln und weiteren Inhalten zu Edge Computing zu finden.
eo: Centra loko por trovi montroj al videoj de antaŭaj eventoj, artikoloj kaj plua enhavo pri randa komputado.
id: Tempat utama untuk menemukan petunjuk pada video tentang kejadian, artikel, dan konten terdepan sebelumnya di komputasi tepi.
ja: エッジコンピューティングに関する記事や過去のイベントのビデオなどが見つけられる中心的な場所です。
ko_kr: 이전 행사의 비디오, 기고글, Edge 컴퓨팅에 대한 더 자세한 컨텐츠를 찾을 수 있는 중심 페이지입니다.
pt_br: Um lugar central para encontrar ponteiros para os vídeos de eventos anteriores, artigos e conteúdo adicional sobre edge computing.
zh_cn: 边缘计算链接汇总，包括之前活动的视频、相关文章、以及进一步的内容。

source: OpenStack Edge Computing mailing list
de: OpenStack Edge Computing Mailing-Liste
eo: OpenStack Nuba Komputado dissendolisto
id: Milis OpenStack Edge Computing
ko_kr: OpenStack Edge Computing 메일링 리스트
pt_br: Lista de discussão OpenStack Edge Computing

source: A forum for discussions concerning edge and edge computing (not exclusively to OpenStack) and to receive information about ongoing activities and calls for action.
de: Ein Forum für Diskussionen über Edge und Edge Computing (nicht nur für OpenStack) und um Informationen über laufende Aktivitäten und Handlungsaufforderungen zu erhalten.
eo: Forumo por diskutoj pri rando kaj rando-komputado (ne ekskluzive al OpenStack) kaj por ricevi informojn pri daŭraj agadoj kaj alvokoj por agado.
id: Forum diskusi tentang komputasi tepi dan tepi (tidak eksklusif untuk OpenStack) dan menerima informasi tentang aktivitas yang sedang berlangsung dan seruan untuk bertindak.
ja: エッジとエッジコンピューティング (OpenStackに限定されない) に関するディスカッションや、進行中の活動や呼びかけに関する情報を受け取れるフォーラムです。
ko_kr: Edge와 Edge Computing (OpenStack에 국한되지 않는)에 대한 토론과 진행중인 활동, 조치 요청 등과 관련된 정보를 제공합니다.
pt_br: Um fórum para discussões relativas à borda e à edge computing (não exclusivamente para OpenStack) e para receber informações sobre atividades em andamento e convites para ação.
zh_cn: 讨论关于边缘和边缘计算的论坛（不限于OpenStack），也包含正在进行的活动和行动计划的信息。

source: OpenStack Summit
eo: OpenStack Pinto (Summit)
ko_kr: OpenStack 서밋

source: A four-day conference for IT business leaders, cloud operators and developers covering the open infrastructure landscape..Look for edge-related tracks and sessions at upcoming Summits.
de: Eine viertägige Konferenz für IT-Führungskräfte, Cloud-Betreiber und Entwickler, die sich mit der offenen Infrastruktur-Landschaft beschäftigen. Achten Sie auf bevorstehende Summits auf topaktuelle Tracks und Sessions.
eo: Konferenco de kvar tagoj por komercaj gvidantoj de IT, nubo operacioj kaj progrmistoj kiu kovras la malfermitan infrastrukturon pejzaĝo ... Atenti por nubo-rilataj programoj kaj kunsidoj je la sekvontaj Pintoj.
id: Konferensi empat hari untuk para pemimpin bisnis TI, operator dan pengembang awan yang meliput lanskap infrastruktur terbuka. Lihatlah trek dan sesi yang terkait dengan tepi pada KTT mendatang.
ja: ITインフラをカバーするITビジネスリーダー、クラウドオペレーター、開発者を対象とした 4 日間のカンファレンスです。今後のサミットでエッジ関連のトラックやセッションをご覧ください。
ko_kr: IT 인프라를 다루는 IT 비즈니스 리더, 클라우드 운영자, 개발자를 위한 4일간의 컨퍼런스입니다. 다가오는 서밋에서 Edge와 관련된 트랙과 세션을 찾아보십시오.
pt_br: Uma conferência de quatro dias para líderes empresariais de TI, operadores de nuvem e desenvolvedores cobrindo o cenário de infraestrutura aberta. Procure trilhas e sessões relacionadas a edge computing nos próximos Summits.
zh_cn: 为期四天的云计算技术峰会，面向IT领袖、云运营商和开发者。在此次峰会上新加入了边缘计算相关的议题分类。

source: Internet Relay Chat (IRC; https://wiki.openstack.org/wiki/IRC)
eo: Interreta Relajsa Babilo (IRC; https://wiki.openstack.org/wiki/IRC)
ja: インターネットリレーチャット(IRC; https://wiki.openstack.org/wiki/IRC)
ko_kr: 인터넷 릴레이 채팅 (IRC; https://wiki.openstack.org/wiki/IRC)

source: Fog/Edge/Massively Distributed Clouds (FEMDC) SIG IRC meetings (online) are held every two weeks (odd weeks), 1500 UTC on Wednesday, on the IRC channel #openstack-meeting.
de: Fog/Edge/Massively Distributed Clouds (FEMDC) SIG IRC-Treffen (online) finden alle zwei Wochen (ungerade Wochen), 1500 UTC am Mittwoch, auf dem IRC-Kanal #openstack-meeting statt.
eo: La kunvenoj de Fog/Edge/Massively Distributed Clouds (FEMDC) okazigas ĉiun du semajnojn (nepara semajnojn), 1500 UTC merkrede, en la IRC-kanalo #openstack-meeting.
id: Fog/Edge/Massively Distributed Clouds (FEMDC) Pertemuan SIG IRC (online) diadakan setiap dua minggu (minggu yang ganjil), 1500 UTC pada hari Rabu, di saluran IRC # openstack-meeting.
ja: Fog/Edge/Massively Distributed Clouds (FEMDC) SIG IRC ミーティング (オンライン) が 、IRC チャンネル #openstack-meeting 上で 2 週間ごとの奇数週水曜日 15:00 UTC から開かれます。
ko_kr: Fog/Edge/대규모(Massively) 분산 클라우드 (FEMDC) SIG IRC 미팅 (온라인)은 IRC 채널 #openstack-meeting 에서 2주마다 수요일 1500 UTC에 진행됩니다.
pt_br: Fog/Edge/Nuvens Distribuidas Maciçamente (FEMDC) As reuniões SIG IRC (on-line) são realizadas a cada duas semanas (semanas ímpares), 15:00 UTC na quarta-feira, no canal IRC # openstack-meeting.
zh_cn: FEMDC(Fog/Edge/Massively Distributed Clouds) SIG的IRC双周在线会议（奇数周），星期三1500 UTC，IRC频道是：#openstack-meeting

source: OpenStack events (https://www.openstack.org/community/events/)
de: OpenStack Veranstaltungen (https://www.openstack.org/community/events/)
eo: OpenStack eventoj (https://www.openstack.org/community/events/)
id: Acara OpenStack (https://www.openstack.org/community/events/)
ko_kr: OpenStack 이벤트 (https://www.openstack.org/community/events/)
pt_br: Eventos de OpenStack (https://www.openstack.org/community/events/)

source: Global schedule of events including the popular OpenStack Summits and regional OpenStack Days.
de: Global geplante Veranstaltungen incl. OpenStack Summits und regionale OpenStack Tage.
eo: Tutmonda horaro de eventoj inkluzive de la popularaj OpenStack Pintoj kaj regionaj OpenStack Tagoj.
id: Jadwal acara global termasuk OpenStack Summits yang populer dan OpenStack Days regional.
ja: ポピュラーな OpenStack Summit と各地域の OpenStack Days を含んだグローバルなイベントスケジュールです。
ko_kr: 대중적인 OpenStack Summit과 지역 OpenStack Days를 포함한 이벤트들을 모아둔 글로벌 일정표.
pt_br: Agenda global de eventos incluindo os populares OpenStack Summits e os regionais OpenStack Days.
zh_cn: OpenStack峰会和区域OpenStack Day的全球时刻表。

source: OpenStack Marketplace (https://www.openstack.org/marketplace/)
de: OpenStack Marktplatz (https://www.openstack.org/marketplace/)
eo: OpenStack Foiro (https://www.openstack.org/marketplace/)
ko_kr: OpenStack 마켓플레이스 (https://www.openstack.org/marketplace/)

source: One-stop resource to the skilled global ecosystem for distributions, drivers, training, services and more.
de: Ressourcen aus einer Hand für das qualifizierte globale Ökosystem für Verteilungen, Treiber, Schulungen, Dienstleistungen und mehr.
eo: Ununura rimedo al la kvalifika tutmonda ekosistemo por distribuoj, peliloj, trejnado, servoj kaj pli
id: One-stop resource untuk ekosistem global yang terampil untuk distribusi, driver, pelatihan, layanan dan lainnya.
ja: ディストリビューション、ドライバー、トレーニング、サービスその他のための熟練したグローバルエコシステムに向けたワンストップリソースです。
ko_kr: 배포, 드라이버, 트레이닝, 서비스 등에 대한 숙련된 글로벌 에코시스템을 제공하는 One-stop 리소스.
pt_br: Um ponto de parada para o ecossistema global qualificado de distribuições, drivers, treinamento, serviços e muito mais.
zh_cn: 为生态圈提供有关产品、推广、培训、服务等信息的一站式资源汇总。

source: Complete OpenStack documentation (https://docs.openstack.org/)
de: Komplette OpenStack Dokumentation (https://docs.openstack.org/)
eo: Tuto de la OpenStack dokumentaro (https://docs.openstack.org/)
id: Dokumentasi Complete OpenStack (https://docs.openstack.org/)
ko_kr: 전체 OpenStack 문서 (https://docs.openstack.org/)
pt_br: Documentação completa do OpenStack (https://docs.openstack.org/)
