Repository: amotoki/edge-computing-whitepaper
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, eo, id, ja, ko_kr, pt_br, zh_cn

source: There is much work to be done to achieve our goals, and we welcome and encourage the entire open source community to join in both the effort and the opportunity of creating or adapting tools to meet the new requirements of cloud edge computing.
de: Es gibt viel zu tun, um unsere Ziele zu erreichen, und wir begrüßen und ermutigen die gesamte Open-Source-Community, sich an den Bemühungen und Möglichkeiten zu beteiligen, Tools zu entwickeln oder anzupassen, um die neuen Anforderungen des Cloud Edge Computing zu erfüllen.
eo: Multe da laboro devas esti farita por atingi niajn celojn kaj ni bonvenigas kaj instigas la tutan malferman fontkomunumon aliĝi en ambaŭ la peno kaj la ŝanco krei aŭ adapti ilojn por atingi la novajn postulojn de nubranda komputiko.
id: Ada banyak pekerjaan yang harus dilakukan untuk mencapai tujuan kami, dan kami menyambut serta mendorong seluruh komunitas open source untuk bergabung dalam usaha dan kesempatan untuk membuat atau mengadaptasi alat untuk memenuhi persyaratan baru komputasi awan.
ja: 私たちの目標を達成するためには多くの作業が必要です。オープンソースコミュニティー全体が、クラウドエッジコンピューティングの新しい要件を満たすためツールを作成し、適用する努力と機会の両方に加わることを歓迎し、奨励します。
ko_kr: 우리의 목표를 달성하기 위해 할 일이 많이 있으며, 오픈 소스 커뮤니티 전체가 클라우드 edge 컴퓨팅에 대한 새로운 요구 사항을 충족시키기 위한 도구를 만들거나 적용할 수 있는 노력과 기회에 함께 참여할 것을 환영하며, 장려합니다.
pt_br: Existe muito trabalho a ser feito para atingir nossos objetivos, e damos boas-vindas e encorajamos toda a comunidade de código aberto para participar tanto do esforço, quanto da oportunidade de criação ou adaptação de ferramentas para atender os novos requisitos da nuvem Edge Computing.
zh_cn: 要实现我们的目标还需要很多的工作，我们非常欢迎和鼓励所有开源社区的成员都积极参与其中，一起努力和创建新的工具以满足边缘计算的新需求。

source: WHAT IS CLOUD EDGE COMPUTING?
de: WAS IST CLOUD EDGE COMPUTING?
eo: KIO ESTAS CLOUD EDGE COMPUTING -au NUBRANDA KOMPUTADO ?
id: APAKAH CLOUD EDGE COMPUTING?
ja: エッジコンピューティングとは？
ko_kr: 클라우드 edge 컴퓨팅은 무엇입니까?
pt_br: O QUE É A NUVEM EDGE COMPUTING?
zh_cn: 什么是边缘计算？

source: It is worth highlighting that many overlapping and sometimes conflicting definitions of edge computing exist—edge computing means many things to many people. But for our purposes, the most mature view of edge computing is that it is offering application developers and service providers cloud computing capabilities, as well as an IT service environment at the edge of a network.
de: Es ist hervorzuheben, dass viele überlappende und manchmal widersprüchliche Definitionen von Edge-Computing existieren. Edge-Computing bedeutet für viele Menschen viele Dinge. Die ausgereifteste Sicht von Edge Computing für unsere Zwecke ist jedoch, dass es Anwendungsentwicklern und Dienstanbietern Cloud-Computing-Funktionen sowie eine IT-Serviceumgebung am Rande eines Netzwerks bietet.
eo: Valoras reliefiganta ke multaj koincidanta kaj foje konfliktanta difinojn de randa komputiko ekzistas—randan komputikon signifas multajn aferojn al multaj homoj. Sed por niaj celoj, la plej matura vido de randa komputiko estas ke ĝi estas proponanta aplikajo programistojn kaj servajn provizantojn nubkomputanta kapablojn, tiel kiel IT serva medio ĉe la rando de reto.
id: Perlu disoroti bahwa banyak definisi komputasi tepi (edge computing) yang saling tumpang tindih dan kadang-kadang saling bertentangan - edge computing berarti berbagai hal bagi banyak orang. Namun untuk tujuan kami, tampilan komputasi tepi yang paling matang adalah menawarkan pengembang aplikasi dan penyedia layanan kemampuan komputasi awan, serta lingkungan layanan TI di tepi jaringan (edge of a network).
ja: エッジコンピューティングの定義には多くの重複と、時にはいくつか矛盾が存在するということは強調する価値があります。— エッジコンピューティングの意味は人によって様々です。エッジコンピューティングのもっとも成熟した見方は、アプリケーション開発者とサービス提供者に対し、クラウドコンピューティング機能と同様の IT サービス環境をネットワークのエッジに提供することです。
ko_kr: Edge 컴퓨팅에 대한 많은 중복(overlapping)과 때로는 상반되는 정의가 존재한다는 것을 강조할 필요가 있습니다. Edge 컴퓨팅은 많은 사람들에게 많은 뜻을 가지고 있습니다. 그러나 우리의 목적에 맞는 가장 성숙한 견해는 응용 프로그램 개발자와 서비스 공급자에게 클라우드 컴퓨팅 기능은 물론 네트워크 edge에서 IT 서비스 환경을 제공한다는 것입니다.
pt_br: Vale ressaltar que muitas definições sobrepostas e, às vezes, conflitantes de edge computing existem - edge computing significa muitas coisas para muitas pessoas. Mas para nossos propósitos, a visão mais madura de edge computing é que ela está oferecendo a desenvolvedores de aplicações e provedores de serviço recursos de computação em nuvem, bem como um ambiente de serviço de TI na borda de uma rede.
zh_cn: 需要强调的是，目前对于边缘计算定义有许多的重复和矛盾—许多人对边缘计算有着不同的解释。然而，我们的目的是要阐述关于边缘计算最成熟的观点：我们认为边缘计算是为应用开发者和服务提供商在网络的边缘侧提供云服务和IT环境服务。

source: The aim is to deliver compute, storage, and bandwidth much closer to data inputs and/or end users. An edge computing environment is characterized by potentially high latency among all the sites and low and unreliable bandwidth—alongside distinctive service delivery and application functionality possibilities that cannot be met with a pool of centralized cloud resources in distant data centers. By moving some or all of the processing functions closer to the end user or data collection point, cloud edge computing can mitigate the effects of widely distributed sites by minimizing the effect of latency on the applications.
de: Ziel ist es, Rechenleistung, Speicher und Bandbreite den Dateneingaben und/oder Endnutzern viel näher zu bringen. Eine Edge-Computing-Umgebung zeichnet sich durch potenziell hohe Latenzzeiten unter allen Standorten und geringe und unzuverlässige Bandbreite aus - neben ausgeprägten Möglichkeiten der Servicebereitstellung und Anwendungsfunktionalität, die mit einem Pool zentraler Cloud-Ressourcen in entfernten Rechenzentren nicht erreicht werden können. Indem einige oder alle Verarbeitungsfunktionen näher an den Endbenutzer oder den Datensammelpunkt verschoben werden, kann Cloud Edge Computing die Auswirkungen weit verbreiteter Standorte mindern, indem der Effekt der Latenz auf die Anwendungen minimiert wird.
eo: La celo estas liveri komputajo, memorilajo kaj retkapacito multe pli proksima al datumaj kontribuaĵoj kaj/aŭ finaj uzantoj. Randkomputanta medio estas karakterizita de potenciale alta atendotempo inter ĉiuj la ejoj kaj malalta kaj nefidinda kapacito—apud aparta servo livero kaj aplikajo funkcia eblecoj kiu ne povas esti renkontita kun komunaĵo de centralizitaj nubo rimedoj en fora datumcentroj. Per movado de kelkaj aŭ ĉiuj de la datumtraktadaj funkcioj pli proksiman al la fina uzanto aŭ datuma kolekto punkto, nuba rando komputiko povas mildigi la efikojn de fore distribuita ejojn per minimumiganta la efikon de atendotempo sur la aplikoj.
id: Tujuannya adalah untuk memberikan komputasi, penyimpanan, dan bandwidth yang lebih dekat dengan input data dan/atau pengguna akhir. Lingkungan komputasi yang canggih ditandai dengan latency yang berpotensi tinggi di antara semua situs dan bandwidth rendah dan tidak dapat diandalkan - bersamaan dengan penyampaian layanan dan fungsionalitas aplikasi yang khas yang tidak dapat dipenuhi dengan kumpulan sumber daya awan terpusat di pusat data yang jauh. Dengan memindahkan sebagian atau seluruh fungsi pemrosesan ke titik akhir pengguna atau pengumpulan data, komputasi tepi awan (cloud edge computing) dapat mengurangi dampak dari situs yang terdistribusi secara luas dengan meminimalkan efek latency pada aplikasi.
ja: その狙いは、コンピューティング、ストレージ、帯域幅をデータ源やエンドユーザーの近くで提供することです。エッジコンピューティング環境は、全サイト間の潜在的な高遅延と信頼性の低い小さな帯域幅に特徴付けられます。さらに、一般的なデータセンターの集中型クラウドリソースでは提供することができない、特有のサービス配信とアプリケーション機能の可能性にも特徴付けられます。処理機能の一部または全部をエンドユーザーまたはデータ収集ポイントに近づけることによって、アプリケーション上の遅延影響を最小限に抑える効果により、広域分散の影響を抑制することができます。
ko_kr: 우리의 목표는 compute, 스토리지, 대역폭에 대한 데이터 입력이나 최종 사용자에게 훨씬 가깝게 제공할 수 있도록 전달하는 것입니다. Edge Computing 환경은 모든 사이트에서 잠재적으로 높은 지연 시간과 낮고 신뢰할 수 없는 대역폭의해 특정되어집니다. 원거리 데이터 센터의 중앙 집중식 클라우드 리소스 풀로는 충족할 수 없는 차별화된 서비스 제공과 응용 프로그램 기능 가능성을 제공합니다. 일부 또는 모든 처리 기능을 최종 사용자나 데이터 수집 지접에 더 가깝게 이동시킴으로써 cloud edge computing은 응용 프로그램에 대한 지연 효과를 최소화하여 널리 분산된 사이트의 영향을 완하할 수 있습니다.
pt_br: O objetivo é entregar computação, armazenamento, e largura de banda muito mais próximos da entrada de dados e/ou dos usuários finais. Um ambiente Edge Computing é caracterizado por latência potencialmente alta entre todos os sites e largura de banda baixa e não confiável - juntamente com a entrega de serviços peculiares e possibilidades de funcionalidade de aplicação que não podem ser cumpridas com um pool de recursos de nuvem centralizado em centros de dados distantes. Ao mover algumas ou todas as funções de processamentos para mais perto do usuário final ou do ponto de coleta de dados, a nuvem Edge Computing pode mitigar os efeitos de sites amplamente distribuídos, minimizando os efeitos da latência nas aplicações.
zh_cn: 边缘计算的目标是在靠近数据输入或用户的地方提供计算、存储和网络带宽。一个边缘计算的环境一般有以下特点：多个站点之间的潜在高延迟、网络不可靠和慢速带宽, 伴随着一般数据中心中心化资源池所不能应对的其他交付服务和应用功能。通过将部分或者全部处理程序迁移至靠近用户或数据收集点，边缘计算能够大大减少在大规模分布式站点下给应用程序所带来的影响。

source: Edge computing first emerged by virtualizing network services over WAN networks, taking a step away from the data center. The initial use cases were driven by a desire to leverage a platform that delivered the flexibility and simple tools that cloud computing users have become accustomed to.
de: Edge Computing wurde zuerst durch die Virtualisierung von Netzwerkdiensten über WAN-Netzwerke entwickelt und entfernte sich damit vom Rechenzentrum. Die anfänglichen Anwendungsfälle waren auf den Wunsch zurückzuführen, eine Plattform zu nutzen, die die Flexibilität und die einfachen Tools bietet, an die sich Cloud-Computing-Benutzer gewöhnt haben.
eo: Randa komputado unue aperis dum virtualigo de retaj servoj super WAN retoj, prenanta paŝon for de la datuma centro. La komencaj uzokazoj estis veturita de deziro ekspluati platformon kiu liveris la flekseblecon kaj simplajn ilojn al kiuj nubo komputanta uzantojn jam fariĝis kutimita.
id: Komputasi tepi (edge computing) pertama kali muncul dengan menggandakan layanan jaringan melalui jaringan WAN, mengambil langkah menjauh dari pusat data. Kasus penggunaan awal didorong oleh keinginan untuk memanfaatkan platform yang memberikan fleksibilitas dan alat sederhana yang menjadi kebiasaan komputasi awan.
ja: エッジコンピューティングは、WAN ネットワーク上でネットワークサービスを仮想化することによって初めて登場し、データセンターから離れる一歩を踏み台ました。初期のユースケースは、クラウドコンピューティングユーザーが使い慣れた柔軟でシンプルなツールを提供するプラットフォームを使いたいという要望によって推進されました。
ko_kr: Edge computing은 WAN 네트워크를 통해 네트워크 서비스를 가상화하여 데이터 센터에서 한 걸음 더 나왔습니다. 초기 사용 사례는 클라우드 컴퓨팅 사용자가 익숙해진 유연함과 간단한 도구를 제공하는 플랫폼을 활용하려는 욕구에서 발생했습니다.
pt_br: A Edge computing suriu primeiro através da virtualização de serviços de rede sobre redes WAN, dando um passo longe do centro de dados. Os casos de uso iniciais foram impulsionados pelo desejo de alavancar uma plataforma que entregava a flexibilidade e ferramentas simples às quais os usuários de computação em nuvem se acostumaram.
zh_cn: 边缘计算与数据中心的应用差别，首先出现在基于广域网的虚拟网络服务上。最开始的应用场景是希望能够借助现有云计算用户所熟悉的架构，来建立一个即灵活又简单的管理平台

source: As new edge computing capabilities emerge, we see a changing paradigm for computing—one that is no longer necessarily bound by the need to build centralized data centers. Instead, for certain applications, cloud edge computing is taking the lessons of virtualization and cloud computing and creating the capability to have potentially thousands of massively distributed nodes that can be applied to diverse use cases, such as industrial IoT or even far-flung monitoring networks for tracking real time water resource usage over thousands, or millions, of locations.
de: Wenn neue Edge-Computing-Fähigkeiten entstehen, sehen wir ein sich wandelndes Paradigma für das Computing - eines, das nicht mehr unbedingt an die Notwendigkeit gebunden ist, zentralisierte Rechenzentren zu bauen. Für bestimmte Anwendungen nimmt das Cloud Edge Computing die Lehren aus Virtualisierung und Cloud Computing und schafft die Möglichkeit, potenziell Tausende von massiv verteilten Knoten zu verwenden, die auf verschiedene Anwendungsfälle wie industrielles IoT oder sogar weit entfernte Überwachungsnetzwerke angewendet werden können zur Verfolgung der Wasserressourcen in Echtzeit über Tausende oder Millionen von Standorten.
eo: Kiel novaj randkomputanta kapablojn aperas, ni vidas ŝanĝanta paradigmom por komputado—unu kiu estas ne pli longa nepre ligita de la bezono konstrui centralizitajn datumajn centrojn. Male, por certaj aplikoj, nubranda komputiko estas prenanta la lecionojn de virtualizado kaj nuba komputiko kaj kreanta la kapablon havi potenciale miloj da grandege distribuitajn nodojn kiu povas esti aplikita al diversaj uzo kazoj, kiel industria IoT aŭ eĉ for-ĵetitaj monitoranta retojn por spuradi realtempe akva rimedo uzado super miloj aŭ milionoj da lokoj.
id: Seiring kemampuan komputasi tepi (edge computing) baru muncul, kita melihat paradigma perubahan untuk komputasi - yang tidak lagi terikat oleh kebutuhan untuk membangun pusat data terpusat. Sebagai gantinya, untuk aplikasi tertentu, cloud edge computing mengambil pelajaran dari virtualisasi dan komputasi awan dan menciptakan kemampuan untuk memiliki ribuan node yang didistribusikan secara besar-besaran yang dapat diterapkan pada beragam kasus penggunaan, seperti industri IoT atau bahkan jaringan pemantauan jarak jauh (far-flung monitoring networks) untuk melacak penggunaan sumber air secara real time lebih dari ribuan, atau jutaan, lokasi.
ja: 新しい形のエッジコンピューティングが登場するにつれて、コンピューティングへの見方が変わりつつあります。もはや集中的なデータセンターを構築する必要性に縛られることはありません。代わりに一部のアプリケーションでは、エッジコンピューティングが仮想化とクラウドコンピューティングの知見を活用し、数千台規模の数を潜在的に持つ分散ノードを持つことで様々なユースケースに対応する可能性を生み出しています。例えば、産業用の IoT や、リアルタイムで水資源の使用量を数千、数百万の場所で監視するネットワークなどです。
ko_kr: 새로운 edge computing 기능이 등장하면서, 중앙 집중식 데이터 센터 구축의 필요성에 더이상 구속되지 않는 컴퓨팅 패러다임으로 변화가 진행되었습니다. 특정 애플리케이션에서 cloud edge computing은 가상화와 클라우드 컴퓨팅, 산업용 IoT나 멀리 떨어진 수천, 수백만의 위치에 떨어져있는 실시간 수자원 사용량 모니터링과 같은 다양한 유즈케이스를 적용할 수 있는 수천개의 대규모 분산 노드를 통하여 가능성을 만들고 있습니다.
pt_br: À medida que surgem novas capacidades de Edge Computing, vemos um paradigma em mudança para a computação - um deles e que não é mais necessário construir um centro de dados centralizado. Em vez disso, para certas aplicações, a nuvem Edge Computing está tomando as lições da virtualização e da computação em nuvem e criando a capacidade de ter potencialmente milhares de nós distribuídos massivamente, que podem ser aplicados para diversos casos de uso, como por exemplo IoT industrial ou mesmo redes de monitoramento distantes para rastrear o uso de recursos hídricos em tempo real ao longo de milhares ou milhões de localidades.
zh_cn: 随着新型的边缘计算能力的出现，我们可以看见计算模型的转变——不再束缚于建设中心化的数据中心。取而代之的是，对于某些应用来说，边缘计算吸取了虚拟化和云计算的经验，创造出一种能够管理成千上万大规模分布式节点的潜在能力，并且满足各种多样的用户场景，例如工业领域的万物互联或者是应用于成千上万水力资源网络的全方位实时监控。

source: Many proprietary and open source edge computing capabilities already exist without relying on distributed cloud—some vendors refer to this as “device edge.” Components of this approach include elements such as IoT gateways or NFV appliances. But increasingly, applications need the versatility of cloud at the edge, although the tools and architectures needed to build distributed edge infrastructures are still in their infancy. Our view is that the market will continue to demand better capabilities for cloud edge computing.
de: Viele proprietäre und quelloffene Edge-Computing-Funktionen sind bereits vorhanden, ohne auf verteilte Cloud angewiesen zu sein - einige Hersteller bezeichnen dies als "Device Edge". Zu den Komponenten dieses Ansatzes gehören Elemente wie IoT-Gateways oder NFV-Appliances. Anwendungen benötigen jedoch zunehmend die Vielseitigkeit der Cloud am Rande, obwohl die Tools und Architekturen, die für den Aufbau verteilter Edge-Infrastrukturen benötigt werden, noch in den Kinderschuhen stecken. Unserer Ansicht nach wird der Markt weiterhin bessere Fähigkeiten für Cloud Edge Computing verlangen.
eo: Multaj proprietaj kaj malferma fonto rando komputanta kapablojn jam ekzistas sen fidanta sur distribuita nubo—kelkaj vendistoj plu-gvidas al tio ĉi kiel “aparata rando.” Eroj de ĉi tiu alproksimiĝo inkluzivas elementojn kiel IoT enirejoj aŭ NFV-aj aparatoj. Sed ĉiufoje pli, aplikoj bezonas la eblecojn de nubo ĉe la rando, kvankam la iloj kaj arkitekturoj bezonita por konstrui distribuitajn randajn infrastrukturojn estas ankoraŭ en ilia infanaĝo. Nia vido estas ke la merkato daŭros postuli pli bonajn kapablojn por nuba rando komputiko.
id: Banyak kemampuan komputasi tepi (edge computing) sumber dan open source yang sudah ada tanpa mengandalkan awan terdistribusi - beberapa vendor menyebut ini sebagai “device edge.” Komponen dari pendekatan ini mencakup elemen seperti gerbang IoT atau peralatan NFV. Namun semakin, aplikasi membutuhkan fleksibilitas awan di tepinya, walaupun alat dan arsitektur yang dibutuhkan untuk membangun infrastruktur terdistribusi masih dalam tahap awal. Pandangan kami adalah bahwa pasar akan terus menuntut kemampuan yang lebih baik untuk cloud computing.
ja: 分散クラウドに依存することなく、独自開発もしくはオープンソースのエッジコンピューティングが既に存在しています。いくつかのベンダーはこれを「デバイス・エッジ」と呼んでいます。この手法のコンポーネントには IoT ゲートウェイや NFV アプライアンスが含まれています。しかし、アプリケーションはクラウドの様々な機能をエッジに必要としますが、分散型エッジインフラを構築するためのツールやアーキテクチャーはまだ初期段階です。我々は、市場がエッジコンピューティングに対して優れた機能を求め続けると考えています。
ko_kr: 많은 소유권과 오픈 소스 edge computing 기능은 분산 클라우드에 의존하지 않고 이미 존재하고 있습니다. 일부 공급업체에서는 이것을 "device edge"라고 합니다. 이 접근법에서의 구성요소에는 IoT 게이트웨이나 NFV 장비와 같은 요소가 포함됩니다. 그러나 분산형 edge 인프라를 구축하기위해 (아직 초기 단계인) 도구와 아키텍처가 점점 더 많은 애플리케이션에서 edge cloud 기능이 필요해질 것입니다. 시장에서는 cloud edge computing을 대한 더 나은 기능을 계속 요구할 것으로 보입니다.
pt_br: Muitas capacidades de edge computing proprietárias e de código aberto já existem sem depender da nuvem distribuída - alguns fornecedores referem-se a isso como "dispositivo de ponta". Componentes dessa abordagem incluem elementos como gateways IoT ou appliances NFV. Mas cada vez mais, aplicações precisam da versatilidade de nuvem na borda, apesar das ferramentas e arquiteturas necessárias para construir uma infraestrutura de borda serem ainda prematuras. Nossa visão é que o mercado continuará tendo demandas de melhores capacidades para a nuvem edge computing.
zh_cn: 目前存在很多商业的和开源的边缘计算软件，它们其实并不依赖于分布式云架构——一些厂商把这类产品称作“边缘设备”。这种方案的组件主要包括IoT网管或者NFV设备。但是逐渐地，应用程序需要云在边缘节点能够提供更加丰富的功能，然而此时构建分布式边缘基础设施的工具和架构还处于早期。我们的看法是，市场对边缘计算的能力需求会持续不断地增长。

source: Edge computing capabilities include, but are not limited to:
de: Edge-Computing-Funktionen umfassen, sind aber nicht beschränkt auf:
eo: Rando komputanta kapablojn inkluzivas, sed ne estas limigita al:
id: Kemampuan komputasi tepi (edge computing) mencakup, namun tidak terbatas pada:
ja: エッジコンピューティングの能力は、限定されてはいませんが次のようなものがあります。
ko_kr: Edge computing 기능은 다음을 포함하나 다음 기능에만 국한하지는 않습니다:
pt_br: As capacidades do Edge computing incluem, mas não estão limitadas a:
zh_cn: 边缘计算的能力包括并不限于下列：

source: * A consistent operating paradigm across diverse infrastructures.
de: * Ein konsistentes Betriebsparadigma über verschiedene Infrastrukturen hinweg.
eo: * Konsekvenca funkciado paradigmo trans diversaj infrastrukturoj.
id: * Paradigma operasi yang konsisten di berbagai infrastruktur.
ja: * 多様性のあるインフラをまたいだ、一貫性のある運用の枠組み
ko_kr: * 다양한 인프라 전반에 대한 일관된 운영 패러다임
pt_br: * Um paradigma de operação consistente entre infraestruturas diversas.
zh_cn: * 提供一个跨多种基础设施的一致性操作范式

source: * The ability to perform in a massively distributed (think thousands of global locations) environment.
de: * Die Fähigkeit, in einer massiv verteilten Umgebung (denke an Tausende von globalen Standorten) zu arbeiten.
eo: * La kapableco elfari en grandege distribuita (pensi milojn de tutmondaj lokoj) medio.
id: * Kemampuan untuk tampil di lingkungan yang terdistribusi secara massal (pikirkan ribuan lokasi global).
ja: * 極めて分散された環境 (世界中に数千のロケーション) 上で処理する能力
ko_kr: * 대규모 분산된 환경 (수천 개의 글로벌한 지역)에서 수행할 수 있는 능력.
pt_br: * A capacidade de executar em um ambiente massivamente distribuído (pense em milhares de localizações globais).
zh_cn: * 能够支持大规模分布式环境

source: * The need to deliver network services to customers located at globally distributed remote locations.
de: * Die Bereitstellung von Netzwerkdiensten für Kunden an global verteilten Remote-Standorten.
eo: * La bezono liveri retajn servojn al klientoj troviĝita ĉe tutmonde distribuita izolitajn lokojn.
id: * Kebutuhan untuk memberikan layanan jaringan kepada pelanggan yang berada di lokasi terpencil yang terdistribusi secara global.
ja: * 世界中に分散された遠隔地に存在するカスタマー向けにネットワークサービスを提供するニーズ
ko_kr: * 전 세계에 분산된 원격 위치에 위치한 고객에게 네트워크 서비스를 제공해야 하는 필요성.
pt_br: * A necessidade de entregar serviços de rede para clientes localizados em locais remotos distribuídos globalmente.
zh_cn: * 能够为全球分布的客户交付网络服务

source: * Application integration, orchestration and service delivery requirements.
de: * Anforderungen an Anwendungsintegration, Orchestrierung und Servicebereitstellung
eo: * Aplikajo integrigon, orkestradon kaj servo-livero postuloj.
id: * Aplikasi integrasi, orkestrasi dan persyaratan pengiriman layanan.
ja: * アプリケーションのインテグレーションとオーケストレーション、そしてサービス提供の要件
ko_kr: * 응용 프로그램 통합, 오케스트레이션, 서비스 제공 요구 사항.
pt_br: * Integração de aplicações, orquestração e requisitos de entrega de serviços.
zh_cn: * 能够满足应用集成、编排和服务交付的需求

source: * Hardware limitations and cost constraints.
de: * Hardware-Einschränkungen und Kostenbeschränkungen.
eo: * Aparataraj limoj kaj kostaj limoj.
id: * Keterbatasan hardware dan batasan biaya.
ja: * ハードウェア限界とコスト制約
ko_kr: * 하드웨어 제한과 비용 제약.
pt_br: * Limitações de hardware e restrições de custo.
zh_cn: * 能够满足硬件资源的限制和成本的限制

source: * Limited or intermittent network connections.
de: * Begrenzte oder unterbrochene Netzwerkverbindungen.
eo: * Limhava aŭ intermita retaj konektoj.
id: * Koneksi jaringan terbatas atau terputus-putus.
ja: * 限定的、あるいは間欠的なネットワーク接続性
ko_kr: * 제한되거나 간헐적인 네트워크 연결
pt_br: * Conexões de internet intermitentes ou limitadas.
zh_cn: * 能够运行在局限及不稳定的网络之上

source: * Methods to address applications with strict low latency requirements (AR/VR, voice, and so forth).
de: * Methoden, um Anwendungen mit strengen niedrigen Latenzanforderungen (AR/VR, Sprache usw.) zu adressieren.
eo: * Metodoj por trakti aplikojn kun strikta malalta atendotempo postuloj (AR/VR, voĉo kaj tiel plu).
id: * Metode untuk menangani aplikasi dengan persyaratan latensi rendah yang ketat (AR/VR, suara, dan sebagainya).
ja: * (AR/VR や音声、さらにそれ以上のための) 厳しい低遅延要件に従ったアプリケーション配置方法
ko_kr: * 엄격한 낮은 대기 시간 요구 사항 (AR/VR, 음성 등)으로 응용 프로그램 처리하는 방법.
pt_br: * Métodos para abordar aplicações com requisitos rigorosos de baixa latência (RA/RV , voz, e assim por diante).
zh_cn: * 能够满足应用对超低延迟的需求，如增强现实、虚拟现实和语言识别等

source: * Geofencing and requirements for keeping sensitive private data local.
de: * Geofencing und Anforderungen für die lokale Aufbewahrung sensibler Daten.
eo: * 'Geofencing' kaj postuloj por teni senteman privatan datumon loka.
id: * Geofencing dan persyaratan untuk menjaga data pribadi sensitif lokal.
ja: * ジオフェンシングや重要なプライベートデータをローカルに保存するための要件
ko_kr: * 민감한 개인 데이터를 로컬에 보관하기 위한 지오 코딩과 요구 사항
pt_br: * Geofencing e requisitos para manter dados locais confidenciais.
zh_cn: * 能够实现区域隔离，保护本地数据的隐私

source: A DEEPER EXPLORATION OF EDGE COMPUTING CONSIDERATIONS
de: EINE TIEFERE ERKUNDUNG DER EDGE-COMPUTING-ÜBERLEGUNGEN
eo: PLI PROFUNDA ESPLORADO de RANDA KOMPUTANTA KONSIDEROJN
id: EKSPLORASI PERTIMBANGAN EDGE COMPUTING MENDALAM
ja: エッジコンピューティング検討のより深い説明
ko_kr: Edge Compuing 고려 사항에 대한 심층 탐구
pt_br: UMA EXPLORAÇÃO MAIS PROFUNDA DE CONSIDERAÇÕES DE EDGE COMPUTING
zh_cn: 深入探索边缘计算的考虑因素
