Repository: amotoki/edge-computing-whitepaper
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, eo, id, ja, ko_kr, pt_br, zh_cn

source: 1. Retail/finance/remote location “cloud in a box”: Edge computing infrastructure that supports a suite of applications customized to the specific company or industry vertical. Often used by the enterprise, edge computing infrastructure, ultimately coupled together into distributed infrastructure, to reduce the hardware footprint, standardize deployments at many sites, deliver greater flexibility to replace applications located at the edge (and to have the same application running uniformly in all nodes irrespective of HW), boost resiliency, and address concerns about intermittent WAN connections. Caching content or providing compute, storage, and networking for self-contained applications are obvious uses for edge computing in settings with limited connectivity.
de: 1. Einzelhandel/Finanzen/Remote-Standort "Cloud in a Box": Edge-Computing-Infrastruktur, die eine Reihe von Anwendungen unterstützt, die auf die jeweilige Branche oder Branche zugeschnitten sind. Die Edge-Computing-Infrastruktur, die häufig von Unternehmen genutzt wird, wird letztendlich zu verteilter Infrastruktur zusammengeführt, um den Hardware-Footprint zu reduzieren, die Bereitstellung an vielen Standorten zu standardisieren, die Flexibilität von Anwendungen am Rand zu ersetzen (und die gleiche Anwendung einheitlich auszuführen) Knoten unabhängig von der Hardware), erhöhen die Ausfallsicherheit und beheben Probleme mit intermittierenden WAN-Verbindungen. Die Zwischenspeicherung von Inhalten oder die Bereitstellung von Rechen-, Speicher- und Netzwerkfunktionen für eigenständige Anwendungen sind naheliegende Anwendungen für Edge Computing in Umgebungen mit eingeschränkter Konnektivität.
eo: 1. Negoco/financo/remota loko "nubo en skatolo": Randokomputila infrastrukturo kiu subtenas serion da aplikoj adaptitaj al la specifa firmao aŭ industrio vertikala. Ofte uzata de la entrepreno, komputila infrastrukturo, finfine kunigita en distribuita infrastrukturo, por redukti la aparataron, normigi la disponigojn en multaj lokoj, liveri pli grandan flekseblecon por anstataŭigi aplikaĵojn lokigitajn ĉe la rando (kaj havi la saman aplikon kurante uniforme en ĉiuj nodoj sendepende de HW), plifortigi reziston, kaj prizorgi zorgojn pri intermitaj WAN-konektecojn. Kaŝmemori enhavon aŭ havigi komputilon, stokadon kaj retojn por memstaraj aplikoj estas evidentaj uzoj por randa komputado en agordoj kun limigita konektebleco.
id: 1. Ritel / keuangan / lokasi terpencil “cloud in a box”: Infrastruktur komputasi tepi yang mendukung rangkaian aplikasi yang disesuaikan dengan perusahaan tertentu atau vertikal industri. Seringkali digunakan oleh perusahaan, infrastruktur komputasi tepi, akhirnya digabungkan menjadi infrastruktur terdistribusi, untuk mengurangi jejak perangkat keras, membuat standar penerapan di banyak tempat, memberikan fleksibilitas yang lebih besar untuk menggantikan aplikasi yang berada di tepi (dan memiliki aplikasi yang sama yang berjalan secara seragam di semua node terlepas dari HW), meningkatkan ketahanan, dan mengatasi kekhawatiran tentang koneksi WAN intermiten. Konten caching atau menyediakan komputasi, penyimpanan, dan jaringan untuk aplikasi mandiri adalah penggunaan yang jelas untuk komputasi tepi dalam pengaturan dengan konektivitas terbatas.
ja: 1. 小売/金融/遠隔地 「箱の中のクラウド」: アプリケーションパッケージをサポートするエッジコンピューティングインフラは、特定の企業や産業向けにカスタマイズされます。企業に利用される場合には大抵、アプリケーションパッケージとエッジコンピューティングインフラは究極的に統合されて分散インフラとなります。その目的は、ハードウェアの大きさを抑え、複数拠点のデプロイメントを標準化し、エッジに位置するアプリケーションの交換作業に大きな柔軟性をもたらし (さらにハードウェアの違いにかかわらず同じアプリケーションを動作させ)、迅速に起動し、そして断続的な WAN 接続という心配事にも配慮するというものです。コンテンツをキャッシュし、あるいはコンピュートやストレージ、ネットワークを自給自足アプリケーションのために提供することは、限られた接続性という状況におけるエッジコンピュータの明らかな利用法です。
ko_kr: 1. 소매/금융/원격 위치 "cloud in a box": 특정 회사나 업계 종사자에게 맞게 사용자 지정된 애플리케이션 제품군을 지원하는 Edge computing 인프라입니다. 기업에서 종종 사용하는 edge computing 인프라는 궁극적으로 분산 인프라에 결합되어 하드웨어 풋 프린트를 줄이고 여러 사이트에서 표준으로 구현하여 edge에 위치한 애플리케이션을 대체할 수 있는 유연성을 제공합니다 (동일한 애플리케이션을 모두 HW와는 관계업는 노드입니다), 탄성 향상 및 간헐적인 WAN 연결에 대한 문제를 해결합니다. 자체 포함된 애플리케이션에 대한 컨텐츠 캐시나 compute, 저장소, 네트워킹은 연결이 제한된 설정에서 edge computing을 명백한 사용처입니다.
pt_br: 1. Varejo/finanças/localização remota "nuvem em uma caixa": Infraestrutura de computação de nuvem que suporta uma suíte de aplicações customizadas para uma empresa específica ou indústria vertical. Frequentemente usada por empresas, a infraestrutura de computação de borda, em adição a uma infraestrutura distribuída, para reduzir o perfil de hardware, padronizar implantações em muitos sites, entregar maior flexibilidade para substituir aplicações localizadas na borda (e para ter a mesma aplicação rodando uniformemente em todos os nós independetemente do hardware), impulsionar resiliência, e abordar preocupações sobre conexões WAN intermitentes. Cache de conteúdo ou fornecimento de computação, armazenamento e rede para aplicações autônomas são usos óbvios para computação de borda em cenários com conectividade limitada.
zh_cn: 1. 供零售/金融/远程连接领域使用的"盒中云"：提供了一系列可定制于特定企业或产业应用的边缘计算环境。这类边缘计算主要由企业使用，它从根本上与分布式结构相结合来达到以下效果：降低硬件消耗，多站标准化部署，灵活更替部署在边缘侧的应用（不受硬件影响，同一应用在所有节点上一致运行），提升韧性并关注间断WAN连接。当设定为有限网络连接时，内容缓存或提供计算、存储服务以及网络服务都是边缘计算常见的使用方法。

source: 1. Mobile connectivity: Mobile/wireless networks are likely to be a common environmental element for cloud edge computing, as mobile networks will remain characterized by limited and unpredictable bandwidth, at least until 5G becomes widely available. Applications such as augmented reality for remote repair and telemedicine, IoT devices for capturing utility (water, gas, electric, facilities management) data, inventory, supply chain and transportation solutions, smart cities, smart roads and remote security applications will all rely on the mobile network to greater or lesser degrees. They will all benefit from edge computing’s ability to move workloads closer to the end user.
de: 1. Mobile Konnektivität: Mobile/drahtlose Netzwerke sind wahrscheinlich ein verbreitetes Umweltelement für Cloud Edge Computing, da mobile Netzwerke weiterhin durch begrenzte und nicht vorhersehbare Bandbreite gekennzeichnet sind, zumindest bis 5G allgemein verfügbar ist. Anwendungen wie Augmented Reality für Fernreparatur und Telemedizin, IoT - Geräte für die Erfassung von Versorgungs -, Wasser -, Gas -, Elektrizitäts - und Gebäudemanagement - Daten, Inventar -, Lieferketten - und Transportlösungen, Smart Cities, Smart - Road - und Remote - Security - Anwendungen werden auf Mobilfunknetz mehr oder weniger stark. Sie alle profitieren von der Fähigkeit von Edge Computing, Arbeitslasten näher an den Endbenutzer zu verlagern.
eo: 1. Mobila konektebleco: Mobilaj/sendrataj retoj verŝajne estos komuna ekologia elemento por nubrando-komputado, ĉar mobilaj retoj daŭre restos karakterizita per limigita kaj neantaŭvidebla bandkapacito, almenaŭ ĝis 5G fariĝas vaste disponebla. Aplikoj kiel plibonigita realeco por remota riparo kaj telemedicino, IoT-aparatoj por kaptado de utilecaj (akvo, gaso, elektra, instaladministrado) datumoj, inventaro, provizoĉenaj kaj transportaj solvoj, inteligentaj urboj, inteligentaj vojoj kaj deforaj sekurecaj aplikoj ĉiuj dependos de la mobila reto je pli grandaj aŭ malpliaj gradoj. Ĉiuj profitos de la kapablo de randa komputado por movi ŝarĝojn de laboro pli proksima al la finuzanto.
id: 1. Konektivitas mobile: Jaringan mobile / nirkabel cenderung menjadi elemen lingkungan yang umum digunakan untuk komputasi awan, karena jaringan seluler akan tetap dicirikan oleh bandwidth yang terbatas dan tidak dapat diprediksi, setidaknya sampai 5G tersedia secara luas. Aplikasi seperti augmented reality untuk perbaikan jarak jauh dan telemedicine, perangkat IoT untuk menangkap utilitas utilitas (air, gas, listrik, manajemen fasilitas), persediaan, rantai pasokan dan solusi transportasi, kota cerdas, jalan cerdas dan aplikasi keamanan jarak jauh akan bergantung pada jaringan seluler ke tingkat yang lebih besar atau lebih rendah. Mereka semua akan mendapatkan keuntungan dari kemampuan komputasi tepi untuk memindahkan beban kerja lebih dekat ke pengguna akhir.
ja: 1. モバイル接続性: モバイル/無線ネットワークは、クラウドエッジコンピューティングの共通な環境要素になりそうです。モバイルネットワークは、少なくとも 5G が広く利用されるまでは、制限され予測不可能な帯域によって特徴付けられるでしょう。例えば遠隔修理や遠隔医療のための高いリアリティ、公共事業 (水道、ガス、電気、設備管理) データを監視する IoT 装置、商品目録、サプライチェーンや輸送ソリューション、スマートシティ、スマートロード、そして遠隔セキュリティといったアプリケーションは、多かれ少なかれ全てモバイルネットワークに頼っています。これらのアプリケーションは全て、エッジコンピューティングのワークロードをエンドユーザーに近づけるという機能に恩恵をうけることになるでしょう。
ko_kr: 1. 모바일 연결성: 모바일 네트워크는 적어도 5G가 널리 보급될때까지 제한적이고 예측할 수 없는 대역폭으로 특징 지워질 것이므로 모바일/무선 네트워크는 cloud edge computing을 위한 공통된 환경 요소일 수 있습니다. 원격 수리 및 원격 진료를 위한 증강현실, 유틸리티 (물, 가스, 전기, 시설관리) 데이터, 재고, 공급망 및 운송 솔루션, 스마트 도시, 스마트 도로와 원격 보안 애플리케이션을 캡처하기위한 IoT 장치는 모두 모바일 네트워크에대한 규모는 더 크거나 작습니다. 최종 사용자에게 워크로드를 더 가깝게 옮길 수 있는 edge computing의 이점을 모두 누릴 수 있습니다.
pt_br: 1. Conectividade móvel: Redes móveis/sem fio são provavelmente os elementos de ambiente comuns para nuvem de computação de borda, visto que as redes móveis continuarão sendo caracterizadas por larguras de banda limitadas e imprevisíveis, ao menos até que a 5G esteja amplamente disponível. Aplicações tais como a realidade aumentada para reparos remotos e telemedicina, dispositivos de IoT para utilitário de captura de dados (água, gás, gerenciamento de instalações), inventário, cadeia de suprimentos e soluções de transporte, cidades inteligentes, estradas inteligentes e aplicações de segurança remota estarão todas confiando em uma rede móvel em maor ou menor grau. Todas elas se beneficiarão da capacidade da computação de borda de mover cargas de trabalho para próximo do usuário final.
zh_cn: 2. 移动连接：在5G网络大规模普及前，移动网络仍保持着受限和不稳定的特性，因此移动/无线网络也可以看作是云边缘计算的常见环境要素。许多应用或多或少都依赖于移动网络，例如应用于远程修复的增强现实、远程医疗、捕捉公共设施（水力，煤气，电力，设施管理）数据的物联网设备、库存、供应链以及运输解决方案、智慧城市、智慧道路和远程安全保障应用。这些应用都受益于边缘计算就近端处理的能力。

source: 3. Network-as-a-Service (NaaS): Coming from the need to deliver an identical network service application experience in radically different environments, the NaaS use case requires both a small footprint of its distributed platform at the edges, and strong centralized management tools that cross over unreliable or limited WAN network connections in support of the services out on the edge. The main characteristics of this scenario are: small hardware footprint, moving (changing network connections) and constantly changing workloads, hybrid locations of data and applications. This is one of the cases that needs infrastructure to support micro nodes—small doses of compute in non-traditional packages (not all 19in rack in a cooled data center). NaaS will require support for thousands or tens of thousands of nodes at the edge and must support mesh and/or hierarchical architectures as well as on demand sites that might spin up as they are needed and shutdown when they are done. APIs and GUIs will have to change to reflect that large numbers of compute nodes will have different locations instead of being present in the same data center.
de: 3. Network-as-a-Service (NaaS): Aufgrund der Notwendigkeit, eine identische Netzwerkdienstanwendungserfahrung in radikal unterschiedlichen Umgebungen zu liefern, benötigt der NaaS-Anwendungsfall sowohl eine kleine Stellfläche seiner verteilten Plattform an den Rändern als auch eine starke zentrale Management-Tools, die unzuverlässige oder eingeschränkte WAN-Netzwerkverbindungen zur Unterstützung der Dienste auf der Kante überschreiten. Die Hauptmerkmale dieses Szenarios sind: kleiner Hardware-Footprint, Verschieben (Ändern von Netzwerkverbindungen) und sich ständig ändernde Arbeitslasten, hybride Standorte von Daten und Anwendungen. Dies ist einer der Fälle, in denen eine Infrastruktur zur Unterstützung von Mikroknoten benötigt wird - kleine Dosierungen von Daten in nicht-traditionellen Paketen (nicht alle 19-Zoll-Racks in einem gekühlten Datencenter). NaaS erfordert Unterstützung für Tausende oder Zehntausende von Knoten am Rand und muss Mesh- und / oder hierarchische Architekturen sowie On-Demand-Sites unterstützen, die bei Bedarf hochgefahren werden und heruntergefahren werden, wenn sie fertig sind. APIs und GUIs müssen geändert werden, um zu reflektieren, dass eine große Anzahl von Rechenknoten unterschiedliche Positionen hat, anstatt im selben Rechenzentrum vorhanden zu sein.
eo: 3. Reto-kiel-Servo (NaaS): Devenante de la bezono liveri identan sperton de retservo al aplikajo en radikale malsamaj medioj, la uzkazo de NaaS postulas kaj malgrandan spuron de sia platformo distribuita ĉe la randoj kaj fortaj centralizitaj mastrumaj iloj, kiuj transiras nefidindajn aŭ limigitajn retajn WAN-konektojn por subteni la servojn eksteren. La ĉefaj trajtoj de ĉi tiu scenaro estas: malgranda aparataro, movado (ŝanĝante retajn konektojn) kaj konstante ŝanĝantajn laborŝarĝojn, hibridaj lokoj de datumoj kaj aplikoj. Ĉi tiu estas unu el la kazoj, kiuj bezonas infrastrukturon por subteni mikronodojn--malgrandajn dozojn de komputado en ne-tradiciaj pakoj (ne ĉiu 19in rako en malvarmigita datumcentro). NaaS postulos subtenon por miloj aŭ dekoj da miloj da nodoj ĉe la rando kaj devas subteni maŝa reto kaj / aŭ hierarkiajn arkitekturojn tiel kiel laŭpetajn ejojn, kiuj povus starti laŭ neceseco kaj halti kiam ili estas preta. API kaj GUI devas ŝanĝi por tio, ke grandaj numeroj de komputilaj nodoj havas malsamajn lokojn anstataŭ esti ĉeestantaj en la sama datumcentro.
id: 3. Network-as-a-Service (NaaS): Datang dari kebutuhan untuk memberikan pengalaman aplikasi layanan jaringan yang identik di lingkungan yang sangat berbeda, kasus penggunaan NaaS memerlukan jejak kaki kecil (small footprint) dari platform terdistribusi di tepinya, dan . alat manajemen terpusat kuat yang melewati koneksi jaringan WAN yang tidak dapat diandalkan atau terbatas untuk mendukung layanan di tepi. Karakteristik utama dari skenario ini adalah: tapak perangkat keras kecil (small hardware footprint), bergerak (mengubah koneksi jaringan) dan terus-menerus mengubah beban kerja, lokasi hibrida data dan aplikasi. Ini adalah salah satu kasus yang membutuhkan infrastruktur untuk mendukung mikro node - dosis kecil (micro nodes—small doses) yang dihitung dalam paket non-tradisional (tidak semua 19in rack di pusat data yang didinginkan). NaaS akan membutuhkan dukungan untuk ribuan atau puluhan ribu node di tepi dan harus mendukung arsitektur jala dan / atau hirarki serta lokasi permintaan yang mungkin berputar sesuai kebutuhan dan shutdown saat selesai. API dan GUI harus berubah untuk mencerminkan bahwa sejumlah besar node komputasi akan memiliki lokasi yang berbeda daripada hadir di pusat data yang sama.
ja: 3. Network-as-a-Service (NaaS): 根本的に異なる環境における個別ネットワークサービスアプリケーションの提供ニーズから、NaaS のユースケースはエッジにおける分散プラットフォーム自身の小さなフットプリントと、エッジ外のサービスをサポートする信頼性に乏しく制限された WAN を管理する強力な集中管理ツールの両方が求められます。このシナリオの主要な特徴は、小さなハードウェア、移動 (これに伴いネットワーク接続が変化します) と恒常的なワークロードの変化、データとアプリケーションが混在することが挙げられます。マイクロノードをサポートするインフラへのニーズは、ケースの一つです。これは非伝統的な形でパッケージされた (冷房のあるデータセンター内にある19インチラックだけではありません) 少量のコンピュータです。NaaS はエッジにある数千から数万ノードをサポートすることが求められるでしょうし、メッシュや階層型アーキテクチャーのどちらか、あるいは双方を必ずサポートすることが求められるでしょう。さらに要求サイト上で必要なときに素早く起動し、終わればシャットダウンすることも求められます。API と GUI から同じデータセンター内でなく異なった場所に置かれている大規模なコンピュートノードの変更を反映する必要があるでしょう。
ko_kr: 3. Network-as-a-Service (NaaS): 근본적으로 다른 환경에서 동일한 네트워크 서비스 애플리케이션 경험을 제공할 필요성때문에 NaaS 사용 사례는 edge에 배포 플랫폼이 적고 신뢰할 수 없거나 제한된 WAN 네트워크 연결을 edge 서비스 외부에서 지원하는 강력한 중앙 관리 도구를 필요로합니다. 이 시나리오의 주요 특징은 소형 하드웨어 풋프린트, 이동 (네트워크 연결방법) 및 끊임없이 변화하는 워크로드, 데이터와 애플리케이션의 하이브리드 위치입니다. 이것은 마이크로 노드를 지원하는 인프라가 필요한 경우 중 하나입니다. 비 전통적 패키지 (대부분 냉각된 데이터 센터의 19인치 랙이 아님)에서 적은 양의 계산이 가능합니다. NaaS는 edge에서 수천 또는 수만 개의 노드에 대한 지원을 필요로하며 mesh나 계층적 아키텍처뿐만 아니라 필요에 따라 스핀업하고 완료될때 종료될 수 있는 주문형 사이트를 지원해야합니다. API와 GUI는 많은 수의 compute 노드가 동일한 데이터 센터에 존재하는 대신 다른 위치를 가질 것이라는 점을 반영하여 변경해야합니다.
pt_br: 3. Rede-como-um-Serviço (NaaS): Vindo da necessidade de entregar uma experiência de aplicação de serviço de rede idêntica em ambientes radicalmente diferentes, o caso de uso NaaS requer tanto uma pequena pegada de sua plataforma distribuída nas bordas, como ferramentas de gerenciamento fortemente centralizadas que atravessam conexões de rede WAN não confiáveis ou limitadas em apoio aos serviços fora da borda. As principais características desse cenário são: pegada pequena de hardware, movimentação (mudando as conexões de rede) e mudando constantemente as cargas de trabalho, localizações híbridas de dados e aplicações. Isso é um dos casos que necessitam de infraestrutura para suportar micro nós—pequenas doses de computação em pacotes não tradicionais (nem todos os racks de 19pol em um centro de dados resfriado). NaaS irá requerer suporte para milhares ou dezenas de milhares de nós de borda e deve suportar arquiteturas de malhas e/ou hierárquicas, bem como sites sob demanda que possam subir quando necessário e desligar quando estiverem concluídos. APIs e GUIs terão que mudar para refletir que esses grandes números de nós de computação terão diferentes locais em vez de estarem presentes no mesmo centro de dados.
zh_cn: 3. Network-as-a-Service （网络即服务）：由于需要在各异环境中提供特定的网络服务应用经验，NaaS用例不仅只能占用位于边缘上小部分的分布式平台，而且需要强大的，可跨接不稳定或受限WAN网络的集中式管理工具来支持外围边缘侧的服务。该场景的主要特征包括：硬件资源占用量小，移动（更改网络连接）及频繁更替工作，数据和应用混合安置。这也是基础平台需要支持微型节点（在非传统包（冷却数据中心内不都是19英寸机架）内进行少量计算）的案例之一。NaaS需要由上千或上万个边缘侧节点支持。同时，它还必须支持网状和/或层次式结构以及按需响应的站点（可能在需要时进行运转而在完成后关闭）。APIs和GUIs将会不断变化来映射安置于不同位置而非是同一数据中心内的大量计算节点。

source: 4. Universal Customer Premises Equipment (uCPE): This scenario, already being deployed today, demands support for appliance-sized hardware footprints and is characterized by limited network connections with generally stable workloads requiring high availability. It also requires a method of supporting hybrid locations of data and applications across hundreds or thousands of nodes and scaling existing uCPE deployments will be an emerging requirement.
de: 4. Universal Customer Premises Equipment (uCPE): Dieses Szenario, das bereits heute eingesetzt wird, erfordert Unterstützung für Hardware-Footprints im Appliance-Umfang und zeichnet sich durch begrenzte Netzwerkverbindungen mit im Allgemeinen stabilen Workloads aus, die eine hohe Verfügbarkeit erfordern. Es erfordert auch eine Methode zur Unterstützung hybrider Speicherorte von Daten und Anwendungen über Hunderte oder Tausende von Knoten hinweg, und die Skalierung bestehender uCPE-Bereitstellungen wird eine neue Anforderung sein.
eo: 4. Universala Klienta Loka Ekipaĵo (uCPE): Ĉi tiu scenaro, kiu jam estas disponigita hodiaŭ, postulas subtenon por aplikajo-skalitaj aparataraj ampleksojn, kaj estas karakterizita per limigitaj retaj konektoj kun ĝenerale stabilaj laborŝarĝoj, kiuj bezonas altan disponon. Ĝi ankaŭ postulas metodon de subtenado de hibridaj lokoj de datumoj kaj aplikoj trans centoj aŭ miloj da nodoj kaj skalado de ekzistantaj uCPE-disponigoj estos emerĝa postulo.
id: 4. Universal Customer Premises Equipment (uCPE): Skenario ini, yang telah digunakan hari ini, menuntut dukungan untuk jejak perangkat keras seukuran alat dan ditandai oleh koneksi jaringan yang terbatas dengan beban kerja yang umumnya stabil yang membutuhkan ketersediaan tinggi. Ini juga memerlukan metode untuk mendukung lokasi hibrida data dan aplikasi di ratusan atau ribuan simpul dan penskalaan penempatan uCPE yang ada akan menjadi persyaratan yang muncul.
ja: 4. Universal Customer Premises Equipment (uCPE): このシナリオは、今日既に開発されていますが、アプライアンス程度の大きさをしたハードウェアのためにサポートが求められ、高可用性が求められる定常的に安定したワークロードが乗る制約付きのネットワーク接続によって性格づけられます。そして数百から数千のノードにまたがってデータとアプリケーションが混在することをサポートすることも必要ですし、既存の uCPE デプロイメントにスケールすることも新たに必要となるでしょう。
ko_kr: 4. Universal Customer Premises Equipment (uCPE): 이 시나리오는 이미 배포되고 있으며 어플라이언스 크기의 하드웨어 풋프린트에 대한 지원이 필요하고, 높은 가용성이 요구되는 일반적이고 안정적인 워크로드로 제한된 네트워크 연결이 특징입니다. 또한 수백 또는 수천 개의 노드에서 데이터와 애플리케이션의 하이브리드 위치를 지원하는 방법이 필요하며 기존 uCPE 배포를 확장하는 것이 새로운 요구 사항이 될 것입니다.
pt_br: 4. Equipamentos Locais Universais para Clientes (uCPE): Esse cenário, já sendo implementado atualmente, exige suporte para pegada de hardware do tamanho do appliance e é caracterizado pelas conexões de rede limitadas com cargas de trabalho geralmente estáveis que requerem alta disponibilidade. Isso também requer um método para suportar localizações híbridas de dados e aplicações atravessando centenas ou milhares de nós e a expansão das implementações de uCPE existentes será um requisito emergente.
zh_cn: 4. 通用用户驻地设备（uCPE）:该场景现已部署完成，需要占用产品大小的硬件资源。其特点为：网络连接有限，工作量较为稳定但需确保可用性高。于此同时，它也需要一种方法来支持跨上百至上千节点的数据应用混合安置，而拓展现有uCPE部署也将成为一项新要求。

source: This is particularly applicable to NFV applications where different sites might need a different set of service chained applications, or sites with a different set of required applications that still need to work in concert. Mesh or hierarchical architectures would need to be supported with localized capacity and the need to store and forward data processing due to intermittent network connections. Self-healing and self-administration combined with the ability to remotely administer the node are musts.
de: Dies gilt insbesondere für NFV-Anwendungen, bei denen unterschiedliche Sites möglicherweise eine andere Gruppe von Anwendungen mit Service-Ketten erfordern oder Sites mit anderen erforderlichen Anwendungen, die noch zusammenarbeiten müssen. Netz- oder hierarchische Architekturen müssen mit lokalisierter Kapazität und der Notwendigkeit, Datenverarbeitung aufgrund von intermittierenden Netzwerkverbindungen zu speichern und weiterzuleiten, unterstützt werden. Selbstheilung und Selbstverwaltung kombiniert mit der Fähigkeit, den Knoten fern zu verwalten, sind ein Muss.
eo: Ĉi tio estas aparte aplikebla al la NFV-aplikoj, kie malsamaj ejoj eble bezonos malsamajn servo-ĉenitajn aplikajojn, aŭ ejoj kun alia aro de postulataj aplikoj, kiuj ankoraŭ bezonas labori kune. Maŝa reto aŭ hierarkiaj arkitekturoj devus esti subtenataj kun lokigita kapacito kaj la bezono stoki kaj antaŭenigi datumprogramadon pro intermitaj retaj rilatoj. Mem-resanigo kaj memregado kombinita kun la kapablo administri defore la nodon estas deviga.
id: Hal ini terutama berlaku untuk aplikasi NFV di mana berbagai situs mungkin memerlukan serangkaian aplikasi layanan yang dirantai, atau situs dengan serangkaian aplikasi lain yang diperlukan yang masih perlu dilakukan dalam konser. Arsitektur hierarkis atau Mesh perlu didukung dengan kapasitas lokal dan kebutuhan untuk menyimpan dan meneruskan pemrosesan data karena koneksi jaringan terputus-putus. Self-healing dan self-administration dikombinasikan dengan kemampuan untuk mengelola simpul dari jarak jauh adalah keharusan.
ja: これは特に、サービス連携アプリケーションの異なる組合せが求められる異なったサイトや、協調動作するアプリケーションの異なる組合せが求められるサイト上で稼働する NFV アプリケーションに適用できます。メッシュや階層型アーキテクチャーは、断続的なネットワーク接続のためにローカライズされた機能と、データ処理の格納と転送を行う必要があります。自己修復と自己管理は、ノードの遠隔制御とともに必要となります。
ko_kr: 이는 여러 사이트에서 서로 다른 일련의 서비스 체인 애플리케이션이 필요하거나 필요한 여러 애플리케이션 집합이 필요한 사이트에서는 여전히 NFV 애플리케이션에 적용될 수 있습니다. Mesh나 계층적 아키텍처는 지역화된 용량과 간헐적인 네트워크 연결로인해 테이터 처리를 저장하고 전달해야하는 필요성으로 지원되어야합니다. 노드를 원격으로 관리할 수 있는 능력과 결합된 자체 치유와 자체 관리가 필수입니다.
pt_br: Isso é particularmente aplicável para aplicações NFV onde diferentes sites poderiam precisar de diferentes conjuntos de aplicações em cadeia ou sites com um conjunto diferente de aplicações requeridas que ainda precisa trabalhar em união. Arquitetura de malha ou hierárquica precisaria ser suportada com capacidade localizada e a necessidade para armazenar e encaminhar o processamento de dados devido as conexões de rede intermitentes. Auto cura e autoadministração combinadas com a habilidade para administrar remotamente um nó são necessárias.
zh_cn: 而这点非常适用于NFV应用，尤其当不同站点可能需要不同系列的服务链应用，或是区域内一系列不同的应用需要统一协作时。由于本地资源的利用以及必须满足在间断的网络连接下进行存储和进行数据处理，我们可需要支持网状或层次式的结构。自我修复以及与远程节点管理相结合的自我管理都是必须条件。
