Repository: amotoki/edge-computing-whitepaper
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, eo, id, ja, ko_kr, pt_br, zh_cn

source: The “edge” in edge computing refers to the outskirts of an administrative domain, as close as possible to discrete data sources or end users. This concept applies to telecom networks, to large enterprises with distributed points of presence such as retail, or to other applications, in particular in the context of IoT.
de: Der "Edge" im Edge Computing bezieht sich auf die Randbereiche einer Verwaltungsdomäne, möglichst nahe bei diskreten Datenquellen oder Endbenutzern. Dieses Konzept gilt für Telekommunikationsnetze, für große Unternehmen mit verteilten Standorten wie dem Einzelhandel oder für andere Anwendungen, insbesondere im Zusammenhang mit IoT.
eo: La “rando” en randa komputiko plu-gvidas al la ekstero de administracia domajno, tiel malproksima kiel ebla al discretaj datumaj fontoj aŭ finaj uzantoj. Ĉi tiu koncepto aplikas al telekom retoj, al grandaj entreprenoj kun distribuitajn punktojn de ĉeesto kiel podetala aŭ al aliaj aplikoj, aparte en la kunteksto de IoT.
id: “Edge” di komputasi tepi (edge computing) mengacu pada pinggiran (outskirt) domain administratif, sedekat mungkin dengan sumber data diskrit atau pengguna akhir. Konsep ini berlaku untuk jaringan telekomunikasi, untuk perusahaan besar dengan titik yang ada terdistribusi seperti ritel, atau aplikasi lainnya, khususnya dalam konteks IoT.
ja: エッジコンピューティングにおける「エッジ」とは、分散されたデータ源やエンドユーザーに可能な限り近い、管理ドメインの外の領域を示します。このコンセプトは通信事業者のネットワークや、小売業のような分散した出張所を抱える大規模エンタープライズ、もしくはその他の、特に IoT の文脈で語られるアプリケーションに当てはまります。
ko_kr: Edge computing에서 "edge"는 관리 도메인 외곽에 있는 개별 데이터 리소스와 최종 사용자를 최대한 가까운 것을 가리킵니다. 이 개념은 통신 네트워크, 소매점과 같이 분산된 POP(point of presence)가 있는 대기업, IoT와 관련된 응용 프로그램에 적용됩니다.
pt_br: O "edge" em edge computing refere-se aos arredores de um domínio administrativo, o mais próximo possível de fontes de dados discretas ou dos usuários finais. Esse conceito se aplica a redes de telecomunicações, grandes companhias com pontos de presença distribuídos como o varejo, ou para outras aplicações, em particular, no contexto da Internet das Coisas.
zh_cn: 边缘计算的边缘指的是位于管理域的边缘，尽可能地靠近数据源或用户。这个概念同样适用于运营商网络、有众多分支机构的大企业，如零售，或者是与IoT相关的其他应用。

source: One of the characteristics of edge computing is that the application is strongly associated with the edge location. For telecoms, “the edge” would refer to a point close to the end user but controlled by the provider, potentially having some elements of workloads running on end user devices. For large enterprises, “the edge” is the point where the application, service or workload is used (e.g. a retail store or a factory). For the purposes of this definition, the edge is not an end device with extremely limited capacity for supporting even a minimal cloud architecture, such as an IoT or sensor device. This is an important consideration, because many discussions of edge computing do not make that distinction.
de: Eine der Eigenschaften von Edge Computing besteht darin, dass die Anwendung stark mit der Kantenposition verknüpft ist. Bei Telekommunikationsdiensten würde sich "der Rand" auf einen Punkt in der Nähe des Endbenutzers beziehen, der jedoch vom Anbieter kontrolliert wird und möglicherweise einige Elemente von Workloads auf Endbenutzergeräten ausführen kann. Für große Unternehmen ist "der Rand" der Punkt, an dem die Anwendung, der Dienst oder die Arbeitslast verwendet wird (z. B. ein Einzelhandelsgeschäft oder eine Fabrik). Für die Zwecke dieser Definition ist die Kante kein Endgerät mit extrem begrenzter Kapazität zum Unterstützen selbst einer minimalen Cloud-Architektur, wie etwa eines IoT oder einer Sensorvorrichtung. Dies ist eine wichtige Überlegung, da viele Diskussionen über Edge Computing diese Unterscheidung nicht machen.
eo: Unu el la karakterizaĵoj de randa komputiko estas ke la apliko estas forte asociita kun la randa loko. Por telekoms, “la rando” plu-gvidus al punkto proksime al la fina uzanto sed regadita de la provizanto, potenciale havanta kelkajn elementojn de laborŝarĝo kuradi sur finuzanto aparatoj. Por grandaj entreprenoj, “la rando” estas la punkto kie la apliko, servo aŭ laborŝarĝo estas uzita (ekz. podetala vendejo aŭ fabriko). Por la celoj de ĉi tiu difino, la rando ne estas fina aparatilo kun ekstreme limigita kapaciton por subteni eĉ minimuma nuba arkitekturo, kiel IoT aŭ sentila aparato. Tio ĉi estas grava konsidero, ĉar multaj diskutoj de randa komputiko ne faras tiun distingon.
id: Salah satu karakteristik komputasi tepi (edge computing) adalah aplikasi sangat terkait dengan lokasi tepi. Untuk telekomunikasi, “the edge” akan merujuk ke titik yang dekat dengan pengguna akhir namun dikendalikan oleh penyedia, berpotensi memiliki beberapa elemen beban kerja yang berjalan pada perangkat pengguna akhir. Untuk perusahaan besar, “the edge” adalah titik di mana aplikasi, layanan atau beban kerja digunakan (misalnya toko ritel atau pabrik). Untuk tujuan definisi ini, tepi bukanlah perangkat akhir dengan kapasitas yang sangat terbatas untuk mendukung bahkan arsitektur awan minimal, seperti perangkat IoT atau sensor. Ini adalah pertimbangan penting, karena banyak diskusi tentang komputasi tepi tidak membuat perbedaan itu.
ja: エッジコンピューティングの特徴の一つに、アプリケーションはエッジの位置に強く結びついているということがあります。通信事業者にとって「エッジ」とは、エンドユーザーに近くありつつもプロバイダーが制御できる場所を示すでしょうし、潜在的にはエンドユーザーの持つ機器上で動作するワークロードという要素も含むでしょう。大規模エンタープライズにとっては、アプリケーションやサービスまたはワークロードが利用される場所 (例として小売店や工場) のことを示します。この定義の目的からいうと、 IoT やセンサー機器のように、最小のクラウドアーキテクチャーをサポートするためだけに極端に能力を制限された終端機器はエッジではありません。エッジコンピューティングに絡む議論の多くが、この差異を明確にしていないため、このことは熟慮すべき事項です。
ko_kr: Edge computing의 특징 중 하나는 애플리케이션이 edge 위치와 밀접하게 관련되어 있다는 것입니다. 통신 회사에서의 "edge"는 최종 사용자와 가까운 지점을 가리키고 공급자에 의해 제어되며, 잠재적으로 최종 사용자 장치에서 실행되는 워크로드가 있는 요소를 나타냅니다. 대기업에서의 "edge"는 애플리케이션, 서비스, 워크로드(예로 소매점이나 공장)을 나타냅니다. 이 정의에서 edge 는 IoT나 센서 장치와 같은 최소한의 클라우드 아키텍처조차도 지원할 수 있는 용량이 극히 제한된 최종 장치를 나타내는 것은 아닙니다. Edge computing에 대한 많은 논의가 그 차이를 나타내지 않기 때문에 이는 중요한 고려사항 중 하나입니다.
pt_br: Uma das características do edge computing é que a aplicação é fortemente associada com a localização da borda. Para telecomunicações, "the edge" deveria referir-se ao ponto próximo ao usuário final mas controlado pelo provedor, potencialmente tendo alguns elementos de cargas de trabalho em execução nos dispositivos dos usuários finais. Para grandes companhias, "the edge" é o ponto onde a aplicação, serviço ou força de trabalho é usado (uma loja de varejo ou uma fábrica). Para os propósitos dessa definição, "the edge" não é um dispositivo final com capacidade extremamente limitada para suportar até mesmo uma arquitetura mínima de nuvem, como um dispositivo IoT ou de monitoramento. Essa é uma consideração importante, porque algumas discussões sobre edge computing não fazem essa distinção.
zh_cn: 边缘计算的一个特点是应用与边缘的位置紧密相关。对于运营商来说，边缘指一个位置靠近用户但是却由供应商控制，潜在地在用户的设备上运行着不同种类的计算任务。对于大型企业来说，边缘指一个应用程序、服务和工作任务正在运行的位置（如，零售商店或者工厂）。对于这个定义而言，边缘不是指那些支持能够支持最小化云架构并资源有限的终端设备，如IoT或者传感设备。这是一个非常重要的考虑因素，因为很多针对边缘计算的讨论并不如此区分。

source: Edge computing is similar to data center computing in that:
de: Edge Computing ähnelt der Datencenter-Datenverarbeitung:
eo: Randa komputiko estas simila al datuma centro komputiko en tio:
id: Komputasi tepi (edge computing) mirip dengan komputasi data center dalam hal:
ja: 以下のような点でエッジコンピューティングは、データセンターコンピューティングと類似しています。
ko_kr: Edge computing은 다음과 같은 점에서 데이터 센터 computing과 유사합니다:
pt_br: Edge computing é similar a data center computing no seguinte:
zh_cn: 边缘计算与数据中心在如下几个方面是相似的：

source: * It includes compute, storage and networking resources.
de: * Es enthält Rechen-, Speicher- und Netzwerkressourcen.
eo: * Ĝi inkluzivas komputa, memorila kaj interkonektanta rimedojn.
id: * Ini termasuk komputasi, penyimpanan dan sumber daya jaringan.
ja: * エッジコンピューティングは、コンピュート、ストレージそしてネットワークといった資源を含みます。
ko_kr: * Compute, 스토리지, 네트워크 리소스를 포함합니다.
pt_br: * Ela inclui recursos de computação, armazenamento e rede.
zh_cn: * 都包含计算、存储和网络资源

source: * Its resources may be shared by many users and many applications.
de: * Ihre Ressourcen können von vielen Benutzern und vielen Anwendungen gemeinsam genutzt werden.
eo: * Ties rimedoj povas esti kunhavigita de multaj uzantoj kaj multaj aplikoj.
id: * Sumbernya bisa dibagi oleh banyak pengguna dan banyak aplikasi.
ja: * エッジコンピューティングの資源は、多くのユーザーやアプリケーションに共有されるかもしれません。
ko_kr: * 리소스는 많은 사용자와 많은 애플리케이션에서 공유하여 사용할 수 있습니다.
pt_br: * Seus recursos podem ser compartilhados por vários usuários e várias aplicações.
zh_cn: * 这些资源都可以被多个用户和应用程序共享

source: * It benefits from virtualization and abstraction of the resource pool.
de: * Es profitiert von der Virtualisierung und Abstraktion des Ressourcenpools.
eo: * Ĝi profitigas de virtualigo kaj abstrakto de la risurco komunaĵo.
id: * Ini manfaatkan virtualisasi dan abstraksi dari kolam sumber daya (resource pool).
ja: * エッジコンピューティングの恩恵は、資源プールの仮想化や抽象化により生み出されます。
ko_kr: * 리소스 풀에 대한 가상화와 추상화로 인한 좋은 점이 있습니다.
pt_br: * Ela se beneficia da virtualização e da abstração do pool de recursos.
zh_cn: * 都收益于虚拟化技术和资源池的抽象

source: * It benefits from the ability to leverage commodity hardware.
de: * Es profitiert von der Möglichkeit, Standardhardware zu nutzen.
eo: * Ĝi profitigas de la kapableco ekspluati komercaĵan aparataron.
id: * Ini manfaatkan kemampuan untuk meningkatkan perangkat keras komoditas.
ja: * エッジコンピューティングの恩恵は、コモディティーハードウェアを利用する能力により生み出されます。
ko_kr: * 상용 하드웨어를 활용할 수 있는 좋은 점이 있습니다.
pt_br: * Ela se beneficia da capacidade de alavancar hardware de commodities.
zh_cn: * 都收益于能够利用白牌硬件的能力

source: * It uses APIs to support interoperability.
de: * Es verwendet APIs zur Unterstützung der Interoperabilität.
eo: * Ĝi uzas APIs por subteni kunfunkcipovo.
id: * Menggunakan API untuk mendukung interoperabilitas.
ja: * エッジコンピューティングは、相互運用性をサポートするため API を利用します。
ko_kr: * 상호 운용성을 지원하기 위한 API를 지원합니다.
pt_br: * Utiliza APIs para suportar interoperabilidade.
zh_cn: * 都能够通过API来支持互操作性

source: Edge computing differs from computing in large data centers in that:
de: Edge Computing unterscheidet sich von der Datenverarbeitung in großen Rechenzentren dadurch, dass
eo: Randa komputiko malsamas de komputado en grandaj datumo centroj en tio:
id: Komputasi tepi (edge computing) berbeda dari komputasi di pusat data yang besar:
ja: エッジコンピューティングは、大規模データセンターのコンピューティングと次のような違いがあります。
ko_kr: Edge computing과 큰 데이터 센터에서의 computing의 다른점은 다음과 같습니다:
pt_br: Edge computing se diferencia de computação em grandes centros de dados no seguinte:
zh_cn: 边缘计算与大规模数据中的区别在于：

source: * Edge sites are as close as possible to end users. They improve the experience over high latency and unreliable connections.
de: * Edge-Sites sind so nah wie möglich an die Endbenutzer. Sie verbessern die Erfahrung bei hohen Latenzzeiten und unzuverlässigen Verbindungen.
eo: * Randaj ejoj estas tiel proksime kiel ebla al la finuzantojn. Ili plibonigas la sperton super alta atendotempo kaj nefidindaj konektoj.
id: * Situs tepi (edge site) sedekat mungkin dengan pengguna akhir. Mereka memperbaiki pengalaman melalui latensi tinggi dan koneksi yang tidak dapat diandalkan.
ja: * エッジサイトは、可能な限りエンドユーザーに近づけます。これにより、高い遅延や信頼できないコネクションを克服し、ユーザー体験を改善します。
ko_kr: * Edge 사이트는 가능한한 최종 사용자와 가장 가깝습니다. 높은 레이턴시와 신뢰할 수 없는 연결을 통해 서비스 경험을 향상 시킵니다.
pt_br: * Sites de borda estão o mais próximo possível dos usuários finais. Eles melhoram a experiência em alta latência e conexões instáveis.
zh_cn: * 边缘节点尽可能地靠近最终用户，能够提高在高延时和不可靠连接下的用户体验。

source: * May require specialized hardware, such as GPU/FPGA platforms for AR/VR functionality.
de: * Benötigt möglicherweise spezielle Hardware, z. B. GPU / FPGA-Plattformen für AR/VR-Funktionalität.
eo: * Povus postuli specialigita aparataron, kiel GPU/FPGA platformoj por AR/VR funkcio.
id: * Mungkin memerlukan perangkat keras khusus, seperti platform GPU/FPGA untuk fungsi AR/VR.
ja: * AR/VR 機能用の GPU/FPGA プラットフォームのように、特別なハードウェアが必要かもしれません。
ko_kr: * AR/VR 기능을 위한 GPU/FPGA 플랫 폼과 같은 특수 하드웨어가 필요할 수 있습니다.
pt_br: * Pode requerer hardware especializado, tal como GPU/FPGA plataformas para funcionalidade RA/RV.
zh_cn: * 边缘计算也许需要特殊的硬件，如GPU/FPGA平台来提供增强现实和虚拟现实的功能。

source: * Edge can scale to large numbers of sites, distributed in distinct locations.
de: * Edge kann auf eine große Anzahl von Sites skaliert werden, die an verschiedenen Orten verteilt sind.
eo: * Rando povas skali al grandaj nombroj de ejoj, distribuita en distingaj lokoj.
id: * Edge bisa berskala ke sejumlah besar situs, didistribusikan di lokasi yang berbeda.
ja: * エッジは、異なる位置に分散された多数のサイトへ拡張することが出来ます。
ko_kr: * Edge는 서로 다른 위치에 분산되어 있는 수많은 사이트로 확장이 가능합니다.
pt_br: * Edge pode escalar para um grande número de sites, distribuídos em localidades distintas.
zh_cn: * 边缘计算能够扩展至非常多的站点，分布在各个不同的地点。

source: * An edge site’s location and the identity of the access links it terminates are significant. An application that needs to run close to its users, needs to be in the right part of the edge. It is common for the application location to matter in edge computing.
de: * Der Standort einer Edge-Site und die Identität der Access-Links, die sie beendet, sind signifikant. Eine Anwendung, die in der Nähe ihrer Benutzer ausgeführt werden muss, muss sich im rechten Teil der Kante befinden. Es ist üblich, dass der Anwendungsort bei Edge Computing eine Rolle spielt.
eo: * La loko de rando ejo kaj la identeco de la aliraj ligoj ĝi akceptas estas grava. Apliko kiu devas kuri proksiman al ties uzantoj, bezonas esti en la ĝusta parto de la rando. Estas normala ke la aplikaĵa loko gravas en randa komputiko.
id: * Lokasi situs tepi (edge site’s location) dan identitas tautan akses yang diakhiri sangat penting. Aplikasi yang perlu dijalankan dekat dengan penggunanya, perlu berada di bagian tepi (edge) yang cocok. Sudah umum untuk lokasi aplikasi menjadi masalah dalam komputasi tepi (edge computing).
ja: * エッジサイトの場所と、終端アクセスリンクの同一性は重要です。ユーザーの近くで実行すべきアプリケーションは、エッジの確かな場所に存在すべきです。これは、エッジコンピューティングにおけるアプリケーション配置の共通課題です。
ko_kr: * Edge 사이트 위치와 접속 링크의 인증을 종료하는 것이 중요합니다. 사용자 가까이에서 실행해야 하는 응용 프로그램은 edge의 오른쪽에 있어야 합니다. 응용 프로그램 위치는 edge computing에서 중요합니다.
pt_br: * Uma localização de um site de borda e a identidade dos links de acesso que ele termina são significantes. Uma aplicação que precisa rodar próxima ao seu usuário, precisa estar na parte certa da borda. É comum que a localização da aplicação seja importante na edge computing.
zh_cn: * 一个边缘站点的位置和它的访问认证链接是非常重要的。一个需要靠近在用户端运行的应用程序，需要处于正确的边缘部分。对于边缘计算来讲，应用程序位置的重要性是通用的。

source: * The entire pool of sites can be considered to be dynamic. Because of their physical separation, edge sites will, in some cases, be connected to each other and the core with WAN connections. Edge sites will join and leave the pool of infrastructure over time.
de: * Der gesamte Pool von Websites kann als dynamisch angesehen werden. Aufgrund ihrer physischen Trennung werden Edge-Sites in einigen Fällen miteinander und der Core mit WAN-Verbindungen verbunden sein. Edge-Sites werden dem Infrastrukturpool im Laufe der Zeit beitreten und ihn verlassen.
eo: * La tuta komunaĵo de ejoj povas esti konsiderita dinamika. Pro ilia fizika apartigo, randaj ejoj estas, en kelkaj kazoj, konektita al ĉiu alia kaj la kerno kun WAN konektoj. Randaj ejoj aliĝos kaj forlasas la komunaĵo de infrastrukturo dum kelka tempo.
id: * Seluruh kolam situs (pool of site) bisa dianggap dinamis. Karena pemisahan fisik mereka, situs tepi (edge site) akan, dalam beberapa kasus, saling terhubung satu sama lain dan inti dengan koneksi WAN. Situs tepi akan bergabung dan meninggalkan kolam infrastruktur dari waktu ke waktu.
ja: * サイトの全体プールは動的に考慮されるべきです。サイトの物理的な隔離のため、エッジサイトは往々にして互いが接続され、また WAN 接続によりコアと接続されるでしょう。エッジサイトは、インフラストラクチャープールに何度も参加したり、離脱したりするでしょう。
ko_kr: * 사이트의 전체 풀은 동적인 것으로 간주될 수 있습니다. 물리적으로 분리된 edge 사이트는 경우에 따라 WAN 연결로 코어와 다른것들이 서로 연결됩니다. Edge 사이트는 시간이 지남에 따라 인프라 풀에 추가되고 빠집니다.
pt_br: * O pool inteiro de sites pode ser considerado dinâmico. Devido às suas separações físicas, sites de borda serão, em alguns casos, conectados uns aos outros e ao núcleo com conexões WAN. Sites de borda entrarão e sairão do pool de infraestrutura ao longo do tempo.
zh_cn: * 多站点的所有资源池都应该是动态的。因为站点之间的物理隔离，边缘站点应该能够在某种程度上相互连接，并且能够通过广域网与核心相连。边缘站点会随时加入或离开整个基础设施资源池。

source: * Edge sites are remote and potentially unmanned, and therefore must be administered remotely. Tools need to support intermittent network access to the site.
de: * Edge-Sites sind remote und potenziell unbemannt und müssen daher remote verwaltet werden. Tools müssen den intermittierenden Netzwerkzugriff auf die Site unterstützen.
eo: * Randaj ejoj estas izolita kaj potenciale senpilota kaj sekve devas esti administrita defore. Iloj devas subteni intermitan retaliron al la ejo.
id: Situs tepi (edge site) jauh dan berpotensi tak berawak, dan karenanya harus dikelola dari jarak jauh. Alat perlu mendukung akses jaringan intermiten ke situs.
ja: * エッジサイトは遠隔地にあり、潜在的に遠隔操作される可能性があります。それ故に遠隔管理されるべきです。
ko_kr: * Edge 사이트는 원격으로 제어되며 잠재적으로 자동화된 상태이기에 원격 관리가 필요합니다. 도구는 사이트에 대한 주기적인 네트워크 액서스를 지원해야 합니다.
pt_br: * Os sites de borda são remotos e potencialmente não tripulados, e portanto devem ser administrados remotamente. As ferramentas precisam suportar o acesso de rede intermitente ao site.
zh_cn: * 边缘站点一般是处于远端并且潜在地无法被操纵，因此边缘站点必须能够被远程管理。相关工具必须能够支持通过不可靠网络来访问边缘站点。

source: * Edge supports large differences in site size and scale, from data center scale down to a single device.
de: * Edge unterstützt große Unterschiede in der Site-Größe und Skalierung, von der Datencenter-Skalierung bis hin zu einem einzelnen Gerät.
eo: * Rando subtenas grandajn diferencojn en eja grandeco kaj skalo, de datuma centro skalo malsupren al ununura aparato.
id: * Edge mendukung perbedaan besar dalam ukuran dan skala situs, mulai dari skala pusat data hingga satu perangkat.
ja: * エッジは、データセンターほどの大きさから 1 台の装置に至るまで、サイトの大きさやスケールの多様性をサポートします。
ko_kr: * Edge는 데이터 센터 규모에서 단일 장치까지인 사이트 크기와 규모에 대한 큰 차이를 지원합니다.
pt_br: * Edge computing suporta grandes diferenças no tamanho e escala do site, desde a escala do centro de dados até um único dispositivo.
zh_cn: * 边缘计算应该支持巨大的差异性，如不同大小和规模的站点、大规模的数据中心或者是单个设备

source: * Edge sites may be resource constrained; adding capacity to an existing site is restricted due to space or power requirements.
de: * Edge-Sites können Ressourcenbeschränkungen aufweisen. Das Hinzufügen von Kapazität zu einer vorhandenen Site ist aufgrund von Platz- oder Leistungsanforderungen eingeschränkt.
eo: * Randaj ejoj povas esti risurco limigita; aldoni kapaciton al ekzistanta ejo estas restriktita pro spaco aŭ elektraj postuloj.
id: * Situs tepi (edge site)mungkin dibatasi sumber daya; menambahkan kapasitas ke situs yang ada dibatasi karena persyaratan ruang atau daya.
ja: * エッジサイトは、資源の制限を受けるかもしれません。既設サイトへの容量追加は、スペースや電力の要件により制約を受けます。
ko_kr: * Edge 사이트는 리소스가 제한될 수 있습니다. 공간 또는 전력 필요 요건때문에 기존 사이트에 용량을 추가하는 것이 제한됩니다.
pt_br: * Sites de borda podem ter limitações de recursos; A adição de capacidade a um site existente é restrita devido a requisitos de energia ou espaço.
zh_cn: * 边缘站点往往是资源受限的；这是因为空间或电源的限制导致不能随意往站点里面添加资源

source: * Multi-tenancy on a massive scale is required for some of the use cases.
de: * Für einige Anwendungsfälle ist eine massenhafte Mandantenfähigkeit erforderlich.
eo: * Mult-tenanteco je masiva skalo estas postulita por kelkaj de la uzokazoj.
id: * Multi-tenancy dalam skala besar diperlukan untuk beberapa kasus penggunaan.
ja: * ユースケースによっては、特大の規模におけるマルチテナンシーも求められます。
ko_kr: * 대용량의 멀티 테넌시는 일부 유스 케이스에 필요합니다.
pt_br: * Multi-tenancy em escala massiva é requerida para alguns casos de uso.
zh_cn: * 一些用户场景需要能够在大规模的情况下实现多租户的功能

source: * Isolation of edge computing from data center clouds may be required to ensure that compromises in the “external cloud” domain cannot impact services.
de: * Die Isolierung von Edge-Computing von Datencenter-Clouds kann erforderlich sein, um sicherzustellen, dass sich Kompromisse in der Domäne "externe Cloud" nicht auf Services auswirken.
eo: * Izoleco de randa komputiko de datuma centro nuboj povas esti postulita por certigi ke kompromisoj en la “ekstera nubo” domajno ne povas efiki servoj.
id: * Isolasi komputasi tepi (edge computing) dari awan data center mungkin diperlukan untuk memastikan bahwa kompromi di domain “external cloud” tidak dapat mempengaruhi layanan.
ja: * データセンタークラウドからエッジコンピューティングを隔離することは、「外部クラウド」がセキュリティー侵害を受けたときも、サービス影響を出さないことを確実にするために必要となるかもしれません。
ko_kr: * "External cloud" 도메인에서의 위험이 서비스에 영향을 미치지 않도록 데이터 센터 클라우드에서 edge computing을 격리해야합니다.
pt_br: * O isolamento da edge computing das nuvens de centros de dados pode ser necessário para garantir que os compromissos no domínio da "nuvem externa" não possam impactar os serviços.
zh_cn: * 边缘计算与云数据中心的隔离需要通过保证“外部云”不能影响边缘计算的相关服务

source: The concept of edge computing must cover both the edge site (e.g. the compute, network and storage infrastructure), but also the applications (workloads) that run on it. It is worth noting that any applications in an edge computing environment could potentially leverage any or all of the capabilities provided by a cloud—compute, block storage, object storage, virtual networking, bare metal, or containers.
de: Das Konzept des Edge Computing muss sowohl die Edge-Site (z. B. die Computing-, Netzwerk- und Speicherinfrastruktur) als auch die Anwendungen (Workloads), die darauf ausgeführt werden, abdecken. Es ist erwähnenswert, dass alle Anwendungen in einer Edge-Computing-Umgebung potenziell alle oder einige der Funktionen nutzen können, die von Cloud Computing, Blockspeicher, Objektspeicher, virtuellem Netzwerk, Bare-Metal-Systemen oder Containern bereitgestellt werden.
eo: La koncepto de randa komputiko devas kovri ambaŭ la randa ejo (ekz. la komputa, reta kaj memortenada infrastrukturo), sed ankaŭ la aplikoj (laborŝarĝo) kiuj kuras sur ĝi. Valoras noti ke ajnaj aplikoj en rando komputanta medion potenciale povus ekspluati iun ajn aŭ ĉiujn de la kapabloj provizita de nubo—komputa, blokmemora, objektmemora, virtuala interkonekto, aparatoj aŭ konteneroj.
id: Konsep komputasi tepi (edge computing) harus mencakup situs tepi (edge site) (mis., komputasi, jaringan dan infrastruktur penyimpanan), namun juga aplikasi (workload) yang berjalan di atasnya. Perlu dicatat bahwa setiap aplikasi di lingkungan komputasi tepi berpotensi memanfaatkan semua atau semua kemampuan yang disediakan oleh komputasi awan, penyimpanan blok, penyimpanan objek, jaringan virtual, logam nyata (bare metal), atau kontainer.
ja: エッジコンピューティングのコンセプトは、エッジサイト (例としてコンピュート、ネットワークやストレージのインフラストラクチャー) だけでなく、エッジサイト上で実行されるアプリケーション (ワークロード) の双方をカバーすべきです。エッジコンピューティング環境におけるどんなアプリケーションも、クラウドが提供する機能ーすなわちコンピュート、ブロックストレージ、オブジェクトストレージ、仮想ネットワーク、ベアメタルやコンテナといった機能のいくつか、あるいは全てを潜在的に利用しなければ価値がないのです。
ko_kr: Edge computing 개념은 edge 사이트(예: compute, 네트워크, 스토리지 인프라)와 함께 실행되는 애플리케이션 (워크로드)을 모두 포함해야 합니다. Edge computing 환경에서 응용 프로그램은 compute, 블록 저장소, 오브젝트 저장소, 가상 네트워킹, 베어 메탈, 컨테이너를 제공하는 클라우드에서 전부 또는 일부의 기능을 잠재적으로 활용할 수 있습니다.
pt_br: O conceito de edge computing deve cobrir tanto o site de borda (ou seja, computação, rede e infraestrutura de armazenamento), quanto as aplicações (cargas de trabalho) que rodam nele. Vale à pena ressaltar que qualquer aplicação em um ambiente de edge computing deveria potencialmente alavancar qualquer ou todas as capacidades providas pela nuvem—computação, armazenamento em bloco, armazenamento de objetos, rede virtual, máquina física, ou contêineres.
zh_cn: 边缘计算的概念必须包括边缘站点（如计算、网络和存储基础设施），和运行着的应用程序（计算任务）。边缘计算环境中的应用程序还是能够享有云计算中的各种资源，如计算、块存储、对象存储、虚拟网络、裸机或者容器。
