Repository: amotoki/edge-computing-whitepaper
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, eo, id, ja, ko_kr, pt_br, zh_cn

source: The essential features that define and separate edge computing from cloud computing are:
de: Die wesentlichen Funktionen, die Edge Computing vom Cloud Computing definieren und trennen, sind:
eo: La esencaj trajtoj kiu difinas kaj apartigas rando komputiko de nuba komputiko estas:
id: Fitur penting yang mendefinisikan dan memisahkan komputasi tepi (edge computing) dari komputasi awan (cloud computing) adalah:
ja: エッジコンピューティングをクラウドコンピューティングから分別する、必要不可欠な特徴とは次のようなものです。
ko_kr: 클라우드 컴퓨팅에서 edge computing을 정의하고 분리하는 필수 기능은 다음과 같습니다:
pt_br: As características essenciais que definem e separam edge computing da computação em nuvem são:
zh_cn: 定义和区分边缘计算和云计算的最基本特征是：

source: * the ability to support a dynamic pool of multiple potentially widely distributed sites,
de: * die Fähigkeit, einen dynamischen Pool von mehreren potenziell weit verteilten Sites zu unterstützen,
eo: * La kapableco subteni dinamikan komunaĵon de oblaj potenciale vaste distribuitaj ejojn,
id: * kemampuan untuk mendukung kumpulan dinamis beberapa situs yang berpotensi didistribusikan secara luas,
ja: * 潜在的かつ後半に分散された複数のサイトの動的プールをサポートする能力
ko_kr: * 잠재적으로 광범위하게 분산된 여러 사이트의 동적 풀을 지원하는 기능,
pt_br: * a capacidade de suportar um pool dinâmico de múltiplos sites potencialmente amplamente distribuídos,
zh_cn: * 有能力支持由多个潜在宽泛分布的站点组成的动态资源池

source: * potentially unreliable network connections, and
de: * potenziell unzuverlässige Netzwerkverbindungen und
eo: * potenciale nefidinda retaj konektoj, kaj
id: * koneksi jaringan yang berpotensi tidak dapat diandalkan, dan
ja: * 潜在的に信頼できないネットワークコネクション
ko_kr: * 잠재적으로 신뢰할 수 없는 네트워크 연결
pt_br: * conexões de rede potencialmente não confiáveis, ​​e
zh_cn: * 潜在不可靠的网络连接

source: * the likelihood of difficult-to-resolve resource constraints at sites across the network.
de: * Die Wahrscheinlichkeit von schwer zu lösenden Ressourcenbeschränkungen an Standorten im gesamten Netzwerk.
eo: * La probableco de malfacila-por-solvi rimedo limoj ĉe ejoj trans la reto.
id: * kemungkinan kendala sumber daya yang sulit diselesaikan di situs-situs di seluruh jaringan.
ja: * ネットワーク間をまたぐサイトにおいてリソース制限が解決困難となる可能性
ko_kr: * 네트워크 상의 사이트에서 풀기 어려운 리소스 제약 조건의 가능성
pt_br: * a probabilidade de restrições de recursos difíceis de resolver em sites na rede.
zh_cn: * 很可能在跨网络多站点的情况下碰到的难以解决的资源限制

source: EXPLORING CHARACTERISTICS AND USE CASES
de: ERKENNTNISMERKMALE UND VERWENDUNGSFÄLLE
eo: ESPLORI KARAKTERIZAĴON KAJ UZO KAZOJ
id: MENJELAJAHI KARAKTERISTIK DAN MENGGUNAKAN KASUS
ja: 特徴とユースケースの探索
ko_kr: 특징 및 사용 사례 살펴보기
pt_br: EXPLORANDO CARACTERÍSTICAS E CASOS DE USO
zh_cn: 探索功能特性及案例

source: So what do we know so far about edge computing characteristics, use cases, and scenarios?
de: Was wissen wir bisher über Edge-Computing-Eigenschaften, Anwendungsfälle und Szenarien?
eo: Do kio ni scias ĝis nun pri rando komputanta karakterizaĵojn, uzo kazojn kaj scenarojn?
id: Jadi, apa yang kita ketahui sejauh ini tentang karakteristik komputasi tepi (edge computing), kasus penggunaan, dan skenario?
ja: それではエッジコンピューティングについて、私達が今のところ知る特徴、ユースケース、そしてシナリオはどんなものでしょうか。
ko_kr: 지금까지 edge computing 특성, 사용 사례, 시나리오에 대해 무엇을 알고 있습니까?
pt_br: Então, o que sabemos até agora sobre características de edge computing, casos de uso e cenários?
zh_cn: 所以迄今为止我们对于边缘计算的特性、用例及应用场景了解多少？

source: The defining need that drives cloud edge computing is the need for service delivery to be closer to users or end-point data sources. Edge computing environments will work in conjunction with core capacity, but aim to deliver an improved end user experience without putting unreasonable demands on connectivity to the core. Improvements result from:
de: Der entscheidende Bedarf, der Cloud Edge Computing vorantreibt, ist die Notwendigkeit, dass die Bereitstellung von Diensten näher an den Benutzern oder Endpunktdatenquellen erfolgt. Edge-Computing-Umgebungen arbeiten mit der Kernkapazität zusammen, zielen jedoch darauf ab, eine verbesserte Endbenutzererfahrung zu bieten, ohne unvernünftige Anforderungen an die Konnektivität zum Kern zu stellen. Verbesserungen ergeben sich aus:
eo: La difinanta bezonon kiu veturas nubo rando komputikon estas la bezono por servo livero esti pli proksima al uzantoj aŭ fin-punktaj datumo fontoj. Rando komputantaj mediojn laboros kune kun kerna kapacito, sed kun la celo liveri plibonigitan finan uzanto sperton sen metanta postulemajn postulojn sur konektebleco al la kerno. Plibonigoj rezultas de:
id: Kebutuhan yang menentukan yang mendorong cloud edge computing adalah kebutuhan akan pemberian layanan agar lebih mendekati pengguna atau sumber data titik akhir. Lingkungan komputasi Edge akan bekerja dalam hubungannya dengan kapasitas inti, namun bertujuan untuk memberikan pengalaman pengguna akhir yang meningkat tanpa memasukkan tuntutan konektivitas yang tidak masuk akal ke intinya. Hasil perbaikan dari:
ja: クラウドエッジコンピューティングを前に推し進める典型的なニーズは、ユーザーやエンドポイントのデータ源に向かってより近づけようとするサービスデリバリーからくるものです。エッジコンピューティング環境はコア容量と結合して動作します。一方でエッジコンピューティングは、不必要なコアとの接続要求を除外し、改善されたユーザーエクスペリエンスを提供します。改善の結果は、次のようなものからもたらされます。
ko_kr: Cloud edge computing을 주도해야하는 필요성은 사용자나 end-point 데이터 소스에 더 가깝도록 서비스 제공하기위해 필요합니다. Edge computing 환경은 코어 용량과 연계하여 작동하지만 핵심 연결성에 대한 부당한 요구 없이 향상된 최종 사용자 경험을 제공하는 것을 목표로 합니다. 개선 결과는 다음과 같습니다:
pt_br: A necessidade de definição que impulsiona a nuvem edge computing é a necessidade de a entrega de serviços estar próxima de usuários ou de fontes de dados finais. Ambientes edge computing irão trabalhar em conjunto com a capacidade do núcleo, mas visando oferecer uma melhor experiência de usuário final, sem colocar demandas irracionais na conectividade com o núcleo. As melhorias resultam de:
zh_cn: 驱动边缘计算的至关重要的动力就是为了能够更近一步的为用户或终端数据资源提供服务。边缘计算环境将与核心协作，目标在不向核心提出无理连接请求的前提下提供更佳的用户体验。将通过以下几点进行改进：

source: 1. Reducing latency: The latency to the end user could be lower than it would be if the compute was farther away—making, for instance, responsive remote desktops possible, or successful AR, or better gaming.
de: 1. Reduzieren der Latenz: Die Latenz für den Endbenutzer könnte niedriger sein, als wenn der Computer weiter entfernt wäre, was zum Beispiel responsive Remote-Desktops oder erfolgreiches AR oder besseres Spielen möglich macht.
eo: 1. Redukti atendotempon: La atendotempo al la fina uzanto povus esti pli malalta ol ĝi estus se la komputilo estis pli fora—faranta, ekzemple, respondemaj foraj labortabloj ebla, aŭ sukcesa AR, aŭ pli bona videoludado.
id: 1. Mengurangi latensi: Latensi ke pengguna akhir bisa lebih rendah daripada jika perhitungannya lebih jauh - misalnya membuat remote desktop responsif, atau AR yang sukses, atau game yang lebih baik.
ja: 1. 遅延の削減: エンドユーザーに到達するまでの遅延は、コンピューターが遠く離れたところにある場合に比べ、低くできます。ー そしてこれは、例えば反応の良いリモートデスクトップを可能にしたり、好評な AR やより良いゲームを提供します。
ko_kr: 1. 레이턴시 단축: Compute 가 멀리 떨어져있다면, 최종 사용자 레이턴시를 낮을 수 있습니다. 예를 들어, 인스턴스를 만들거나, 반응형 원격 데스트탑이 가능하거나, 성공적인 AR 프로그램이나, 더 좋은 사양의 게이밍 성능을 개선할 수 있습니다.
pt_br: 1. Redução da latência: A latência para o usuário final pode ser menor do que seria se a computação estivesse mais distante — fazendo, por exemplo, desktops remotos responsivos, ou AR bem sucedido , ou jogos melhorados.
zh_cn: 1. 降低延时：即使是远距的计算功能，能够降低用户所感受到的时延，例如能够有效地实现响应式远程桌面，增强现实或是带来更好的游戏。

source: 2. Mitigating bandwidth limits: The ability to move workloads closer to the end users or data collection points reduces the effect of limited bandwidth at a site. This is especially useful if the service on the edge node reduces the need to transmit large amounts of data to the core for processing, as is often the case with IoT and NFV workloads. Data reduction and local processing can be translated into both more responsive applications and reduces the cost of transporting terabytes of data over long distances.
de: 2. Mindern der Bandbreitenbeschränkungen: Die Möglichkeit, Workloads näher an die Endbenutzer oder Datenerfassungspunkte zu verschieben, reduziert die Auswirkungen der begrenzten Bandbreite an einem Standort. Dies ist besonders nützlich, wenn der Dienst am Randknoten die Notwendigkeit verringert, große Datenmengen zur Verarbeitung an den Kern zu übertragen, wie dies häufig bei IoT- und NFV-Arbeitslasten der Fall ist. Datenreduktion und lokale Verarbeitung können sowohl in reaktionsfähigere Anwendungen umgesetzt werden als auch die Kosten für den Transport von Terabytes an Daten über große Entfernungen reduzieren.
eo: 2. Mildigi kapacito limoj: La kapableco movi laborŝarĝojn pli proksima al la finaj uzantoj aŭ datumo kolekto punktoj reduktas la efikon de limhava kapableco ĉe ejo. Tio ĉi estas precipe utila se la servo sur la randa nodo reduktas la bezonon elsendi grandajn kvantojn de datumo al la kerna por pretigo, kiel estas ofte la kazo kun IoT kaj NFV workloads. Datuma redukto kaj loka pretigo povas esti tradukita en ambaŭ pli respondemaj aplikoj kaj reduktas la koston transporti terabajtoj de datumo super longaj distancoj.
id: 2. Mengurangi batas bandwidth: Kemampuan untuk memindahkan beban kerja lebih mendekati pengguna akhir atau titik pengumpulan data mengurangi efek bandwidth terbatas di suatu situs. Hal ini sangat berguna jika layanan pada node tepi mengurangi kebutuhan untuk mengirimkan sejumlah besar data ke inti pemrosesan, seperti yang sering terjadi pada beban kerja IoT dan NFV. Pengurangan data dan pemrosesan lokal dapat diterjemahkan ke dalam aplikasi yang lebih responsif dan mengurangi biaya pengangkutan terabyte data dalam jarak yang jauh.
ja: 2. 帯域制限の軽減: ワークロードをエンドユーザーやデータ収集ポイントに近づける能力は、サイトにおける帯域制限の効果を削減します。これは、しばしば IoT や NFV を利用する際に見られるように、エッジにあるサービスがコア向けの処理のため大量のデータ転送を行う必要性を削減する場合に特に有用です。データ削減とローカル処理は、反応の良いアプリケーションと、テラバイト級のデータを長距離伝送するコストの削減の両方に転換することができます。
ko_kr: 2. 대역폭 제한 완화: 워크로드를 최종 사용자나 데이터 수집 지점에 더 가깝게 이동시키는 기능을 사용하여 사이트에서 제한된 대역폭 영향을 줄일 수 있습니다. 이는 IoT나 NFV 워크 로드의 경우 처럼 edge 노드 서비스가 처리를 위해 대용량 데이터를 코어로 전송해야하는 필요성을 줄이는 경우에 특히나 유용합니다. 데이터 축소및 로컬 프로세싱은 응답성이 뛰어난 애플리케이션으로 변환할 수 있으며 장거리 데이터 전송시 테라바이트의 데이터 전송 비용을 절감할 수 있습니다.
pt_br: 2. Mitigação dos limites de largura de banda: A habilidade para mover cargas de trabalho para mais próximo do usuário final ou pontos de coleta de dados, reduz o efeito do limite da largura de banda para o site. Isso é especialmente útil se o serviço que está sendo executado no nó de borda reduz a necessidade para transmitir grandes quantidades de dados para o núcleo para processamento, como é frequente o caso com cargas de trabalho IoT e NFV. Redução de dados e processamento local podem ser traduzidos tanto em aplicações mais responsivas quanto em redução do custo de transporte de dados em longa distância.
zh_cn: 2. 降低带宽限制：这种将工作迁移至更接近于用户或是数据采集终端的能力，能够降低站点带宽限制所带来的影响。尤其是当边缘节点服务减少了向中枢发送大量数据处理的请求时，这一点显得及其有用。这种场景普遍适用于物联网及网络功能虚拟化负载。数据量的减少以及本地化处理能够帮助转化为具有更高响应的应用程序，并减少长距离兆兆传输所带来的支出。

source: But there are tradeoffs. To deliver edge computing, it is necessary to vastly increase the number of deployments. This institutes a significant challenge to widespread edge deployments. If managing a single cloud takes a team of ten, how can an organization cope with hundreds or even thousands of small clouds? Some requirements include:
de: Aber es gibt Kompromisse. Um Edge Computing zu liefern, muss die Anzahl der Bereitstellungen erheblich erhöht werden. Dies stellt eine große Herausforderung für die weitverbreitete Edge-Bereitstellung dar. Wenn die Verwaltung einer einzelnen Cloud ein Team von zehn Personen umfasst, wie kann eine Organisation mit hunderten oder gar tausenden kleinen Clouds umgehen? Einige Anforderungen umfassen:
eo: Sed estas kompromisoj. Por liveri randan komputikon, estas necesa vaste pliigi la nombron de deplojoj. Tio ĉi starigas gravan defion al vasta rando deplojoj. Se administranta ununuran nubon prenas teamon de dek, kiel povas organizon varti centojn aŭ eĉ milojn de malgrandaj nuboj? Kelkaj postuloj inkluzivas:
id: Tapi ada timbal balik. Untuk memberikan komputasi tepi, perlu untuk meningkatkan jumlah penyebaran. Institusi ini merupakan tantangan yang signifikan terhadap penyebaran luas di seluruh penjuru negeri. Jika mengelola satu awan membutuhkan sepuluh tim, bagaimana sebuah organisasi bisa mengatasi ratusan atau bahkan ribuan awan kecil? Beberapa persyaratan meliputi:
ja: しかし、ここにはトレードオフがあります。エッジコンピューティングを提供するということは、デプロイメント数の莫大な増加が必要不可欠です。このことは、広域に拡散されたエッジのデプロイメントのための重要なチャレンジにつながります。一つのクラウドを 10 チームで運営するとすると、組織は数百あるいは数千の小さなクラウドを協調させれうためどのようにすれば良いでしょうか？いくつかの仕様は次のようなものを含みます。
ko_kr: 하지만 절충안이 존재합니다. Edge computing을 제공하려면 배포수를 대폭 늘릴 필요가 있습니다. 이는 광범위한 배포에 대한 중요한 도전과제를 해결합니다. 단일 클라우드를 관리하는데 10명의 팀이 필요한 경우, 어떻게하면 수백, 수천대의 작은 클라우드 환경을 대처할 수 있을까요? 몇가지 요구사항은 다음과 같습니다:
pt_br: Mas existem escolhas conflitantes. Para entregar edge computing, é necessário aumentar consideravelmente o número de implantações. Isso institui um desafio significativo para difundir implantações edge. Se o gerenciamento de um única nuvem precisa de uma equipe de dez pessoas, Como uma organização pode lidar com centenas ou mesmo com milhares de pequenas nuvens? Alguns requisitos incluem:
zh_cn: 但这其中仍存在着利弊权衡。为了应用边缘计算，大幅增加部署数量是必要条件。这对大规模的边缘部署构成了一定的挑战。如果说管理单一云需要一个十人团队，那么一个组织又怎么能够处理上百甚至上千个小型云。部分要求包括：

source: 1. Standardization and infrastructure consistency are needed. Each location has to be similar; a known quantity.
de: 1. Standardisierung und Infrastrukturkonsistenz sind erforderlich. Jeder Ort muss ähnlich sein; eine bekannte Menge.
eo: 1. Normigado kaj infrastruktura konsekvenco estas devita. Ĉiu loko devas esti simila; konata kvanto.
id: 1. Konsistensi standardisasi dan infrastruktur sangat dibutuhkan. Setiap lokasi harus serupa; sebuah kuantitas yang diketahui.
ja: 1. 標準化と一貫性が必要とされます。個々の拠点は共通させるべきですし、把握された量にすべきです。
ko_kr: 1. 인프라에 대한 표준화와 일관성이 필요합니다. 각 위치는 알려진 정량과 비슷해야합니다.
pt_br: 1. É necessária uniformidade de padrões e infraestrutura. Cada local deve ser semelhante; uma quantidade conhecida.
zh_cn: 1. 需要标准化和统一的基础环境。每个区域具有类似架构；已知数量。

source: 2. Manageability needs to be automated; deployment, replacement and any recoverable failures should be simple and straightforward.
de: 2. Die Verwaltbarkeit muss automatisiert werden. Bereitstellung, Austausch und alle behebbaren Fehler sollten einfach und unkompliziert sein.
eo: 2. Mastrumebleco devas esti aŭtomatigita; deplojo, anstataŭaĵo kaj ajnaj reakireblaj malsukcesoj devus esti simpla kaj rekta.
id: 2. Manageability perlu diotomatisasi; penggelaran, penggantian dan kegagalan yang dapat dipulihkan harus sederhana dan mudah.
ja: 2. 運営能力は自動化されるべきです。デプロイメントや移行、そしてどのような回復可能な障害も、シンプルかつ簡単になるべきです。
ko_kr: 2. 관리가능성은 자동화되어야 합니다. 배치, 교체, 복구 가능한 모든 장애는 간단하고 직선적이어야 합니다.
pt_br: 2. A capacidade de gerenciamento precisa ser automatizada; implantação, substituição e quaisquer falhas recuperáveis ​​devem ser simples e diretas.
zh_cn: 2. 提供自动化管理；在处理部署，更替及任何可复原性故障时提供简洁直接的处理方法。

source: 3. Simple, cost-effective plans need to be laid for when hardware fails.
de: 3. Einfache, kosteneffektive Pläne müssen erstellt werden, wenn die Hardware ausfällt.
eo: 3. Simplaj, kostefikaj planoj devas esti submetita kiam aparato malfunkcias.
id: 3. Rencana sederhana dan hemat biaya perlu diletakkan saat perangkat keras gagal.
ja: 3. シンプルでコスト効率の良い計画は、ハードウェア故障のため必要です。
ko_kr: 3. 하드웨어 장애에 간단하고 비용 효율적인 계획을 세워야합니다.
pt_br: 3. Planos simples e econômicos precisam ser definidos para quando o hardware falhar.
zh_cn: 3. 当硬件出现故障时，提供简洁高效的应对计划。

source: 4. Locally fault-tolerant designs might be important, particularly in environments that are remote or unreachable—zero touch infrastructure is desirable. This is a question that balances the cost of buying and running redundant hardware against the cost of outages and emergency repairs. Considerations include:
de: 4. Lokal fehlertolerante Designs können wichtig sein, insbesondere in Umgebungen, die entfernt oder unerreichbar sind - eine Zero Touch-Infrastruktur ist wünschenswert. Dies ist eine Frage, die die Kosten für den Kauf und den Betrieb redundanter Hardware mit den Kosten von Ausfällen und Notfallreparaturen in Einklang bringt. Überlegungen umfassen:
eo: 4. Loke misfaro-tolerantaj desegnoj povus esti grava, precipe en medioj kiu estas izolita aŭ neatingebla—nulo tuŝa infrastrukturo estas dezirinda. Tio ĉi estas demando kiu ekvilibrigas la koston de aĉetado kaj operacii redundan aparataron kontraŭ la kosto de senkurentiĝoj kaj krizaj riparoj. Konsideroj inkluzivas:
id: 4. Desain toleransi kesalahan lokal mungkin penting, terutama di lingkungan yang terpencil atau tidak terjangkau - infrastruktur sentuh nol sangat diharapkan. Ini adalah pertanyaan yang menyeimbangkan biaya untuk membeli dan menjalankan perangkat keras yang berlebihan terhadap biaya pemadaman dan perbaikan keadaan darurat. Pertimbangan meliputi:
ja: 4. 局所的な障害許容設計は、特に遠隔地や到達不可能な環境において重要になるかもしれません。そのような場合、ゼロタッチインフラが望まれます。これは、冗長性を持つハードウェアを購入して稼働させるコストと、障害影響と緊急対応のコストとの対比になります。考慮すべき事項は次のようなものを含みます。
ko_kr: 4. 국지적으로 내결함성이 있는 설계가 중요할 수 있습니다. 특히 원격이나 접근할 수 없는 환경에서 제로 터치 인프라가 바람직합니다. 이는 중복 하드웨어 구매와 실행 비용, 정전과 응급 복구 비용의 균형을 맞추는 문제입니다. 고려 사항은 다음과 같습니다:
pt_br: 4. Projetos locais tolerantes a falhas podem ser importantes, particularmente em ambientes que são remotos ou não acessíveis. Um infraestrutura de zero toque é desejável. Esta é uma questão que equilibra o custo de comprar e executar hardware redundante contra o custo de interrupções e reparos de emergência. As considerações incluem:
zh_cn: 4. 本地式容错设计也不容忽视，尤其是面对远程或不可达的环境，零接触式的管理模式。这同时也是一个如何权衡购买和运行大量冗余硬件设备与针对服务中断和应急修复的问题。其中考量包括

source: 1. Do these locations need to be self-sufficient?
de: 1. Müssen diese Standorte autark sein?
eo: 1. Ĉu ĉi tiuj lokoj devas esti mem-sufiĉa?
id: 1. Apakah lokasi ini perlu swasembada?
ja: 1. これらの場所は自給自足する必要があるでしょうか？
ko_kr: 1. 이 위치는 자급자족 할 필요가 있습니까?
pt_br: 1. Esses locais precisam ser autosuficientes?
zh_cn: a. 这些区域是否需要能够自给自足？

source: 2. If a location has a failure, no one is going to be onsite to fix it, and local spares are unlikely.
de: 2. Wenn ein Standort einen Fehler aufweist, wird niemand vor Ort sein, um ihn zu beheben, und lokale Ersatzteile sind unwahrscheinlich.
eo: 2. Se loko havas malfunkcion, neniu estas iranta tien ripari ĝin kaj lokaj rezervaĵoj estas neverŝajna.
id: 2. Jika lokasi mengalami kegagalan, tidak ada yang akan menunggu di tempat untuk memperbaikinya, dan suku cadang lokal tidak mungkin terjadi.
ja: 2. この場所が障害に陥ったとき、オンサイト補修に行けそうな人は誰もおらず、現地に補修部材を備えることはふさわしくないでしょう。
ko_kr: 2. 해당 위치에서 오류가 있는 경우, 아무도 현장을 반문하여 해결할 수 없어며, 로컬 예비 부품이 거의 없습니다.
pt_br: 2. Se um local tiver uma falha, ninguém estará no local para corrigi-la e as peças sobressalentes locais são improváveis.
zh_cn: b. 如果某一区域出现了故障，没有人会去现场修复，本地备件也不可能具备。

source: 3. Does it need to tolerate failures? And if it does, how long is it going to be before someone will be available to repair it—two hours, a week, a month?
de: 3. Müssen Fehler toleriert werden? Und wenn ja, wie lange wird es dauern, bis jemand zur Reparatur bereit ist - zwei Stunden, eine Woche, ein Monat?
eo: 3. Ĉu ĝi devas toleri malfunkcion? Kaj se ĝi faras, kiom longe ĝi povas daŭri antaŭ ol iu estos havebla ripari ĝin—du horoj, semajno, monato?
id: 3. Apakah perlu mentolerir kegagalan? Dan jika ya, berapa lama waktu yang akan terjadi sebelum seseorang akan siap memperbaikinya-dua jam, seminggu, satu bulan?
ja: 3. 障害許容性は必要とされているでしょうか？そしてもしそうであれば、誰かが復旧対応を行えるようになるまでどの程度の時間が許容されるでしょう。2 時間、1 週間、あるいは 1 ヶ月でしょうか？
ko_kr: 3. 실패를 용인해야 합니까? 만약 그렇다면, 누군가 수리할 수 있는 시간은 얼마나 걸릴 것 같습니까? (2시간, 1주일, 1개월)
pt_br: 3. Precisa tolerar falhas? Se precisa, quanto tempo será preciso até que alguém possa estar disponível para consertá-las? Duas horas, uma semana, um mês?
zh_cn: c. 是否需要容错机制？如果确实需要，那么在有人能够修复前容错需要维持多久，两小时，一周还是一个月？

source: 1. Maintainability needs to be straightforward—untrained technicians perform manual repairs and replacements, while a skilled remote administrator re-installs or maintains software.
de: 1. Wartbarkeit muss unkompliziert sein: Ungeübte Techniker führen manuelle Reparaturen und Ersetzungen durch, während ein erfahrener Remote-Administrator Software neu installiert oder wartet.
eo: 1. Funkciteneblo devas esti simpla—nespertaj teknikistoj elfaras manajn riparojn kaj anstataŭaĵojn, dum kvalifikita fora administranto re-instalas aŭ daŭrigas softvaron.
id: 1. Perawatan perlu teknisi yang tidak terlatih langsung melakukan perbaikan dan penggantian manual, sementara administrator jarak jauh yang terampil menginstal ulang atau merawat perangkat lunak.
ja: 1. 保守性は簡便にすべきものです。習熟していない技術者が、手動で復旧作業や交換作業を行います。一方で遠隔地にいる熟練した管理者は、再インストールやソフトウェア保守を行います。
ko_kr: 1. 손쉬운 유지 보수가 필요합니다. 숙련된 원격 관리자가 소프트웨어를 재설치하거나 유지 관리하는 동안 숙련되지 않은 기술자가 직접 수리나 교체를 수행해야합니다.
pt_br: 1. A capacidade de manutenção precisa ser direta - técnicos não treinados realizam reparos e substituições manuais, enquanto um administrador remoto experiente restabelece ou mantém o software.
zh_cn: 5. 维护操作必须简洁。未经过培训的工人能够进行人工修复和替换，而熟练的远程管理员可以进行重装或软件维护。

source: 2. Physical designs may need a complete rethink. Most edge computing environments won’t be ideal—limited power, dirt, humidity and vibration have to be considered.
de: 2. Physische Designs müssen möglicherweise komplett überarbeitet werden. Die meisten Edge-Computing-Umgebungen sind nicht ideal - begrenzte Leistung, Schmutz, Feuchtigkeit und Vibration müssen berücksichtigt werden.
eo: 2. Fizikaj desegnoj povus bezoni kompletan rekonsideron. Plejparto de rando komputanta mediojn ne estos ideala—limita potenco, malpuraĵo, humideco kaj vibro devas esti konsiderita.
id: 2. Desain fisik mungkin perlu dipikir ulang secara keseluruhan. Sebagian besar lingkungan komputasi tepi tidak akan ideal-daya terbatas, kotoran, kelembaban dan getaran harus dipertimbangkan.
ja: 2. 物理設計は完全に考え直す必要があるかもしれません。多くのエッジコンピューティングの環境は理想的にはならないでしょう。制限された電力、塵埃、湿度や振動と言ったものは考慮されるべきです。
ko_kr: 2.물리적인 디자인이 고려되어야 합니다. 대부분의 edge computing 환경에서 이상적으로 확인할 수 없는 제한된 전력량, 먼지, 습기, 진동에 대해서 고려해야합니다.
pt_br: 2. Os projetos físicos podem precisar ser repensados completamente. A maioria dos ambientes edge computing não serão ideais—potência limitada, sujeira, umidade e vibrações devem ser considerados.
zh_cn: 6. 物理设计可能需要整体反思。大多数的边缘计算环境并不理想，有限的能源，灰尘，湿度以及振动都应被考虑在内。

source: USE CASES
de: ANWENDUNGSFÄLLE
eo: UZO KAZOJ
id: GUNAKAN KASUS
ja: ユースケース
ko_kr: 사용 사례
pt_br: CASOS DE USO
zh_cn: 案例

source: There are probably dozens of ways to characterize use cases and this paper is too short to provide an exhaustive list. But here are some examples to help clarify thinking and highlight opportunities for collaboration.
de: Es gibt wahrscheinlich Dutzende von Möglichkeiten, Anwendungsfälle zu charakterisieren, und dieses Papier ist zu kurz, um eine erschöpfende Liste zu liefern. Aber hier sind einige Beispiele, die helfen, das Denken zu klären und Möglichkeiten für die Zusammenarbeit aufzuzeigen.
eo: Estas verŝajne dekduoj de vojoj karakterizi uzo kazojn kaj ĉi tiu papero estas tro mallonga provizi ĝisfundan liston. Sed ĉi tie estas kelkaj ekzemploj helpi klarigi pensadon kaj prilumi ŝancojn por kunlaboro.
id: Mungkin ada lusinan cara untuk mengkarakterisasi kasus penggunaan dan makalah ini terlalu pendek untuk memberikan daftar yang lengkap. Tapi berikut adalah beberapa contoh untuk membantu memperjelas pemikiran dan menyoroti kesempatan untuk berkolaborasi.
ja: 恐らくユースケースを分類する方法はたくさんあるでしょうし、このペーパーは完全なリストを提供するには短すぎるでしょう。しかし、考え方の整理を助けるいくつかの例と、コラボレーションのための重要な機会をここに掲載します。
ko_kr: 사용 사례를 특성화하는데 수십 가지 방법이 있을 수 있으며, 이 문서는 짧아 자세한 목록을 보여 줄 수 없습니다. 그러나 관점을 분명히하고 공동 작업 기회를 강조하는데 도움이 되는 몇가지 예가 존재합니다.
pt_br: Existem provavelmente dezenas de formas para categorizar casos de uso e esse documento é muito curto para prover uma lista exaustiva sobre isso. Mas aqui estão alguns exemplos para ajudar a clarear o pensamento e realçar oportunidades para colaboração.
zh_cn: 用来表征案例的方法可能会有几十种，本文因长度限制而不能够详细罗列。这里提供了一些示例以帮助梳理思绪和点明应用的机遇。
